[
  {
    "title": "Spike in cocaine, contraband cigarettes, and currency seizures: India’s anti-smuggling agency",
    "link": "https://worldsnews24.vercel.app/business/spike-in-cocaine-contraband-cigarettes-and-currency-seizures-india-s-anti-smuggling-agency",
    "siteurl": "https://worldsnews24.vercel.app/business/spike-in-cocaine-contraband-cigarettes-and-currency-seizures-india-s-anti-smuggling-agency",
    "description": "Gold quantity seized fell by 9% in FY24 to 1,319 kg, Dubai a major transit hub for cigarette smuggling into India\n\n",
    "thumbnail": "https://images.indianexpress.com/2024/12/feature-image-20.jpg",
    "description1": "Seizures of drugs such as cocaine and methamphetamine, contraband cigarettes, and illicit foreign currency by the Directorate of Revenue Intelligence (DRI) have seen a sharp rise over the past year. According to DRI’s latest Smuggling in India report, the agency conducted 47 cocaine seizures worth Rs 975 crore in FY24—more than double the number recorded in the previous financial year. The quantity of cocaine smuggled into India, primarily through airports, increased by 9 per cent to 107 kg during the same period. Methamphetamine smuggling has also spiked, especially in northeastern states like Assam and Mizoram, according to DRI’s latest bulletin. While FY24 recorded meth seizures of 136 kg, the first half of FY25 alone saw 123 kg confiscated in 11 cases. The bulletin highlights that free trade warehousing zones in West Asia, particularly in Dubai, are becoming major transit hubs for contraband cigarette smuggling from Southeast Asia to India. The first half of FY25 saw cigarette seizures climb by 19 per cent, reaching 3.95 crore sticks, compared to 3.31 crore sticks during the same period in FY24. Illicit foreign currency seizures have also surged. DRI officials seized Rs 13.8 crore in foreign currency during the first half of FY25, surpassing the Rs 12.4 crore confiscated in all of FY24. Additionally, the agency uncovered a Rs 576 crore trade-based money laundering (TBML) racket. The scheme involved importing cheap electrical goods and cosmetics at inflated prices to channel foreign exchange out of the country. Dip in gold seizures In FY24, DRI seized 1,319 kg of smuggled gold, slightly lower than over 1,450 kg confiscated in FY23. Land routes, particularly from Myanmar, Bangladesh, and Nepal, contributed to 55 per cent of the seizures while air routes, increasingly from certain African and Central Asian countries, contributed to 36 per cent. “Gold smuggling in India has evolved with smuggling syndicates now employing ‘mules’ with diverse profiles, including foreign nationals and families, alongside insiders. Smuggling syndicates even leverage international departure gates, where airport workers and other staff collude in smuggling gold from transit passengers,” the report said. In a m",
    "description2": "ajor heist in July, the Indo-Tibetan Border Police (ITBP) seized 108 kg of gold being smuggled on mules by two porters in eastern Ladakh. The investigation was handed over to DRI “given the wider ramifications”, which has led to the arrest of ten people involved in the smuggling. Lower heroin and ganja seizures “In recent years, India has witnessed a marked increase in the availability and use of a wide range of narcotic substances,” the report said. “Comparison of narcotics seizures over the past five years indicates an increasing trend for cocaine, while both heroin and ganja have shown a decreasing trend in terms of quantity,” it added. In FY24, DRI booked 109 cases involving 8,224 kg of narcotic drugs and psychotropic substances. This included 107 kg of cocaine (Rs 975 crore), 49 kg of heroin (Rs 365 crore), 236 kg of mephedrone (Rs 357 crore), and 136 kg of methamphetamine (Rs 275 crore). Seizures of contraband cigarettes stood at 9.1 crore sticks in FY24 valued at Rs 179 crore. The majority of the smuggling was through sea routes. “Apart from the Myanmar- India border, the smuggling syndicates based in South East Asia and the Middle East carry out major operations through sea route. Free Trade Warehousing Zones in the Middle East are emerging as a major transit point from where cigarette- concealed consignments are shipped to India. Though illicit cigarettes are reportedly manufactured in certain South East Asian countries, it appears that the consignments are initially shipped to Dubai from southeast Asia and then re-routed to India,” the bulletin noted. Wildlife smuggling In five operations, DRI seized 53.5 kg of elephant tusks in FY24. Other wildlife items seized across the country include leopard skins, live pangolins, pangolin scales, parakeets, live peacocks, peacock feathers, and Indian turtles. The Wildlife Protection Act was amended in 2023 to authorize customs officers under Section 50(1)(c) to seize illegally traded wildlife within the country, effective from April 1, 2023. “The rivers in India’s Gangetic plain teem with life including many indigenous species of turtles. In a major crackdown, DRI conducted a series of operations and rescued 643 turtles,” the bulletin said.",
    "image": "https://images.indianexpress.com/2024/12/feature-image-20.jpg",
    "date": "4/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T18:29:34+05:30",
    "dateModified": "2024-12-04T18:29:34+05:30"
  },
  {
    "title": "India had ‘limited success’ in capturing ‘China Plus One’ opportunity: NITI Aayog",
    "link": "https://worldsnews24.vercel.app/business/india-had-limited-success-in-capturing-china-plus-one-opportunity-niti-aayog",
    "siteurl": "https://worldsnews24.vercel.app/business/india-had-limited-success-in-capturing-china-plus-one-opportunity-niti-aayog",
    "description": "This comes just a day after the two large economies, the US and China, entered into a fresh trade conflict, imposing tit-for-tat trade restrictions on each other.",
    "thumbnail": "https://images.indianexpress.com/2024/12/India-China.jpg",
    "description1": "Even as a new NITI Aayog report, the ‘Trade Watch’, released on Wednesday, says that India has seen “limited success so far” in capturing the ‘China Plus One’ strategy adopted by multinational companies looking to de-risk their supply chains, NITI Aayog CEO BVR Subrahmanyam has suggested that trade policies under US President-elect Donald Trump could result in a potential economic boom for India, driven by significant trade diversion in global trade. “Whatever Trump has announced so far, which is likely to come up… there are opportunities. We are the man at first slip. The ball is coming in our direction. Whether we hold the catch or drop it is for us to decide. There will be huge disruption, and if we prepare for it, there will be a massive boom due to trade diversion,” Subrahmanyam said during a press briefing. This comes just a day after the two large economies, the US and China, entered into a fresh trade conflict, imposing tit-for-tat trade restrictions on each other. After the US announced export restrictions on computer chip-making equipment, software, and high-bandwidth memory chips, China retaliated on Tuesday by banning exports of gallium, germanium, antimony, and other key high-tech materials to the US. The fresh trade war is significant because “connecting economies”, perceived as neutral and not aligned with either the US or China, such as India, have benefited from the geopolitical tensions between the two nations since Trump’s first term. Responding to a question about Trump’s recent tariff threats, the former commerce secretary noted that the US is India’s largest trading partner and that India-US relations extend beyond trade, being deeply rooted in geopolitical and cultural dimensions. “There is a huge upside in improving trade in goods and services. There is 70 per cent of world trade where our share is less than 1 per cent. This is where the opportunity lies. We need to explore new markets and new products,” Subrahmanyam said. On a proposal for a 25 per cent hike in steel import duties, Suman Bery, Vice Chairperson of NITI Aayog, commented: “There are points of principle and there are points of pragmatism. If someone produces cheaply in the world and others are buying, you are reducing your competitiveness by putting up a barrier, and there are downstream consequences for domestic market users of the product.” He added, “In this particular ca",
    "description2": "se, we are talking about a source of supply which is not considered a market economy and is relatively opaque in its means of support to its industry, which is exhibiting a way of oversupply.” Notably, in Q1 FY25, Indian iron and steel exports experienced a massive decline (33 per cent), primarily due to weak domestic demand and excess capacity in China, which led to an oversupply of steel in global markets, the NITI Aayog report stated. On Trump’s trade policies, Arvind Virmani, member NITI Aayog, remarked that a general 10 per cent tariff by the US on all imports would not negatively affect India. “But a 60 per cent tariff on China will open up opportunities for India. In the short term, there could be a shock,” Virmani said. The ‘Trade Watch’ report, meanwhile, said that countries such as Vietnam, Thailand, Cambodia, and Malaysia have emerged as bigger beneficiaries of the ‘China Plus One’ strategy. Factors such as cheaper labour, simplified tax laws, lower tariffs, and proactiveness in signing Free Trade Agreements (FTAs) have played a crucial role in expanding their export shares. The report also highlighted that ongoing trade fragmentation stems from strict export control measures imposed by the US on Chinese goods to limit China’s growth and technological progress. While China remains India’s leading competitor across most export categories, countries like Brazil, Indonesia, and South Africa generally trail India. However, Malaysia and Thailand outperform India in select sectors, such as electrical machinery. For India, the iron and steel industry, which represents 23.5 per cent of its EU exports, faces the highest exposure under the Carbon Border Adjustment Mechanism (CBAM), the report said. Indian firms could incur tariffs of 20–35 per cent, leading to higher costs, reduced competitiveness, and lower demand in the EU market. “Compliance costs are also expected to rise due to the requirement for detailed emissions reporting,” the report said. “Several studies assessing the EU’s CBAM identify African and Asian countries as the most vulnerable to its effects. CBAM, aimed at preventing carbon leakage, will apply to high-risk imports such as cement, iron and steel, aluminium, fertilisers, electricity, and hydrogen starting in January 2026. It mandates the purchase of CBAM certificates, reflecting the carbon emissions linked to these goods,” the report added.",
    "image": "https://images.indianexpress.com/2024/12/India-China.jpg",
    "date": "4/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T17:18:42+05:30",
    "dateModified": "2024-12-04T17:18:42+05:30"
  },
  {
    "title": "RBI policy meet starts: Will central bank go for CRR cut, why that is important for you",
    "link": "https://worldsnews24.vercel.app/business/rbi-policy-meet-starts-will-central-bank-go-for-crr-cut-why-that-is-important-for-you",
    "siteurl": "https://worldsnews24.vercel.app/business/rbi-policy-meet-starts-will-central-bank-go-for-crr-cut-why-that-is-important-for-you",
    "description": "While the RBI Monetary Policy Committee is likely to keep the repo rate unchanged, the central bank may announce a cut in the cash reserve ratio. Here's what it means, and the impact it can have.",
    "thumbnail": "https://images.indianexpress.com/2024/12/rbi.jpeg",
    "description1": "The Reserve Bank of India's three-day monetary policy review started on Wednesday (December 4). Although there seems to be a broad consensus that the repo rate — the rate at which RBI lends to other banks — is likely to remain unchanged at 6.5 per cent, there is an expectation that the central bank may announce a cut in the cash reserve ratio (CRR). The calls for a reduction in the CRR have gained momentum amid a tight liquidity condition in the banking system and shockingly low gross domestic product (GDP) growth, which slowed to a seven-quarter low of 5.4 per cent in the July-September 2024 quarter. The reduction in the CRR will be a signal that the RBI is keen on easing the monetary policy without cutting the repo rate. What is Cash Reserve Ratio? The CRR is the percentage of a bank’s total deposits that it is required to maintain in liquid cash with the RBI as a reserve. The CRR percentage is determined by the RBI from time to time. At present, it is fixed at 4.5 per cent. Banks do not get any interest on this amount. The CRR is a tool used by the RBI to manage inflation and check excessive lending. Will RBI announce a cut in CRR on December 6? While the RBI’s Monetary Policy Committee (MPC) decides on the repo rate and policy stance, the responsibility of liquidity measures lies solely with the RBI. The RBI may reduce the CRR either by 25 basis points (bps) or 50 bps, analysts said. One basis point is one-hundredth of a percentage point. This would be the first cut in the CRR in more than 4.5 years. “The liquidity in the banking system has tightened because of the RBI’s actions to stabilise the rupee. There have been a lot of dollar sales (by the RBI), which has affected the overall liquidity in the system. In December, liquidity will further tighten due to outflows",
    "description2": " related to payment of advance tax, goods and services tax (GST), and quarter-end demand for credit. Under this situation, some kind of a permanent measure can be announced (by the RBI), which could be a CRR cut or OMO purchase,” said Madan Sabnavis, Chief Economist, Bank of Baroda. The RBI has been selling dollars in the forex market to check the rupee volatility caused due to continued Foreign Portfolio Investors (FPI) selling and strengthening of the US dollar. Since October 1, the rupee has depreciated nearly 1 per cent against the dollar. The country’s forex reserves have fallen by nearly $45 billion between October 4 and November 22, on account of RBI’s intervention in the forex market to stabilise the rupee. The MPC is likely to keep the repo rate unchanged at 6.5 per cent in the policy. What will be the impact of a CRR cut? If RBI decides to cut the CRR by 50 bps, it would free up Rs 1.10 lakh crore to Rs 1.2 lakh crore of bank liquidity parked with the RBI. In case of a 25 bps reduction, Rs 55 crore to Rs 60 crore of additional funds will be available with banks. The surplus liquidity can be used by banks for lending, which would help spur economic growth. “A CRR cut will free up bank money, which can further be deployed for lending. There is a chance that banks may pass on the benefits of this CRR cut to borrowers. Usually, the cut in CRR is net interest margin (NIM) accretive for banks,” said VRC Reddy, Head Treasury, Karur Vysya Bank. When did the RBI last reduce the CRR? The Reserve Bank had last cut the CRR in March 2020 during Covid. It reduced the CRR from 4 per on March 28, 2020, after keeping it unchanged at 3 per cent for the previous seven years. Since March 2020, the CRR has been raised three times. It was last changed to 4.5 per cent on May 21, 2022.",
    "image": "https://images.indianexpress.com/2024/12/rbi.jpeg",
    "date": "4/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T11:29:28+05:30",
    "dateModified": "2024-12-04T11:29:28+05:30"
  },
  {
    "title": "If government is going to protect steel producers, needs to protect 8 lakh MSMEs too: EEPC Chairman",
    "link": "https://worldsnews24.vercel.app/business/if-government-is-going-to-protect-steel-producers-needs-to-protect-8-lakh-msmes-too-eepc-chairman",
    "siteurl": "https://worldsnews24.vercel.app/business/if-government-is-going-to-protect-steel-producers-needs-to-protect-8-lakh-msmes-too-eepc-chairman",
    "description": "EEPC Chairman Pankaj Chadha said while the balance sheets of large steel manufacturers remain robust, those of around 8 lakh MSMEs are in a precarious state.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Steel.jpg",
    "description1": "Any duty hike on steel imports to protect steel manufacturers will have a detrimental impact on small industries that are already grappling with numerous challenges, Pankaj Chadha, Chairman of the Engineering Export Promotion Council (EEPC) of India, said on Wednesday. This follows reports that the Ministry of Steel has proposed a 25 per cent increase in duty to shield domestic manufacturers from steel being dumped into India by China, as well as a surge in imports from several countries with which India has a free-trade agreement (FTA). “MSMEs are not being invited to the ongoing consultations to address trade-related issues faced by the steel industry. Discussions about a duty hike will hurt the downstream industry. Our perspective is straightforward: if protection is being provided for steel producers, there must also be protection for MSMEs. You cannot have a situation where producers are safeguarded while the 8 lakh MSMEs are left without support,” Chadha said. He added that while the balance sheets of large steel manufacturers remain robust, those of around 8 lakh MSMEs are in a precarious state. Within EEPC, 50 per cent of export value is contributed by MSME members, and 60 per cent of its members are MSMEs. “How will MSMEs compete with international players? The steel sector should be addressed, but not at the expense of other sectors. For instance, Japanese steel shipments are currently stuck at ports due to delays in issuing no-objection certificates (NOCs). These ",
    "description2": "products are unavailable in India, and shipments have been stalled for the last three months,” Chadha said. Meanwhile, a report by the Global Trade Research Initiative (GTRI) stated that India’s steel imports are “neither excessive nor unwarranted.” According to the report, half of these imports consist of critical raw materials for domestic production, while 40 per cent are specialised items that India does not produce in sufficient quantities. “Despite this, restrictive import policies continue to stifle the industry. The Steel Ministry's inefficient processes not only burden businesses but also risk exemplifying the challenges of India’s business environment. Immediate, high-level intervention is essential to streamline procedures and support the growth of the steel sector,” the GTRI report said. Ajay Srivastava, a former trade officer and head of GTRI, argued that India’s large steel producers, despite claiming hardship from imports, have prospered due to protective policies. He said that domestic stainless steel prices are 25–30 per cent higher than comparable imported steel for certain thicknesses, even after accounting for duties. “By monopolising raw materials and prioritising supply to their own downstream ventures, these large firms have forced many small businesses to close. This monopolistic behaviour warrants investigation by the Competition Commission of India (CCI), especially given the record profits reported by major players in recent years,” Srivastava said.",
    "image": "https://images.indianexpress.com/2024/12/Steel.jpg",
    "date": "4/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T19:48:25+05:30",
    "dateModified": "2024-12-04T19:48:25+05:30"
  },
  {
    "title": "IndiGo ranked among worst airlines globally by AirHelp; airline refutes survey, questions its credibility",
    "link": "https://worldsnews24.vercel.app/business/indigo-ranked-among-worst-airlines-globally-by-airhelp-airline-refutes-survey-questions-its-credibility",
    "siteurl": "https://worldsnews24.vercel.app/business/indigo-ranked-among-worst-airlines-globally-by-airhelp-airline-refutes-survey-questions-its-credibility",
    "description": "AirHelp releases an annual ranking of international airlines and airports. The rankings for airlines are based on three criteria — on-time performance, customer opinion, and processing of compensation claims.",
    "thumbnail": "https://images.indianexpress.com/2024/11/Untitled-design-3-17.jpg",
    "description1": "India’s largest airline IndiGo has been listed among the world’s worst airlines by European air passenger claims processing and facilitating agency AirHelp, which has ranked the airline at the 103rd spot out of a total of 109 airlines in the rankings. Reacting to the AirHelp rankings, IndiGo has refuted the survey and even questioned its credibility. AirHelp releases an annual ranking of international airlines and airports. The rankings for airlines are based on three criteria — on-time performance, customer opinion, and processing of compensation claims. According to AirHelp, the three criteria contribute to the airline’s score in equal measure, or 33.33 per cent each. In its 2024 report, AirHelp gave IndiGo a score of 4.80, placing it at the 103rd spot among 109 airlines in the list. The only other Indian airline on the list is Air India, which has been ranked 61 with a score of 6.15. Brussels Airlines has been ranked at the pole position, followed by Qatar Airways, and United Airlines with scores of 8.12, 8.11, and 8.04, respectively. “India’s aviation regulator DGCA (Directorate General of Civil Aviation), publishes data on airline punctuality and customer complaints monthly. IndiGo has consistently scored high on punctuality and has the lowest customer complaint ratio for an airline of its size and scale of operations. The data published in the survey by AirHelp, an EU claim processing agency, does not report the sample size from India, and neither takes into account the methodology or compensation guidelines used by the global aviation indust",
    "description2": "ry — casting a doubt on its credibility,” IndiGo said in a statement. IndiGo is India’s largest airline with a domestic market share of over 60 per cent. It is also among the top airlines globally by passenger volumes. In 2023, it flew over 100 million passengers across its domestic and international network. “As India’s most preferred airline, IndiGo refutes the findings of this survey and reiterates its promise of on-time, affordable, courteous and hassle-free travel experience for its customers,” the airline added. According to DGCA data, the airline has among the lowest ratio of passenger complaints to passengers ferried. In the DGCA’s October air traffic report, IndiGo’s number of complaints per 10,000 passengers carried was 0.2. Vitara, which has now merged with Air India, was the only carrier that fared better than IndiGo in terms of passenger complaints in October, the DGCA data shows. The DGCA monthly traffic report also mentions on-time performance of airlines for four metropolitan airports — Bangalore, Delhi, Hyderabad, and Mumbai. In the October report, IndiGo was at the top of the list with an on-time performance score of 71.9 per cent. It is not clear if AirHelp takes DGCA data into consideration for its rankings. According to the agency, it collects data from multiple commercial vendors and creates its “own sophisticated database of flight data”. AirHelp claims that it cross-references its statistics with “a variety of reliable sources including government agencies, airport databanks, flight-tracking vendors and historical resources”.",
    "image": "https://images.indianexpress.com/2024/11/Untitled-design-3-17.jpg",
    "date": "4/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T17:54:02+05:30",
    "dateModified": "2024-12-04T17:54:02+05:30"
  },
  {
    "title": "‘Railway was the first sector where sanctions were imposed… None of our projects stopped even for a week’: Russia’s TMH CEO Kirill Lipa",
    "link": "https://worldsnews24.vercel.app/business/railway-was-the-first-sector-where-sanctions-were-imposed-none-of-our-projects-stopped-even-for-a-week-russia-s-tmh-ceo-kirill-lipa",
    "siteurl": "https://worldsnews24.vercel.app/business/railway-was-the-first-sector-where-sanctions-were-imposed-none-of-our-projects-stopped-even-for-a-week-russia-s-tmh-ceo-kirill-lipa",
    "description": "TMH CEO Kirill Lipa said the plan was to start Vande Bharat production this year, but it will take several months due to the redesign required due to changes sought by Indian Railways, ",
    "thumbnail": "https://images.indianexpress.com/2024/12/TMH-CEO-1.jpg",
    "description1": "Transmashholding (TMH), the largest manufacturer of locomotives and rail equipment in Russia, said that the company investments in India would facilitate the supply of high-value enginnering products from India to Russia and could go a long way in balancing the Indo-Russia trade deficit. The company also said that it is looking to manufacture other rolling stocks, besides the Vande Bharat coaches that it may start producing by 2025. Last year, the Indian Railways signed a contract with Kinet Railway Solutions Limited, an Indo-Russia joint venture that entails a major shareholding by TMH, for supply of 1,920 Vande Bharat Sleeper coaches. The production was expected to begin by the end of this year, but in May, Indian Railways sought to redesign coaches by adding more toilets and a pantry car in each carriage. This has been cited as a reason for delays in the delivery schedule. Kirill Lipa, CEO of TMH, spoke to The Indian Express at his Efremova Street office in Moscow. Edited excerpts: What TMH can offer to India and Vande Bharat trains? When I present TMH to anybody in the world, I say that in order to understand who we are, let's first look at the map of Russia. You have to fly around nine hours to go from one end to another. Russia, in terms of Railways, is the most advanced country in the world. Because usage of the network is intense. We are among the top five companies that are dedicated to the Railway sector. CRRC of China is the largest rolling-stock manufacturer. Then there are European companies Alstom, General Electric, Siemens, and us. We are 100 per cent privately owned. We produce everything related to Railway infrastructure. Underground metros, on-the-ground trams, EMUs, DMUs, passenger coaches, locomotives, freight wagons. Whatever we do is being developed locally by our TMH engineering team. History and historical traditions are very important for this. What is the current status of Vande Bharat trains contract? We have taken over the Latur factory in Maharashtra (the Marathwada Rail Coach Factory of the Rail Vikas Nigam Ltd). The plan was to start it (production) this year, but due to the changes sought by Indian Railways, we need to redesign the coach. It will take several months. But anyhow, we will do it next year. I cannot say exactly which month we will be able to start the production. I was very positively surprised that the contract with Indian Railways was signed two weeks after the announcement of sanctions against our company in the United States. I had a discussion with the Indian officials and they said that they will act according to the interest of the country. What are the challenges given the changes being sought? The significant changes sought involve the design of coaches. From the outside, it seems that an additional lavatory is not an issue, the problem emanates from the engineering point. You need to change the whole layout of the coach like windows, seats etc. We designed it according to the contract. The pantry is another issue. In some way, the whole train set will be redesigned. We have insisted on certain compensation for the redevelopment of the product because it takes time and finance. If you look into the tender, our offer was 14 per cent less than the second bidder. To my understanding, even if we increase the price by certain numbers, we will not exceed the next bidder. So in any way, we are not exceeding the ceiling. Did you seek any assistan",
    "description2": "ce from the Russian government? Yes, we raised this issue in the last intergovernmental meeting between India and Russia in New Delhi, in the presence of India's foreign minister S Jaishankar and First Deputy Prime Minister of Russia Denis Manturov. We raised them in the right manner. We are not creating any pressure, but we need a very clear explanation on the matter. In some cases I do not understand the approach of Indian Railways. There are some bureaucratic hands behind this. Also we do not have any past experience in India. In my opinion, all that we are discussing right now can be resolved within two hours. But we are spending months just sending letters and waiting for an explanation. Are the sanctions imposed by the West affecting you? Whatever sanctions they are imposing on us, we can keep on moving ahead because we were never dependent on Western technology. We are also not closed to the international world; we have joint ventures across the country. Railway was the first sector where sanctions were imposed by European countries and the US. None of the projects stopped even for a week. We immediately switched to other suppliers, local suppliers etc. Then, who are the suppliers of Vande-Bharat coaches? I don't want to name the supplier because once you put it in the newspaper, it will be a very risky situation for them. The development of the local Indian market is so high that we got the supply of certain components in India even before the sanctions. However the contract was with some European companies. So now we just have to remove the European companies and sign the contract directly with the Indian companies. What is the actual reason to invest in India? Today the trade between India and Russia is demanding the balancing of the trade. Right now, it is negative towards India, so today India is importing more from Russia than exporting to it. We are ready to invest in India because its economic growth and interest rates are very different. We want to develop in India so that some of them can be supplied to Russia as well. Geopolitically, we are friends, but we think that these friendships should be based on some practical considerations. It cannot be limited to just love for Russian poets, writers, ballet, and Indian culture, dance and movies. We are practical people, so we should create some trade opportunities. What are the other projects that you are looking for in India? Well, when I need to explain to non-engineers why the Moscow metro is better than any other in the world, I tell them one example. Some years ago we had a football tournament and one million passengers in the underground watched the football. I believe that we can bring this knowledge to India and your cities. Then we can come with EMUs and the idea is to operationalise it like a metro. So we will have an EMU every two minutes. Also to connect the multiple stations of metro and EMUs. So the passenger can travel with one ticket in both modes of transportation. Sleeper coaches are our priority. We produce more than 1,500 sleeper coaches per year. Do you think that you can learn anything from India? You can always learn. In India, you have a different environment for the usage of the fleet. For eg. humidity. In Russia, we have the highest and lowest temperature. So we have to produce the products accordingly. We need this knowledge for other countries as well. (The writer was in Russia at the invitation of TMH)",
    "image": "https://images.indianexpress.com/2024/12/TMH-CEO-1.jpg",
    "date": "3/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T21:03:44+05:30",
    "dateModified": "2024-12-03T21:03:44+05:30"
  },
  {
    "title": "DGCA to streamline norms for Indian airlines’ wet-leased plane operations",
    "link": "https://worldsnews24.vercel.app/business/dgca-to-streamline-norms-for-indian-airlines-wet-leased-plane-operations",
    "siteurl": "https://worldsnews24.vercel.app/business/dgca-to-streamline-norms-for-indian-airlines-wet-leased-plane-operations",
    "description": "DGCA, in September, issued a draft for public consultation on the revised Civil Aviation Requirements (CAR) on wet/damp lease operations by Indian operators to strengthen the regulatory framework for safety oversight of wet/damp lease operations.",
    "thumbnail": "https://images.indianexpress.com/2024/12/plane.jpg",
    "description1": "Aviation watchdog DGCA will soon come out with streamlined regulations for wet-leasing of planes by Indian airlines that will also entail enhanced oversight of the aircraft, amid airlines looking to operate more planes to meet rising travel demand. With persisting supply chain woes, there is a delay in aircraft deliveries and to meet the near-term needs, carriers are opting for planes on dry and wet leases. A senior official in the know told PTI that the efforts are on to streamline the regulations for wet-leasing of planes to assist in the growth of the aviation. \"Realities of the engine problems cannot be wished away suddenly and on the other side, the possible routes are also increasing all the time,\" the official said. Many planes of IndiGo are on the ground due to Pratt &amp; Whitney engine issues and the number of such aircraft is slowly coming down. Generally, wet-leasing of an aircraft involves the leasing of foreign aircraft, along with crew, maintenance and insurance. The plane is also under the operational control of the foreign operator (lessor) and subject to regulatory requirements of the foreign civil aviation authority concerned. In the case of dry-leasing, only the aircraft is taken by the carrier. Currently, IndiGo and SpiceJet operate wet-leased planes while Air India fly some dry-leased aircraft. After stakeholder consultations, the Directorate General of Civil Aviation (DGCA) is working on streamlining the wet-leasing regulations. Under the existing regulations, DGCA does not have the full control over a wet-leased aircraft. There are also certain restrictions in terms of wet-leasing of planes for new or additional routes. The official said certain restrictions will be done away wit",
    "description2": "h to facilitate wet-leasing of planes by the domestic carriers. Among other requirements, all the flight and maintenance records of the aircraft concerned need to be submitted to DGCA. In the case of wet-leased planes, there are different norms. Right now, Indian carriers are looking at wet-leasing where only pilots will be from the foreign entity while rest of the crew will be from the carriers. Also, the pilots of the wet-leased planes are subject to regulations of the foreign regulator concerned, including FDTL (Flight Duty Time Limitations). \"In the current scenario where there are aircraft on the ground, if it suits the Indian carriers, we need to assess the procedures properly and facilitate them to have aircraft on wet lease,\" the official said. DGCA, in September, issued a draft for public consultation on the revised Civil Aviation Requirements (CAR) on wet/damp lease operations by Indian operators to strengthen the regulatory framework for safety oversight of wet/damp lease operations. \"The enhanced regulatory framework and changes proposed in the draft CAR includes restricting the wet/damp lease only from the countries having a reliable safety oversights system as well as standardisation of DGCA surveillance on such operations,\" the regulator said on September 12. Among the proposed changes are that an aircraft can be wet-leased only from the ICAO (International Civil Aviation Organisation) contracting states having an average effective implementation score of 80 per cent or above (with a minimum of 70 per cent in each area) in the areas of personnel licensing, airworthiness and operations. This should be as per the latest results of the ICAO Universal Safety Oversight Audit Programme (USOAP).",
    "image": "https://images.indianexpress.com/2024/12/plane.jpg",
    "date": "4/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T20:30:45+05:30",
    "dateModified": "2024-12-04T20:30:45+05:30"
  },
  {
    "title": "RBI may explore other liquidity tools like open market operations (OMOs) and foreign exchange (FX) swaps instead of rate cut: Report",
    "link": "https://worldsnews24.vercel.app/business/rbi-may-explore-other-liquidity-tools-like-open-market-operations-omos-and-foreign-exchange-fx-swaps-instead-of-rate-cut-report",
    "siteurl": "https://worldsnews24.vercel.app/business/rbi-may-explore-other-liquidity-tools-like-open-market-operations-omos-and-foreign-exchange-fx-swaps-instead-of-rate-cut-report",
    "description": "RBI may explore other liquidity tools like open market operations (OMOs) and foreign exchange (FX) swaps instead of rate cut: Report",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241205030347.jpg",
    "description1": "\n\n\nNew Delhi [India], December 5 (ANI): The Reserve Bank of India (RBI) may keep the current policy rates unchanged in the ongoing Monetary Policy Committee (MPC) meeting, according to a report by the Union Bank of India.\n\n\nAs per the report, RBI is unlikely to announce a cash reserve ratio (CRR) cut to improve liquidity. A CRR cut is viewed as a strong policy signal that might indicate inflation is under control and growth concerns are severe.\n\nThe report predicts that the first rate cut of 25 basis points (bps) might take place in February 2025, followed by another cut in April 2025.\n\nThe report also noted that instead of a rate cut the central bank may explore other liquidity tools such as open market operations (OMOs) and foreign exchange (FX) swaps to manage liquidity in the market for balancing the inflation and growth.\n\nIt said \"we do expect the RBI to announce use of permanent liquidity tools apart from fine-tuning operations. Core liquidity is likely to switch into sustained deficit at least by Q4 FY25 unless FX outflows measures (totalling more than USD 25bn in last two months) reverse\".\n\n\n\nHowever, the repor",
    "description2": "t also mentioned that the RBI rate cut timeline may shift if global market volatility continues after Donald Trump assumes office as US President on January 20, 2025.\n\nThe report pointed out that the MPC faces a challenging situation with recent GDP data for the second quarter of FY25 revealing a sharp slowdown in economic growth, coming in significantly below the MPC's estimates of 7 per cent.\n\nAt the same time, inflation remains above the upper limit of the RBI's target range of 4 per cent (+/-2 per cent) as of October 2024. Adding to these challenges are sharp foreign exchange losses, driven by heightened global market volatility.\n\nThe report also highlighted the growing liquidity deficit in the financial system. Core liquidity is expected to remain in deficit by the fourth quarter of FY25 unless foreign exchange outflows, which have exceeded $25 billion over the past two months, reverse.\n\nOverall, while growth recovery is anticipated in the latter half of FY25, the RBI's immediate challenge is to balance weak growth, elevated inflation, and external volatility while ensuring adequate liquidity in the system. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241205030347.jpg",
    "date": "Invalid Date",
    "time": "Updated 1:34:11 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "India poised to capture 10-12 pc of global MedTech market in 25 years: EY report",
    "link": "https://worldsnews24.vercel.app/business/india-poised-to-capture-10-12-pc-of-global-medtech-market-in-25-years-ey-report",
    "siteurl": "https://worldsnews24.vercel.app/business/india-poised-to-capture-10-12-pc-of-global-medtech-market-in-25-years-ey-report",
    "description": "India poised to capture 10-12 pc of global MedTech market in 25 years: EY report",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241205030018.jpg",
    "description1": "\n\n\nNew Delhi [India], December 5 (ANI): India is set to significantly expand its presence in the global medical technology (MedTech) industry, increasing its market share from the current 1.6 to 10-12 per cent over the next 25 years, according to a report by EY India.\nThe report noted that this growth aligns with the rapid development of the country's MedTech sector, which is projected to reach new heights in the coming decades. The Indian medical device market, valued at approximately USD 12 billion in 2023-24, is anticipated to grow more than four-fold to USD 50 billion by 2030.\n\nIt said \"the (Indian) market ranks among the top 20 countries globally, with a market share of 1.65 per cent This share is expected to rise between 10 per cent and 12 per cent within the next 25 years\".\nThe report mentioned that India's transition from a significant importer to a potential global leader and exporter in the MedTech industry will be driven by its strategic strengths.\nThese include a skilled workforce, cost advantages, technological advancements, and government initiatives that encourage domestic manufacturing and innovation. Together, these factors position India to not only participate but lead the future direction of the global MedTech market.\n\n\nThe report added ",
    "description2": "\"India stands on the cusp of redefining its role in the international MedTech arena, not merely as a market participant but as a frontrunner steering the industry's future direction\". Key drivers for this growth include the rising prevalence of chronic diseases, a growing elderly population, and an increasing focus on preventive healthcare.\nAdditionally, there is a shift toward digitally integrated healthcare systems, next-generation therapies, and care settings outside traditional hospitals. The expanding middle class, rising incomes, and greater penetration of healthcare insurance are also contributing factors.\nThe report also highlighted that India's inherent strength in digital and technological innovation is another major asset. Combined with growing infrastructure, increased medical tourism, and a strong push from the government, the MedTech industry is set for a transformative journey.\n\"While India is currently a significant importer of medical devices, it has the potential to emerge as a key exporter and a global MedTech industry leader\" the report said.\nWith these developments, India stands poised to redefine its role in the global MedTech landscape, emerging as a frontrunner in driving innovation and reshaping healthcare delivery worldwide. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241205030018.jpg",
    "date": "Invalid Date",
    "time": "Updated 1:34:11 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "RBI raises UPI Lite wallet limit to Rs 5,000",
    "link": "https://worldsnews24.vercel.app/business/rbi-raises-upi-lite-wallet-limit-to-rs-5-000",
    "siteurl": "https://worldsnews24.vercel.app/business/rbi-raises-upi-lite-wallet-limit-to-rs-5-000",
    "description": "RBI raises UPI Lite wallet limit to Rs 5,000",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204141239.jpg",
    "description1": "\n\n\nNew Delhi [India], December 4 (ANI): The Reserve Bank of India on Wednesday revised the wallet limit for the UPI Lite from Rs 2,000 to Rs 5,000.\nAs per the new rules introduced today, the upper transaction limit for UPI Lite under offline framework has been increased from Rs 500 to Rs 1,000 per transaction.\n\n\"The offline framework has been updated and the enhanced limits for UPI Lite shall be Rs 1,000 per transaction, with Rs 5,000 being the total limit at any point in time,\" the RBI circular added.\nThe framework earlier prescribed an upper limit of Rs 500 for digital payment transaction under offline framework and a total limit of Rs 2,000 for a payment instrument at any point in time.\nThe enhanced transaction and total limits for UPI Lite are set to take effect immediately, providing a significant boost to users who rely on this mode of payment for day-to-day purchases. The RBI has emphasized that this update aims to further streamline digital payment solutions while ensuring security and ease of use for consumers.\n\n\nThe circular has been issued under the authority of Section 18",
    "description2": " read with Section 10(2) of the Payment and Settlement Systems Act, 2007, and is expected to create a more robust and inclusive digital payment ecosystem in India.\nEarlier, On October 9, the RBI announced an increase in transaction limits for Unified Payments Interface (UPI) services, particularly for users of keypad mobile phones.\nThe announcement was made by RBI Governor Shaktikanta Das during the last policy rates announcement.\nThe enhanced transaction and total limits for UPI Lite are set to take effect immediately\nIn October 2024, Unified Payments Interface (UPI) achieved a historic milestone by processing 16.58 billion financial transactions in a single month, underscoring its pivotal role in India's digital transformation. Launched in 2016 by the National Payments Corporation of India (NPCI), UPI has revolutionized the nation's payment ecosystem by integrating multiple bank accounts into a single mobile application. This system enables seamless fund transfers, merchant payments, and peer-to-peer transactions, offering users flexibility through scheduled payment requests. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204141239.jpg",
    "date": "Invalid Date",
    "time": "Updated 1:34:11 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "The RD20 and Mission Innovation Leaders Session Accelerate the Global Drive for Clean Energy Transitions",
    "link": "https://worldsnews24.vercel.app/business/the-rd20-and-mission-innovation-leaders-session-accelerate-the-global-drive-for-clean-energy-transitions",
    "siteurl": "https://worldsnews24.vercel.app/business/the-rd20-and-mission-innovation-leaders-session-accelerate-the-global-drive-for-clean-energy-transitions",
    "description": "The RD20 and Mission Innovation Leaders Session Accelerate the Global Drive for Clean Energy Transitions",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204124235.jpg",
    "description1": "\n\n\nNewsVoir\nNew Delhi [India], December 4: The Leaders Session on the second day of 'The 6th RD20 Conference' brought together global policymakers, researchers, and thought leaders to discuss collaborative pathways for clean energy transitions. Hosted by The Energy and Resources Institute (TERI) in collaboration with the Ministry of New and Renewable Energy (MNRE), this is the first time the conference is being held outside Japan, highlighting India's leadership in global energy innovation. Organised in partnership with the Advanced Industrial Science and Technology (AIST) of Japan, the session emphasised innovation, partnerships, and actionable strategies for achieving global energy goals.\n\nThe session commenced with a Welcome Address by Dr Vibha Dhawan, Director General, TERI, and an Opening Address by RD20 Chair, Mr Kazuhiko Ishimura (AIST), who remarked, \"Research is becoming serious year on year. Because of this there is a great expectation of carbon neutrality to be accelerated. We expect leaders to have deep dive sessions advancing the discussions towards achieving carbon neutrality.\" Representatives from the Indian government, MNRE and the Japanese government (METI, MOE, MEXT) also extended their welcome messages. The plenary presentation was delivered by Mr Takashi Naruse from NEDO.\nSudeep Jain, Additional Secretary, Minister of New & Renewable Energy (MNRE) in his opening remarks thanked Japan for giving India the opportunity to host the RD20 conference. \"The 6th RD20 conference in India highlights the importance of collaborative R&D in addressing global challenges. India has made significant progress in renewable energy, with a vision to reach 77% renewable energy by 2047. The country is also investing in R&D to support its growing manufacturing hub for renewable energy equipment.\" Speaking on the Honourable Prime Minister of India's vision on sustainability, green energy and renewable energy, he added, \"Our Prime Minister has a vision which goes beyond the current generation, to looking at several generations ahead.\"\nThe Leaders Session featured key discussions on India's energy transformation. The subsequent plenary lecture by Mr Abhay Bakre, Mission Director, MNRE, focused on the 'Role of Clean Hydrogen in India's Energy Transition: Opportunities and Challenges.' Mr Bakre noted, \"The sustainability goals for energy transition are to achieve the target of net zero by 2070, non-fossil electricity generation capacity to reach 500 GW by 2030 and emission intensity of GDP to reduce by 45%. The two basic pathways for energy transition are electricity and hard-to-electricity. Hydrogen comes up with the most promising pathway for decarbonising the hard-to-electricity sectors.\"\nOther highlights included updates on RD20 activities and technical sessions, with presentations by Dr William Tumas (NREL) and Dr Haruhiko Obara (AIST). The updates covered Action Committee progress, RD20 Summer Schools, and reports from the Tokyo symposium and COP29. Key outcomes from the 2024 RD20 Technical Sessions were presented by co-organisers Mr Pierre Sierre Combe, CEA and Mr Mark Ruth, NREL, (Technical session I); Dr Sanjukta Subudhi, TERI; Mr David Harris, CSIRO and Mr Randy Cortright, NREL (Technical session II); and Dr Myriam Merad, CNRD and Dr Alberta Carpenter, NERL (Technical session III), including advancements in sustainable biofuels, biochemicals, and hydrogen technologies, alongside updates on future workshops and technical barriers to hydrogen implementation.\nA significant segment of the session was dedicated to discussing opportunities for collaboration between RD20 and Mission Innovation (Clean Energy Ministerial and G20), a global initiative aimed at accelerating clean energy innovation to achieve net-zero emissions.\n\n\nDr Michio Kondo (AIST) introduced opportunities for collaboration between RD20 a",
    "description2": "nd Mission Innovation that highlighted the perspectives put forth by the different participating countries and institutions. Dr Kondo emphasised, \"RD20 has huge potential to support and collaborate with G20 Working Groups from technology point of views, techno economic aspects and lifecycle assessments in carbon neutral technologies.\" He also mentioned, \"To enhance the cooperation amongst G20 members and to accelerate the implementation of common goals towards energy transitions, RD20 could contribute to the RIWG/G20 through South African member, CSIR, in the upcoming G20 in South Africa in 2025.\"\nHelen Fairclough from Mission Innovation elaborated on the initiative's global significance, stating, \"Mission Innovation is a global initiative catalysing a decade of action and investment in research, development, and demonstration to make clean energy affordable, attractive and accessible for all. This will accelerate progress towards the Paris Agreement goals and pathways to net zero.\"\nSharing her perspective on Brazil, Ms Rachel Martins Henriques, Technical Consultant, Brazil, highlighted, \"The intersection of the CEM and RD20 emphasizes the importance of sharing knowledge and best practices among nations to overcome common challenges in clean energy deployment.\" Sharing her views on the Mission Innovation policies on bio-refineries in Brazil, she said, \"The National Biofuel Policy (RenovaBio) aims to increase the addition of anhydrous ethanol to gasoline and biodiesel to diesel B, with certified production capacity of ethanol, biodiesel, and biogas by 15% March 2025. The 'Fuels of the Future' programme aims to reduce carbon intensity, evaluate energy-environmental efficiency, and stimulate innovation.\"\nMission Innovation, a global initiative dedicated to accelerating clean energy innovation, is committed to addressing climate change, making clean energy more affordable, and creating green jobs and economic opportunities. With a focus on reinvigorating global efforts in clean energy research and development, Mission Innovation engages researchers, innovators, and the private sector to drive breakthroughs in clean energy technologies, reduce greenhouse gas emissions, and foster sustainable economic growth.\nMission Innovation and RD20 have partnered to advance collaboration on critical clean energy areas, including clean hydrogen and smart grid technologies. This partnership, underscored during the Leaders' session of RD20, seeks to bring together Mission Directors and Steering Committee members from both initiatives to foster dialogue, identify shared objectives, and develop actionable strategies for clean energy transitions. Through joint sessions and workshops, the collaboration aims to explore innovative solutions that address global energy challenges and promote a shared vision for accelerating clean energy advancements.\nWith a robust agenda and contributions from leading experts, the RD20 Leaders Session marked a significant milestone with a reaffirmed commitment to international collaboration in the pursuit of sustainable and clean energy solutions.\nThe Energy and Resources Institute (TERI), based in India, is an independent, multi-dimensional research organization with capabilities in policy research, technology development, and implementation. An innovator and agent of change in the energy, environment, climate change and sustainability space, TERI has pioneered conversations and action in these areas for nearly five decades. Headquartered in New Delhi, it has centres in six Indian cities, and is supported by a multi-disciplinary team of scientists, sociologists, economists, engineers, administrative professional and state-of-the-art infrastructure.\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by NewsVoir. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204124235.jpg",
    "date": "Invalid Date",
    "time": "Updated 1:34:11 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "LWS Knitwear Ltd. to Offer Right Shares Worth Rs.17.30 Crores",
    "link": "https://worldsnews24.vercel.app/business/lws-knitwear-ltd-to-offer-right-shares-worth-rs-17-30-crores",
    "siteurl": "https://worldsnews24.vercel.app/business/lws-knitwear-ltd-to-offer-right-shares-worth-rs-17-30-crores",
    "description": "LWS Knitwear Ltd. to Offer Right Shares Worth Rs.17.30 Crores",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204123350.jpg",
    "description1": "\n\n\nPNN\nMumbai (Maharashtra) [India], December 04: Ludhiana-based LWS Knitwear Ltd. (LWS) is a BSE-listed company. It is coming out with a rights issue of 9,610,960 equity shares of Rs. 10 each with a fixed price of Rs. 18 per share (including a premium of Rs. 10 per share) to mobilize Rs. Rs17.30 Crores. The issue opens for subscription on December 06th, 2024, and will close on December 16th, 2024. Beetal Financial & Computer Services (P) Limited is the registrar of the issue.\n\nThe company is offering rights shares in the ratio of 19 shares for every 10 shares held by the eligible shareholders on the record date - November 28, 2024, as determined by the Board of Directors ,and renunciation of Rights Entitlement will be on December 10, 2024\nObjects of the Issue:\nThe Net Proceeds from the Issue are proposed to be utilized by the Company for the following objects:\n1. Part repayment or prepayment of unsecured loans availed from the Promoters and from the member of the Promoter Group\n2. To meet the working capital requirements\n3. General corporate purposes\n\n\nAbout Company:\n\n\nEstablished in 1989 under the leadership of Late Shri SatParkash Kapoor and his son Girish Kapoor, the Managing Director. Under his leadership and benevolent vision, the company has relentlessly continued its journey of growth.\nLWS is a pioneer in its field in Ludhiana, the capital of Hosiery and Woollen products of India, also suitably nicknamed the Manchester of India. The strategic location and easy accessibility by road and by air make LWS an extremely viable proposition.\nA quest for perfection, keeping in mind methodism and flexibility to accommodate better ideas, is the undermining feature of the e",
    "description2": "ntire framework of LWS. Its accordance with the guidelines laid down by the specified beneficiaries has assisted the separate departments to work together in an easy and systematic manner. The well-coordinated team and access to elaborate infrastructure with a single purpose of achieving the best quality products for the consumers and building the brand LWS.\nLWS has grown to a full circle, touching people the world over by having expertise in dealing with customers from around the world. The quality, durability and universal acceptance of LWS products are due to the personal interest of the promoters, professional management by the staff and expertise in producing quality premium products.\nUnder the stewardship of Shri Sat Parkash Kapoor, the Ex-President of the Wool and Woollens Export Promotion Council (WWEPC), the then government bestowed the promotion of the woollen industry abroad and the promotion of the manufacturing of winter wear in India. LWS had the manufacturing rights for a number of foreign-based brands, namely Karstadt-AG, Neckerman, GAP and Benetton India.\nWith the induction of Arjun Kapoor and Gopal Kapoor in leadership roles, the Company is appropriately positioned to take the next leap.\nFINANCIAL INFORMATION:\nFollowing are the details derived from the Limited Review financial results for the three-month period ended June 30, 2024, and the Restated Financial Statement for the Financial Years ended on March 31, 2024, March 31, 2023, and March 31, 2022:\n(Rs in lakhs except Earnings per share and Net Asset Value)\n\n\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by PNN. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204123350.jpg",
    "date": "Invalid Date",
    "time": "Updated 1:34:11 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "Godrej DEI Lab and Khaitan & Co advocate for Workplace Inclusion of Persons with Disabilities",
    "link": "https://worldsnews24.vercel.app/business/godrej-dei-lab-and-khaitan-co-advocate-for-workplace-inclusion-of-persons-with-disabilities",
    "siteurl": "https://worldsnews24.vercel.app/business/godrej-dei-lab-and-khaitan-co-advocate-for-workplace-inclusion-of-persons-with-disabilities",
    "description": "Godrej DEI Lab and Khaitan & Co advocate for Workplace Inclusion of Persons with Disabilities",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204123122.jpg",
    "description1": "\n\n\nPRNewswire\nMumbai (Maharashtra) [India], December 4: Godrej DEI Lab, the diversity and inclusion arm of Godrej Industries Group, and Khaitan & Co, a leading full-service law firm today commemorated International Day of Person with Disabilities. The second edition of the Khaitan & Co's Handbook on Rights of Persons with Disabilities, in collaboration with Godrej DEI Lab was unveiled at their Disability Inclusion Summit in Mumbai. The comprehensive handbook serves as a ready reckoner for understanding the evolution of Indian jurisprudence on disability rights framework.\n\n\"This event represents a crucial milestone in our ongoing commitment to workplace inclusion,\" saidParmesh Shahani, Head of Godrej DEI Lab. \"By bringing together diverse stakeholders and experts, in sync with Godrej Industries Group's objective, we're actively building the framework for a more equitable corporate India. I am confident that the handbook will help organisations transform their approach to PwD inclusion from compliance-based to purpose-driven.\"\nSpeaking about the importance of workplace inclusion, Aakash Choubey, Partner, Khaitan & Co said, \"Creating an inclusive workplace for persons with disabilities is not just a legal obligation but an imperative for organisations. Impactful strategies such as accessible infrastructure, tailored accommodations and inclusive hiring practices can foster a culture where everyone feels valued and empowered. As we commemorate the International Day of Persons with Disabilities, we must recognise that inclusivity enriches our workplaces and society at large.\"\nThe Handbook on Rights of Persons with Disabilities covers two crucial legislations - Rights of Persons with Disabilities Act, 2016, and the Mental Healthcare Act, 2017, offering insights into beneficiaries, entitlements, and remedies. It also provides legal guidance on fundamental rights, legal capacity, education, employment, healthcare, transport and mental health. Beyond legal analysis, the handbook outlines best practices for organisations, particularly private employers, to ensure equitable representation of persons with disabilities, thereby fostering inclusive workplaces.\nPost the success of Godrej DEI Lab's first edition of 'PwD Inclusion in Workplaces: Strategies for Success' last year, the group this year collaborated with Khaitan & Co and brought together corporate leaders, HR professionals, and disability rights advocates to foster meaningful dialogue on creating inclusive workplaces across India.\nThe Disability Inclusion Summit also witnessed a panel discussion on actionable strategies for enhancing workplace inclusivity for persons with disabilities. Moderated by Aakash Choubey, Partner, Khaitan & Co, it f",
    "description2": "eatured former National Paralympic swimming champion, Madhavi Latha; Ananya Sharma, JSW Group's General Counsel; Aradhana Lal, Senior Vice President for Sustainability & ESG, Lemon Tree Hotels, Arva Merchant, Partner, Khaitan & Co; and Zoya, DEI Lead, Godrej Properties Limited.\n\n\nThe initiative is another step under Godrej DEI Lab's commitment to driving tangible change in corporate India's approach to diversity and inclusion, particularly in advancing opportunities for persons with disabilities in the workplace.\nAbout Godrej Industries Group\nThe Godrej Industries Group (GIG) serves 1.1 billion consumers globally across businesses in diverse industries, including consumer products, real estate, agriculture, financial services and chemicals. Godrej was founded in 1897 to help build economic independence for India. We are committed to growing and strengthening this legacy of innovation for a cause; building for a more sustainable future, while placing our planet and people alongside profit.\nGIG houses several rapidly growing businesses that are the leaders in their respective categories. Godrej Consumer Products (GCPL) is an emerging markets FMCG leader in Home and Personal Care with a growing presence in Asia, Africa and Latin America. Godrej Properties (GPL) is India's leading real estate developer by sales and brings the Godrej philosophy of innovation, sustainability, and excellence to the real estate industry. Godrej Agrovet's (GAVL) portfolio businesses address key challenges faced by Indian agriculture; improving the productivity of Indian farmers through innovative products and services that sustainably increase crop and livestock yields. Godrej Industries (Chemicals), the group's oldest business, is India's leading manufacturer of oleochemicals and surfactants. Godrej Fund Management (GFM) is the real estate private equity arm of the group. Godrej Capital (GC), the newest company in the group, is a fast-growing financial services business.\nAbout Khaitan & Co\nKhaitan & Co is a top tier and full-service law firm with over 1000 legal professionals, including 270+ leaders and presence in India and Singapore. With more than a century of experience in practicing law, we offer end-to-end legal solutions in diverse practice areas to our clients across the world. We have a team of highly motivated and dynamic professionals delivering outstanding client service and expert legal advice across a wide gamut of sectors and industries. To know more, visit https://www.khaitanco.com\nPhoto: https://mma.prnewswire.com/media/2573308/Handbook_Launch.jpg\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by PRNewswire. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204123122.jpg",
    "date": "Invalid Date",
    "time": "Updated 1:34:11 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "Sonata Software Achieves The AWS Generative AI Competency",
    "link": "https://worldsnews24.vercel.app/business/sonata-software-achieves-the-aws-generative-ai-competency",
    "siteurl": "https://worldsnews24.vercel.app/business/sonata-software-achieves-the-aws-generative-ai-competency",
    "description": "Sonata Software Achieves The AWS Generative AI Competency",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204115429.jpg",
    "description1": "\n\n\nPRNewswire\nBangalore (Karnataka) [India], December 4: Sonata Software (NSE: SONATSOFTW) (BSE: 532221), a leading Modernization Engineering company, today announced that it has achieved the Amazon Web Services (AWS) Generative Artificial Intelligence (AI) Competency. This specialization highlights Sonata Software as an AWS Partner that helps customers and the AWS Partner Network (APN) drive the advancement of services, tools, and infrastructure pivotal for implementing generative AI technologies.\n\n* The achievement underscores Sonata Software's responsible-first Artificial Intelligence (AI) proposition and value creation for clients across their modernization efforts\nAchieving the AWS Generative AI Competency differentiates Sonata Software as an AWS Partner that has demonstrated technical proficiency and proven customer success supporting customers across their generative AI modernization efforts. Sonata Software has helped many clients access tailored cloud strategies, simplified migration processes, modern engineering practices, advanced AWS DevOps capabilities, and enterprise frameworks to support sustained operational excellence.\nSonata Software possesses the experience and expertise demonstrated through successful projects addressing customer challenges using generative AI solutions. These solutions allow digital transformation strategies for augmenting customer experience, delivering hyper-personalized and engaging content, streamlining workflows, and delivering actionable results powered by generative AI technology from AWS.\n\"We are honoured to achieve the AWS Generative AI Competency, underscoring Sonata's commitment to responsible-first AI through our Harmoni.AI framework,\" said Anthony Lange, Chief Revenue Officer at Sonata Software. \"This competency expands Sonata Software's role in the AWS Partner Network, allowing us to drive value across modernization and transformation efforts. By harnessing AWS's generative AI technologies and advanced AWS DevOps services, we are well-positioned to elevate customer experiences, provide hyper-personalized content, and generate impactful outcomes for our global clients.\"\nSonata Software is committed to fostering modernization-driven growth and enhancing customer experiences through advanced generative AI solutions. Underpinned by its 'Responsible by Design' philosophy, Sonata Software ensures ethical and secure AI integration, emphasizin",
    "description2": "g trust, privacy, security guardrails and compliance across industries and geographies.\nSonata Harmoni.AI is a comprehensive framework for generative AI that exemplifies this approach with robust data governance and acceleration capabilities. Offering a selection of industry-leading Large Language Models (LLMs) and a catalogue of pre-built AI accelerator and service deliver platforms, Sonata Harmoni.AI facilitates seamless and safe adoption adhering to enterprise standards and accelerates time to market.\n\n\nThe AWS Competency Program aims to assist customers in connecting with AWS Partners who possess extensive knowledge and technical expertise in using AWS technologies and best practices to adopt generative AI. These AWS Partners facilitate the seamless integration and deployment of AWS-based solutions to meet the unique needs of all customers, from startups to global enterprises.\nAbout Sonata Software\nIn today's market, there is a unique duality in technology adoption. On one side, extreme focus on cost containment by clients, and on the other, deep motivation to modernize their Digital storefronts to attract more consumers and B2B customers.\nAs a leading Modernization Engineering company, we aim to deliver modernization-driven hyper-growth for our clients based on the deep differentiation we have created in Modernization Engineering, powered by our Lightening suite and 16-step Platformation™ playbook. In addition, we bring agility and systems thinking to accelerate time to market for our clients.\nHeadquartered in Bengaluru, India, Sonata has a strong global presence, including key regions U.S., U.K., Europe, APAC, and ANZ. We are a trusted partner of world leading companies in TMT (Telecom, Media and Technology), Retail & CPG, Manufacturing, BFSI (Banking, Financial Services and Insurance) and HLS (Healthcare and Lifesciences) space. Our bouquet of Modernization Engineering Services cuts across Cloud, Data, Dynamics, Contact Centers and around newer technologies like Generative AI, MS Fabric, and other modernization platforms.\nFor more information, please visit https://www.sonata-software.com/\nLogo: https://mma.prnewswire.com/media/689012/4362526/Sonata_Software_Logo.jpg\nMedia Contact: vinitha.oommen@sonata-software.com, +91 98867 87900\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by PRNewswire. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204115429.jpg",
    "date": "Invalid Date",
    "time": "Updated 1:34:11 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "Delhi registers drop in air pollution, records 'moderate' air quality after weeks",
    "link": "https://worldsnews24.vercel.app/business/delhi-registers-drop-in-air-pollution-records-moderate-air-quality-after-weeks",
    "siteurl": "https://worldsnews24.vercel.app/business/delhi-registers-drop-in-air-pollution-records-moderate-air-quality-after-weeks",
    "description": "Delhi registers drop in air pollution, records 'moderate' air quality after weeks",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241205032825.jpg",
    "description1": "\n\n\nNew Delhi [India], December 5 (ANI): Residents in Delhi took a sigh of relief on Thursday as the air quality index in the national capital improved to 'moderate' category after the city faced persistent air pollution since last one month.\n\n\nThe overall Air Quality Index (AQI) recorded in Delhi was 161, categorised as 'moderate' as of 8 am, according to the data of the Central Pollution Control Board (CPCB).\nHowever, a thin layer smog engulfed the city as the winter has set in. As per the India Meteorological Department (IMD), Delhi has recorded a minimum temperature of 9 degrees Celsius today with mist in the air.\n\n\nAs per the data of the CPCB, the AQI at Anand Vihar stands at 178 as of 8 am, 194 at Chandani Chowk, 130 at ITO, 152 at Wazirpur, 147 at Okhla Phase 2, 145 at Jawaharlal Nehru Stadium, 164 at Patparganj, 107 at Aya Nagar, 128 at Lodhi Road, 162 at IGI Airport (T3) and 152 at Punjabi Bagh.\n\n\nHowever, areas such as RK Puram recorded an AQI of 204, Mundka 222, Shadipur 249, Nehru Nagar 247 and Jahangirpuri 206, categorised as 'poor'.\nAn AQI between 0-50 is considered good, 51-100 is satisfactory, 101-200 is moderate, 201-300 is poor, 301-400 is very poor and 401-500 is severe.\nVisuals from Kartavya Path shows that a significant number of residents jog and walk in the area after decrease in the level of pollution.\nDelhi's AQI was reeling in 'very severe', 'severe', 'very poor' and 'poor' categories post Diwali. Residents in the region complained of breathing difficulties and several other medical problems.\nIncreasing AQI in the city led to the implementation of Graded Response Action Plan (GRAP)-IV measures to curb air pollution. Stage IV enforces a ban on the operation of",
    "description2": " Delhi-registered BS-IV and below diesel-operated medium goods vehicles (MGVs) and heavy goods vehicles (HGVs), except for essential services.\nThe national capital Delhi is witnessing a dip in temperature as the minimum temperature recorded on Thursday at 5.30 am was 9 degrees Celsius.\n\n\nMeanwhile, air quality in Agra city was recorded in 'satisfactory' category this morning, as per Central Pollution Control Board (CPCB). Visuals from the city shows golden hue complimenting the iconic monument Taj Mahal.\n\n\nEarlier on Wednesday, the temperature fell by almost 1.5 degrees in the last 24 hours due to cold north-westerly winds that drive down temperatures and signal the start of winter.\nOn November 29 and 30, the minimum temperature in Delhi was recorded as 11 degrees Celsius.\nThe Indian Meteorological Department has (IMD) predicted a temperature drop till 9 degrees Celsius in the next 5 days.\nEarlier on Monday, the Supreme Court said 'no' to relaxing Graded Response Action Plan (GRAP)-IV measures to curb air pollution in Delhi and it will hear the parties on this aspect on the next date of hearing.\nA bench of justices Abhay S Oka and AG Masih also noted that none of the NCR states--Delhi, Rajasthan, Haryana and Uttar Pradesh --complied with its direction to pay compensation to construction workers and directed the Chief Secretaries of these states to be present on next date virtually. The top court said that when it summons top officials then only the ball starts rolling.\nThe top court also clarified that it will permit relaxations only after observing a downward trend and said that it will hear the parties on Thursday on the aspects of modification of the applicability of GRAP IV. (ANI)",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241205032825.jpg",
    "date": "Invalid Date",
    "time": "Updated 1:34:11 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:44 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:44 IST"
  },
  {
    "title": "Assam bans serving, consuming beef in restaurants, public places across the state: CM Sarma",
    "link": "https://worldsnews24.vercel.app/business/assam-bans-serving-consuming-beef-in-restaurants-public-places-across-the-state-cm-sarma",
    "siteurl": "https://worldsnews24.vercel.app/business/assam-bans-serving-consuming-beef-in-restaurants-public-places-across-the-state-cm-sarma",
    "description": "Assam bans serving, consuming beef in restaurants, public places across the state: CM Sarma",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204160140.jpg",
    "description1": "\n\n\nGuwahati (Assam) [India], December 4 (ANI): Assam Chief Minister Himanta Biswa Sarma on Wednesday announced that the government has decided to ban serving and consumption of beef in any restaurant, hotel and public places across the state.\nThe CM said the Assam Cattle Preservation Act, passed in 2021, has been quite successful in ensuring the slaughter of cattle, and \"now we have decided to stop the consumption of beef in public places.\"\n\n\"We had passed the law on prohibition of cattle slaughter three years ago, and it was quite successful, so now, in Assam, we have decided that beef will not be served in any restaurant or hotel and also it will not be served in any public functio",
    "description2": "n or public place, so from today we have completely decided to stop the consumption of beef in hotels, restaurants and public places,\" the Assam CM said.\nThe CM said that the earlier decision was to only restrict consumption of beef near temples, but now the government has expanded it to the whole state.\n\"Earlier our decision was to stop eating beef near temples but now we have expanded it to the entire state so you will not be able to eat it in any community place, public place, hotel or restaurant,\" Sarma said.\nThe Assam Chief Minister also said that the state's cabinet expansion will take place on December 7.\nThe names of the newly inducted ministers are yet to be announced. (ANI)",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204160140.jpg",
    "date": "Invalid Date",
    "time": "Updated 1:34:11 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:44 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:44 IST"
  },
  {
    "title": "Google, Meta investing billions in India’s submarine optic fibre infra; data rivalry with Jio, Airtel in the offing",
    "link": "https://worldsnews24.vercel.app/business/google-meta-investing-billions-in-india-s-submarine-optic-fibre-infra-data-rivalry-with-jio-airtel-in-the-offing",
    "siteurl": "https://worldsnews24.vercel.app/business/google-meta-investing-billions-in-india-s-submarine-optic-fibre-infra-data-rivalry-with-jio-airtel-in-the-offing",
    "description": "Google, Meta investing billions in India’s submarine optic fibre infra; data rivalry with Jio, Airtel in the offing",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115961631/115961631.jpg",
    "description1": "Global tech giants Google and Meta are making substantial investments in submarine fibre cables connecting to India. This strategic move positions them in direct competition with established domestic data providers Reliance Jio, Bharti Airtel and Tata Communications during a period of significant data centre expansion.Industry experts indicate that neutral infrastructure providers like Sify Technologies and Lightstorm are gaining prominence by offering more cost-effective landing facilities compared to established telecom operators Airtel and Tata Communications. Sources familiar with the project told ET that Google plans to launch its Blue-Raman Submarine Cable System in Mumbai during the first quarter of 2025.The Blue and Raman project, valued at $400 million with 218-Tbps capacity, includes investment from Italian firm Sparkle. This addition brings Google's global subsea cable investments to 18. 115961293Meta's plans include developing a substantial subsea cable with 500-Tbps capacity, requiring $10 billion in investment over three years. India, being a crucial market for consumer and enterprise AI, features prominently in Meta's cable routing strategy.Also Read | High-speed 280 kmph trains soon! Indian Railways to manufacture bullet trains - check top features\"The subsea industry is seeing a major resurgence - 107 new cables were built during 2016-20, representing $13.8 billion in value, with another $18 billion in subsea cable investments underway from 2021 to 2025,\" said Vinay Nagpal, chief executive of InterGlobix LLC, a US-based consulting and advisory firm specialising in subsea networks. \"India clearly stands at a vantage point to seize those opportunities.\"Sources",
    "description2": " close to the matter indicate Meta's cable might connect either in Gujarat, where its partner Reliance Industries is constructing India's largest AI data centre at 1 Gigawatt, or in Chennai, where Reliance's joint venture already operates a data centre.A landing station serves as a compact data centre facility linking submarine cable networks to land-based infrastructure.Between October and March next year, Jio and Airtel plan to launch three major submarine cable initiatives - 2Africa Pearls, India-Asia-Express (IAX) and India-Europe-Express (IEX) - which will increase current capacity by more than fourfold.The competition centres on India's profitable market for undersea optical fibre pairs that enable global high-speed data transmission. Whilst Airtel and Tata Communications currently lead this sector, Jio, despite being relatively new, is actively pursuing opportunities amidst growing data demands.Also Read | This billionaire American CEO thinks you may work just 3.5 days a week in futureTrai reports indicate the global submarine communications cables market is projected to grow from $27.57 billion in 2023 to $40.58 billion by 2028, with a 7.2% annual increase. Within Asia Pacific, India's market shows the strongest growth trajectory, expected to reach $78.6 million by 2030. This growth is driven by rising data sovereignty requirements, security considerations, and increasing data centre operations within India.Government regulations restrict submarine cable operations in India to specific entities. Only those holding international long distance (ILD) and internet service provider (ISP)-A telecom licences are authorised to manage and operate cable landing stations (CLS).",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115961631/115961631.jpg",
    "date": "4/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-04T12:30:00+05:30",
    "dateModified": "2024-12-04T12:30:00+05:30"
  },
  {
    "title": "SBI customers take note of new scam! Imposters extorting money with these 7 steps",
    "link": "https://worldsnews24.vercel.app/business/sbi-customers-take-note-of-new-scam-imposters-extorting-money-with-these-7-steps",
    "siteurl": "https://worldsnews24.vercel.app/business/sbi-customers-take-note-of-new-scam-imposters-extorting-money-with-these-7-steps",
    "description": "SBI customers take note of new scam! Imposters extorting money with these 7 steps",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115962078/115962078.jpg",
    "description1": "The State Bank of India has recently warned its customers about a new series of scams where imposters posing as CBI or Income Tax Department officials threaten people with a made up supposed legal action in order to extort money.It said, \"Dear SBI Customer, Fraudsters may pose as CBI or IT Dept officials and may threaten legal action or heavy fines to extort money from you. Beware of such frauds”. How the CBI, I-T imposter scam operates:The first step to prevent falling prey to such frauds is to understand the modus operandi of scamsters. Vikram Babbar, Partner, EY Forensic & Integrity Services told ET explains how the fraud works:Initiating the contact: The whole process begins with an imposter identifying any exploitable customer and contacting him/her through voice or video call, usually over messenger apps. The key element of the fraud is the bait that tricks the victim into believing the official has some critical information about them. This bait may include personal information like KYC number, address or any other information like assets etc.Convincing the victim: The imposter then uses this information in such a way that the victim gets easily convinced. For example telling them about any property they bought and not paying the required tax for it. The fraudster may obtain this information from property websites where you have listed details, from a property broker’s website, or even from a data breach at the property registrar's office.Narrating a fake story: Once the victim is convinced that the imposter is a genuine CBI or income tax official, the fraudster fabricates a story, claiming that the victim has evaded taxes or missed an important legal process, and therefore faces the possibility of arrest.Falling into the trap: Hearing words like \"jail,\" \"arrest,\" and \"legal proceedings\" naturally triggers a sense of panic in people. The fraudster exploits this fear and panic to manipulate the victim into compliance.Staging fake evidence: Meanwhile, the fraudster further \"stages\" the situation by scrutinizing fake documents and, in some cases, even simulating a police interrogation, pressurizing the victim into providing additional personal information, such as Aadhaar details, bank account numbers, and other sensitive data. This is then used by the scammers to easily access the victim’s bank account and other details.Last nail in the coffin: The fraudster sets a well-planned trap that deceives numerous victims and once the victim believes the investigation will be lengthy, the fraudsters offer an escape route to the victim claiming that their innocence can only be confirmed after thorough verification. The victim is assured that the ‘official’ will take care of all legal, tax, and other issues, provided that the victim pays them a bribe and directs them to transfer money to multi",
    "description2": "ple bank accounts throughout the investigation, with the promise that the funds will be refunded once the inquiry is completed.Also Read| PAN 2.0: Why you should apply for new PAN Card with QR code - top 5 benefits explained How to avoid these fraudsShiksha Goel, who is an IPS, DGP CID & Women Safety Wing, director Telangana Cyber Security Bureau & Telangana FSL stated that no law enforcement agency or government body contacts consumers to conduct an investigation online, nor do they ask individuals to resolve legal matters through a video call.“In these cases the common narrative is to induce the fear of legal action on the victim for a made up incident and then extort money from them.”In case of receiving these kinds of threats, the victims must not be alarmed, instead ask the other person on the call to meet you at the nearest police station or government office. Social engineeringET quoted Sheetal R Bhardwaj, executive member of Association of Certified Financial Crime Specialists (ACFCS) as saying, “This type of scam is commonly known as \"phishing\" or \"social engineering.Bhardwaj added that these scams have now become a major concern globally rather than India.“The Federal Trade Commission (FTC) in the United States reports millions of dollars lost to fraud each year. Various studies indicate that billions of dollars are lost annually worldwide due to different types of financial fraud, and the problem is escalating as technology evolves and more people conduct transactions online,” she said.“If it's a genuine call then the other person will agree to meet you at the police station or government office.”Another tip she suggested was for consumers to disconnect the call and then dial the same number to return the call.\"This is because, in our experience, we have seen these impostors use voice over internet protocol (VoIP) or other internet-based calling software, which typically doesn't allow incoming calls.\"Also Read | Aadhaar card update: Deadline to update your Aadhaar details for free is approaching - here’s what you need to knowSteps to prevent online fraudsBharadwaj also shared some essential tips to safeguard and avoid this fraudAlways authenticate the identity of the caller or sender. Legitimate organizations generally do not request sensitive information through phone calls, SMS, or video calls.Be cautious if someone threatens you with legal action or fines as genuine organizations typically communicate through official channels, allowing sufficient time for the victim to respond.Never share personal or financial information with anyone who contacts you unexpectedly.Report any suspicious messages to your bank and local law enforcement authorities.Enable security features such as two-factor authentication on your bank accounts and use strong, unique passwords for each service.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115962078/115962078.jpg",
    "date": "4/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-04T13:30:00+05:30",
    "dateModified": "2024-12-04T13:30:00+05:30"
  },
  {
    "title": "IPL brand value reaches whopping $12 billion! Here are the top 10 most valuable IPL brands 2024",
    "link": "https://worldsnews24.vercel.app/business/ipl-brand-value-reaches-whopping-12-billion-here-are-the-top-10-most-valuable-ipl-brands-2024",
    "siteurl": "https://worldsnews24.vercel.app/business/ipl-brand-value-reaches-whopping-12-billion-here-are-the-top-10-most-valuable-ipl-brands-2024",
    "description": "IPL brand value reaches whopping $12 billion! Here are the top 10 most valuable IPL brands 2024",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115964655/115964655.jpg",
    "description1": "IPL Brand Value: The Indian Premier League (IPL) has established itself as a leading international sports competition, with its total brand value showing a 13% increase to $12 billion, according to the 17th Brand Finance IPL 2024 assessment report. From its $2 billion valuation in 2009, the league surpassed $10 billion for the first time in 2023, reaching $10.7 billion.Not just that, Brand Finance also reported that four teams-Chennai Super Kings (CSK), Mumbai Indians (MI), Royal Challengers Bengaluru (RCB), and Kolkata Knight Riders (KKR)-have exceeded $100 million in brand value for the first time. We take a look at the top 1o most valuable IPL brands 2024, as listed by Brand Finance:Top 10 Most Valuable IPL Brands 2024The 2024 IPL brand assessment demonstrates remarkable advancement, with Chennai Super Kings leading at $122 million (52% increase), and Mumbai Indians following at $119 million (+36%), demonstrating the league's increasing international influence and financial achievement.RankIPL TeamBrand ValuePercentage Change1Chennai Super Kings$122 million52%2Mumbai Indians$119 million36%3Royal Challengers Bangalore$117 million67%4Kolkata Knight Riders$109 million38%5Sunrisers Hyderabad$85 million76%6Rajasthan Royals$81 million30%7Delhi Capitals$80 million24%8Gujarat Titans$69 million5%9Punjab Kings$68 million49%10Lucknow Super Giants$60 million29%RCB secured the third position with a brand value of $117 million (+67%), with KKR and Sunrisers Hyderabad following at $109 million (+38%) and $85 million (+76%), respectively. SRH achieved the highest growth rate in brand ",
    "description2": "value.Rajasthan Royals experienced a 30% increase, reaching $81 million, whilst Delhi Capitals achieved an $80 million valuation with 24% growth. The newer entrants, Gujarat Titans and Lucknow Super Giants, attained valuations of $69 million (+5%) and $60 million (+29%) respectively. Punjab Kings demonstrated remarkable 49% growth, securing $68 million and the tenth position.The top five IPL teams show considerable potential for expansion, with scope to elevate their brand values towards the levels seen in major football leagues such as the EPL, La Liga, Bundesliga, Serie A, and Ligue 1. The collective brand value of the leading five IPL teams stands at $551 million, which is notably lower than their football counterparts, whose values range between $2.9 billion (Bundesliga) and $6.7 billion (EPL).According to Ajimon Francis, Brand Finance India MD, the IPL's effective business structure and match organisation have become a blueprint for global leagues, strengthening BCCI's position whilst providing crucial opportunities for domestic cricket talent to flourish.\"The IPL ecosystem is today worth $1.3 billion and is closely watched and emulated worldwide,\" he said. \"Franchise teams like CSK, MI, RCB, KKR, and RR are today global brands with their active participation in several T20 leagues across the globe.\"The analysis by Brand Finance emphasises the IPL's significant impact on sports commerce, creating 1.25 million employment opportunities across direct and indirect sectors in India, whilst extending its influence to markets in the UAE, Saudi Arabia, the US, and Australia.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115964655/115964655.jpg",
    "date": "4/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-04T12:53:00+05:30",
    "dateModified": "2024-12-04T12:53:00+05:30"
  },
  {
    "title": "Stock market today: BSE Sensex closes 110 points up; Nifty50 above 24,450",
    "link": "https://worldsnews24.vercel.app/business/stock-market-today-bse-sensex-closes-110-points-up-nifty50-above-24-450",
    "siteurl": "https://worldsnews24.vercel.app/business/stock-market-today-bse-sensex-closes-110-points-up-nifty50-above-24-450",
    "description": "Stock market today: BSE Sensex closes 110 points up; Nifty50 above 24,450",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115957244/115957244.jpg",
    "description1": "Stock market today: BSE Sensex continued its upward trend for the fourth consecutive day, gaining 110 points on Wednesday, supported by positive movements in HDFC Bank and ICICI Bank shares, along with sustained foreign investment. The main index closed at 80,956.33, after reaching a high of 81,245.39 during trading hours.The NSE Nifty registered a modest increase of 10.30 points, finishing at 24,467.45.Among Sensex constituents, significant gains were recorded by HDFC Bank, Bajaj Finserv, NTPC, Titan, Tata Consultancy Services, Tech Mahindra, Bajaj Finance and ICICI Bank.The declining shares included Bharti Airtel, Tata Motors, Adani Ports, Power Grid, Maruti, ITC, Reliance Industries and UltraTech Cement.For",
    "description2": "eign institutional investors demonstrated renewed confidence by investing Rs 3,664.67 crore in equities on Tuesday, as per exchange records.In Asian markets, Tokyo showed positive results, whilst Seoul, Shanghai and Hong Kong declined. European markets displayed predominantly positive trends, and US markets closed largely higher on Tuesday.A monthly survey revealed that India's services PMI decreased to 58.4 in November, although employment in the sector showed substantial growth.The international oil benchmark Brent crude increased by 0.34 per cent to USD 73.91 per barrel.On Tuesday, the BSE Sensex had risen by 597.67 points to close at 80,845.75, whilst the Nifty advanced by 181.10 points to reach 24,457.15.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115957244/115957244.jpg",
    "date": "4/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-04T09:27:00+05:30",
    "dateModified": "2024-12-04T09:27:00+05:30"
  },
  {
    "title": "Survey: Services activity holds steady, jobs rise",
    "link": "https://worldsnews24.vercel.app/business/survey-services-activity-holds-steady-jobs-rise",
    "siteurl": "https://worldsnews24.vercel.app/business/survey-services-activity-holds-steady-jobs-rise",
    "description": "Survey: Services activity holds steady, jobs rise",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115987923/115987923.jpg",
    "description1": "NEW DELHI: Activity in the country's services sector remained steady, with job creation reaching its highest level but price pressures remaining stubborn, a survey showed on Wednesday.At 58.4 in Nov - down marginally from 58.5 in Oct - the HSBC India Services Business Activity Index indicated a sharp rate of expansion that remained well above its trend. Survey participants att",
    "description2": "ributed the upturn to demand strength and new business gains. The 50-point mark separates expansion from contraction in the survey. Firms noted gains from clients in Asia, Europe, Latin America and the US. \"During Nov, services sector employment notably grew at the fastest pace ever recorded since this survey began in 2005,\" said Pranjul Bhandari, chief India economist at HSBC.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115987923/115987923.jpg",
    "date": "5/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-05T05:51:00+05:30",
    "dateModified": "2024-12-05T05:51:00+05:30"
  },
  {
    "title": "Google to set up its 1st India safety engineering centre in Hyderabad",
    "link": "https://worldsnews24.vercel.app/business/google-to-set-up-its-1st-india-safety-engineering-centre-in-hyderabad",
    "siteurl": "https://worldsnews24.vercel.app/business/google-to-set-up-its-1st-india-safety-engineering-centre-in-hyderabad",
    "description": "Google to set up its 1st India safety engineering centre in Hyderabad",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115987893/115987893.jpg",
    "description1": "Hyderabad: Even as its largest campus outside the US headquarters comes up in Hyderabad, tech giant Google has now zeroed in on the city for its Google Safety Engineering Centre (GSEC) as well. This will be Google's first GSEC in India and the second of its kind in Asia Pacific after Japan. It will also",
    "description2": " be only the fifth such centre globally after Dublin, Munich and Malaga, and will house a globally crucial centre of competency on cyber security and safety engineering. The GSEC is expected to commence operations in Feb 2025. It will also work towards fostering skill development and boosting employment.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115987893/115987893.jpg",
    "date": "5/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-05T05:51:00+05:30",
    "dateModified": "2024-12-05T05:51:00+05:30"
  },
  {
    "title": "Stock market today: BSE Sensex reclaims 81,000; Nifty50 above 24,500",
    "link": "https://worldsnews24.vercel.app/business/stock-market-today-bse-sensex-reclaims-81-000-nifty50-above-24-500",
    "siteurl": "https://worldsnews24.vercel.app/business/stock-market-today-bse-sensex-reclaims-81-000-nifty50-above-24-500",
    "description": "Stock market today: BSE Sensex reclaims 81,000; Nifty50 above 24,500",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115990282/115990282.jpg",
    "description1": "Stock market today: BSE Sensex and Nifty50, the Indian equity benchmark indices, opened in green on Thursday. While BSE Sensex moved above 81,000, Nifty50 was above 24,500. At 9:17 AM, BSE Sensex was trading at 81,093.61, up 137 points or 0.17%. Nifty50 was at 24,504.10, up 37 points or 0.15%.Nifty concluded Wednesday's volatile session without significant change, influenced by conflicting factors between domestic positives and weak Asian indicators.\"We expect the consolidation to continue in the next session, though the overall sentiment should stay positive. Traders are advised to focus on a stock-specific approach and use these intermediate pauses to accumulate quality stocks,\" said Ajit Mishra – SVP, R",
    "description2": "esearch, Religare Broking.Support exists at 24,350, with resistance at 24,700. Breaking above 24,700 could extend the upward trend, whilst falling below 24,350 might weaken market confidence, according to an ET report.US indices achieved record closings on Wednesday, with technology shares leading gains following Salesforce results and Powell's remarks.Asian shares improved following global stock records. French political developments affected currency trading.Oil prices increased Thursday before OPEC+ meeting, with focus on supply decisions and Middle East situations.FPIs bought Rs 1,797 crore whilst DIIs sold Rs 90 crore on Wednesday. FII net short position reduced to Rs 82,563 crore from Rs 97,387 crore.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115990282/115990282.jpg",
    "date": "5/12/2024",
    "time": "Updated 1:34:11 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-05T09:19:00+05:30",
    "dateModified": "2024-12-05T09:19:00+05:30"
  },
  {
    "title": "Sebi cancels SME IPO of Trafiksol ITS Technologies, orders to refund money",
    "link": "https://worldsnews24.vercel.app/business/sebi-cancels-sme-ipo-of-trafiksol-its-technologies-orders-to-refund-money",
    "siteurl": "https://worldsnews24.vercel.app/business/sebi-cancels-sme-ipo-of-trafiksol-its-technologies-orders-to-refund-money",
    "description": "The IPO which was open for subscription between September 10 and 12, 2024 oversubscribed 345.65 times. The issue was priced at the upper end of the price band (Rs 70 per share) and Rs 44.87 crore was raised through the issue.",
    "thumbnail": "https://images.indianexpress.com/2024/12/sebi.jpg",
    "description1": "Market regulator Securities and Exchange Board of India (Sebi) has cancelled the SME IPO of Trafiksol ITS Technologies and asked the company to refund the money to the investors for alleged questionable dealings with a ‘shell entity’. The IPO which was open for subscription between September 10 and 12, 2024 oversubscribed 345.65 times. The issue was priced at the upper end of the price band (Rs 70 per share) and Rs 44.87 crore was raised through the issue. After the closure of the issue and allotment of shares, a complaint was received by SEBI and BSE from the Small Investors’ Welfare Association – SIREN which alleged that the objects of the issue by the company included purchase of software valued at Rs 17.70 crore from a vendor which had questionable financials and failed to file its annual financial statements with the Ministry of Corporate Affairs. The BSE then in consultation with the SEBI deferred the listing of the shares of the company. “Based on the findings, it is reasonable to conclude that the third-party vendor (TPV) in question is a ‘shell entity’. The TPV's office was found locked during a site inspection, and its financial statements for FY22 to FY24, submitted in response to allegations, were obtained under questionable circumstances as it was signed by the auditor on same day it was submitted to the BSE by the MB (merchant banker),” Sebi said in its 16-page order. This was one day after BSE in consultation with Sebi put on hold the listing of the shares of the company and initiated an examination. “Further, the client list and credentials of its directors, presented in its profile, were fabricated. Apart from the above, the ex-director’s sworn statement that the company was sold for a nominal sum of Rs. 20,000 reinforces the conclusion that the TPV lacked the technical expertise and operational capacity to execute a complex project such as ICCC software,” Sebi said. Further, the client list and credentials of its directors, presented in its profile, were fabricated. Apart from the above, the ex-director’s sworn st",
    "description2": "atement that the company was sold for a nominal sum of Rs 20,000 reinforces the conclusion that the TPV lacked the technical expertise and operational capacity to execute a complex project such as ICCC software, Sebi order said. “The question of whether the quotation from the TPV was part of a scheme to divert IPO proceeds will remain moot due to the events triggered by the complaint and subsequent regulatory intervention. This, however, does not take away the fact that the company relied on a sham entity and participated in a cover-up when the credentials of the TPV were being examined,” Sebi said. “I cannot also lose sight of the fact that the funds of the investors who have been allotted shares in the IPO have remained locked-in for close to three months now. Therefore, the issue cannot be put on hold till the other findings of the Investigation are adjudicated,” Sebi Wholetime Director Ashwani Bhatia said in the order. Balancing these considerations, the most prudent course of action is to direct the company to refund the money raised through the IPO, Sebi said. The company may approach the market afresh after the ongoing proceedings initiated by SEBI are concluded and subject to any directions issued therein, it said. Incorporated in March 2018, Noida-based Trafiksol says it offers comprehensive solutions for intelligent transportation systems and automation, including software development, consultancy and supply services. \"Our offerings encompass ready-made and customized software solutions, operating systems, business applications, and computer games across all platforms,\" it said in the IPO prospectus. Jitendra Narayan Das is the chairman and MD of the company. The company made a revenue of Rs 65.81 crore and a net profit of Rs 12.01 crore for FY2024. The primary market had witnessed a flood of SME IPOs with oversubscription of up to 2,000 times in one instance and huge listing premium in the recent months. This had prompted many small entities to go for SME IPOs, forcing the Sebi and exchanges to tighten the SME IPO norms.",
    "image": "https://images.indianexpress.com/2024/12/sebi.jpg",
    "date": "4/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T03:30:23+05:30",
    "dateModified": "2024-12-04T03:30:23+05:30"
  },
  {
    "title": "Fresh US-China trade war breaks over chips, ‘connecting economies’ like India could gain",
    "link": "https://worldsnews24.vercel.app/business/fresh-us-china-trade-war-breaks-over-chips-connecting-economies-like-india-could-gain",
    "siteurl": "https://worldsnews24.vercel.app/business/fresh-us-china-trade-war-breaks-over-chips-connecting-economies-like-india-could-gain",
    "description": "IMF's First DMD Gita Gopinath had said that evidence suggests non-aligned countries (such as India) did not play an important role serving as connectors between rival blocs during the Cold War.",
    "thumbnail": "https://images.indianexpress.com/2024/12/trump-xi.jpg",
    "description1": "US and China have got into fresh tit-for-tat trade restrictions. After the US announced export restrictions on computer chip-making equipment, software and high-bandwidth memory chips, China on Tuesday retaliated by banning exports of gallium, germanium, antimony and other key high-tech materials to the US. The fresh trade war assumes significance as “connecting economies” who are perceived as neutral and do not fall into the US or China camps, such as India, have benefited from the geo-political tensions between US and China since Donald Trump’s first term. As China’s export share in the US saw a decline from 2019, countries like Vietnam, Mexico and India have witnessed an increase in export opportunities to the US. China’s export ban on Tuesday of gallium, germanium, antimony and other key high-tech materials follows it’s earlier move to partly restrict exports of strategically important materials by asking exporters to apply for licences. The Chinese Commerce Ministry announced the export ban after the US expanded its list of Chinese companies subject to export controls on computer chip-making equipment, software and high-bandwidth memory chips. In a speech earlier this year, First Deputy Managing Director at International Monetary Fund (IMF) Gita Gopinath had said that evidence suggested that non-aligned countries (such as India) did not play an important role serving as connectors between rival blocs during the Cold War — likely because they had a much smaller economic footprint and global supply chains were not yet developed. But today these countries have greater economic and diplomatic heft and are much more integrated into the global economy and their role as connectors this time around can help attenuate some of the costs of fragmentation. Gopinath had compared current trade fragmentation with that of the Cold War period stating t",
    "description2": "hat trade between the rival Western and Eastern blocs was significantly depressed during the Cold War, relative to trade within these blocs. “Thus far, today’s fragmentation is not significantly different from the initial years of the Cold War. However, compared to the average ‘between-bloc trade shortfall’ during the entire Cold War period, fragmentation so far is an order of magnitude smaller,” she said. Explaining her cause of concern during the current period, Gopinath said, trade fragmentation is much more costly this time around because unlike the start of the Cold War when goods trade to GDP was 16 per cent, now that ratio is 45 per cent. “Moreover, while back then countries within a bloc were taking off trade restrictions, now we are in an environment of growing protectionism with several countries turning inward. The potential role of non-aligned countries in the current trade frictions also makes the situation today different from the Cold War experience,” she said. Notably, India is planning to increase the funding outlay for chip manufacturing incentive policy to $15 billion from the $10 billion it had committed for the first phase. Tata is building India’s first commercial fabrication plant along with its Taiwanese partner Powerchip Semiconductor Manufacturing Corporation (PSMC) for a cost of more than Rs 91,000 crore. The government has also approved three assembly and testing plants, which are called ATMP and OSAT in chip parlance. The assembly and testing plants are less complex than the semiconductor fabrication plant. The first of these three plants was approved in June 2023, and is being built by US-based Micron Technology. Tata is building an assembly plant in Assam while the third facility is being built by CG Power and Industrial Solutions of the Murugappa Group, in partnership with Renesas Electronics of Japan. &nbsp;",
    "image": "https://images.indianexpress.com/2024/12/trump-xi.jpg",
    "date": "3/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T18:36:08+05:30",
    "dateModified": "2024-12-03T18:36:08+05:30"
  },
  {
    "title": "Why some PLI schemes are in the slow lane; what govt is doing about it",
    "link": "https://worldsnews24.vercel.app/business/why-some-pli-schemes-are-in-the-slow-lane-what-govt-is-doing-about-it",
    "siteurl": "https://worldsnews24.vercel.app/business/why-some-pli-schemes-are-in-the-slow-lane-what-govt-is-doing-about-it",
    "description": "The progress on the Production-Linked Incentive  scheme, which covers 14 sectors, and the learnings from each, has prompted deliberations to tweak the formats of some to optimise tangible outcomes, renew some, and increase the outlay in yet others.",
    "thumbnail": "https://images.indianexpress.com/2024/12/PLI.jpg",
    "description1": "If employment generation is used as a metric, six of the 14 Production-Linked Incentive (PLI) schemes including textiles, solar modules, IT hardware, automobiles, advanced chemical cells (ACC), and specialty steel, are relatively in the slow lane. Others, including food processing and mobile phone manufacturing, appear to be well on track to meet the targets set at the time the schemes were announced. The progress on the PLI scheme, which covers 14 sectors, and the learnings from each, has prompted deliberations to tweak the formats of some to optimise tangible outcomes, renew some, and increase the outlay in yet others. The government views PLI schemes to be crucial for India on two fronts: one, to leverage public funding to scale up the domestic manufacturing base such as to increase India’s contribution to the global supply chains, and second, to create lakhs of direct and indirect jobs. The scale up in the employment outcomes from these schemes, according to at least two government officials The Indian Express spoke with, can be fully leveraged once the supply chain is established and the benefits of the schemes percolates down to smaller suppliers. These benefits, they said, are beginning to show in sectors such as mobile manufacturing and food processing. They also point to the need to calibrate employment outcomes only after a scheme gathers a certain critical mass. The potential is big. A note by rating agency Crisil from February 2024 said the scheme could drive industrial capital expenditure of Rs 3-3.5 lakh crore over its duration and constitute 8-10 per cent of total capex in key industrial sectors over the next three to four years. The industry has, however, complained of some niggling issues in the scheme for various sectors — there range from stringent eligibility norms, access to Chinese machinery and technicians, and import tariffs in some cases. The initial challenge The PLI schemes for many sectors are a big task by all means, as a domestic manufacturing industry has to be developed from scratch, since India has traditionally not had a footprint there. This could pose an initial challenge to employment generation, as companies in some sectors t",
    "description2": "ake time to set up manufacturing operations. The PLI scheme in sectors like solar modules and ACC allow for a commissioning period of one-and-a-half to three years. But some schemes have seen early initial traction. For instance, mobile phone manufacturing. Before the PLI scheme, India was a net importer of phones for domestic consumption. After the scheme, as companies like Apple ramped up assembly in the country, virtually all phones sold in the country are made in, with in India. In fact, India exported smartphones worth around $15 billion in 2023-24. In several PLI schemes, the initial beneficiaries of incentives are likely going to be bigger companies. In mobile phone manufacturing, the biggest beneficiary so far has been Apple. However, the government’s bet is initial support to these enterprises will trickle down to the overall supply chain, and spur the ancillary industry. This will allow input makers (who may not directly benefit from PLI incentives) to set up shop in India to service companies that receive the incentives. This could further boost employment. For example, according to Apple’s suppliers’ list for 2023, at least 14 of its suppliers were from India, a number which was virtually zero before Apple started assembling iPhones in India. The idea with PLI schemes – the support for which ranges from three to seven years – is also to get a certain critical mass in a sector, so that when incentives are withdrawn, the sector remains competitive on an export parity basis. Critics, however, argue that the scheme is akin to subsidisation and may not result in competitiveness, especially once the incentives are over. Review of the PLI scheme The government is in active discussion with stakeholders as it reviews the progress of the PLI schemes in the 14 sectors, especially those like textiles, advanced chemistry battery cell, solar modules, and automobiles, where progress has been slow. The IT hardware PLI scheme was recently upgraded with an increased outlay, with discussions around renewing other schemes, such as that for drones, learnt to be also under consideration. The government could also tinker with eligibility criteria in schemes such as textiles.",
    "image": "https://images.indianexpress.com/2024/12/PLI.jpg",
    "date": "4/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T04:20:37+05:30",
    "dateModified": "2024-12-04T04:20:37+05:30"
  },
  {
    "title": "India tops global list for mobile malware attacks: Zscaler Report",
    "link": "https://worldsnews24.vercel.app/business/india-tops-global-list-for-mobile-malware-attacks-zscaler-report",
    "siteurl": "https://worldsnews24.vercel.app/business/india-tops-global-list-for-mobile-malware-attacks-zscaler-report",
    "description": "With nearly half of mobile attacks being trojans (malware that tricks users into downloading and running malicious software), the financial sector is particularly vulnerable.",
    "thumbnail": "https://images.indianexpress.com/2024/12/cyber-fraud.jpg",
    "description1": "In a startling revelation, India now tops the list for mobile malware attacks globally, surpassing the United States and Canada, with a disappointing step-up from its previous third-place ranking, according to a report. The Zscaler ThreatLabz 2024 Mobile, IoT, and OT Threat Report analysed a dataset comprising over 20 billion threat-related mobile transactions and associated cyber threats, between June 2023 to May 2024. \"India has become the top global target for mobile malware attacks, accounting for 28 per cent of the total, surpassing the United States (27.3 per cent) and Canada (15.9 per cent). This significant jump from its 3rd place ranking last year underscores the critical need for Indian enterprises to adopt robust security measures, especially amid the rapid digital transformation and increasing cyber threats,\" the report said. With nearly half of mobile attacks being trojans (malware that tricks users into downloading and running malicious software), the financial sector is particularly vulnerable. The report revealed a 29 per cent increase in banking malware attacks and a staggering 111 per cent rise in mobile spyware attacks. \"Most financially motivated malware attacks are highly capable of bypassing Multifactor Authentication (MFA) and frequently leverage phishing vectors, such as fake login pages for different financial institutions, social media sites, and crypto wallets,\" it said. Phishing attempts targeting mobile customers of major Indian banks, such as HDFC, ICICI, and Axis banks, have increased, according to ThreatLabz analysts. Thes",
    "description2": "e clever attacks deceive mobile users into disclosing critical bank information by using phoney banking websites that closely mimic the real ones, it said. Previously, similar tactics were used to spread Android-based phishing malware through fake card update sites, leading to widespread financial fraud. The Indian postal service has also become a target for attackers. Using SMS messages, they direct mobile users to phishing sites that prompt them to input credit card details. These fraudulent schemes often exploit common scenarios like missing packages and incomplete delivery addresses, capitalising on the urgency created by such messages, the report noted. \"Legacy systems and unprotected IoT/ OT (Internet of Things/Operational Technology) environments are becoming prime targets for cybercriminals. We see a significant rise in hacking campaigns targeted at these environments. \"It is necessary for Indian enterprises to adopt a robust zero-trust security framework to secure their core operational environments. This will not only protect critical systems but also ensure business continuity in an increasingly connected world,\" said Suvabrata Sinha, CISO-India, Zscaler. The report also indicated a concerning global trend, with over 200 malicious applications discovered on the Google Play Store and a 45 per cent year-over-year increase in IoT malware transactions, underscoring the pervasive nature of cyber threats today. On a positive note, India has improved its ranking as a malware origin point, moving from 5th to 7th place in the APAC (Asia-Pacific) region.",
    "image": "https://images.indianexpress.com/2024/12/cyber-fraud.jpg",
    "date": "3/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T11:52:04+05:30",
    "dateModified": "2024-12-03T11:52:04+05:30"
  },
  {
    "title": "Swiggy cuts losses marginally in Q2",
    "link": "https://worldsnews24.vercel.app/business/swiggy-cuts-losses-marginally-in-q2",
    "siteurl": "https://worldsnews24.vercel.app/business/swiggy-cuts-losses-marginally-in-q2",
    "description": "Total income rose sharply to Rs 3,686.26 crore in the September quarter as against Rs 2,850.52 crore a year ago.",
    "thumbnail": "https://images.indianexpress.com/2024/12/swiggy.jpg",
    "description1": "Food and grocery delivery platform Swiggy Ltd has marginally narrowed its consolidated net loss in the second quarter of financial year 2024-25 to Rs 625.53 crore from Rs 657 crore a year ago. However, sequentially, the loss increased as the firm had reported a consolidated loss of Rs 611 crore in the first quarter of FY25. Total income rose sharply to Rs 3,686.26 crore in the September quarter as against Rs 2,850.52 crore a year ago. Swiggy, which was listed on November 13 this year, saw a robust growth in its food delivery as well as quick commerce verticals during the quarter under review. Zomato, which was listed three years ago, recently reported a sharp jump o",
    "description2": "f five times in consolidated net profit to Rs 176 crore in Q2FY25. Sriharsha Majety, MD &amp; Group CEO, Swiggy, said, “The remarkable performance of our food business operations comes on the back of strong innovation and execution. We are constantly trying to anticipate and improve the consumer's experience. The recent launch of Bolt- our 10-minute delivery service is an example of that.” “Similarly in quick commerce, we are anticipating and responding to consumer behaviour to bring more and more convenience to urban households. Instamart today is present in 54 cities and delivers more than 32000 unique items, within an average delivery time of 13 minutes,” he said.",
    "image": "https://images.indianexpress.com/2024/12/swiggy.jpg",
    "date": "4/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T00:55:03+05:30",
    "dateModified": "2024-12-04T00:55:03+05:30"
  },
  {
    "title": "GoM proposes hike in GST on aerated drinks, cigarettes & tobacco to 35%",
    "link": "https://worldsnews24.vercel.app/business/gom-proposes-hike-in-gst-on-aerated-drinks-cigarettes-tobacco-to-35",
    "siteurl": "https://worldsnews24.vercel.app/business/gom-proposes-hike-in-gst-on-aerated-drinks-cigarettes-tobacco-to-35",
    "description": "The proposed hike from the current highest slab of 28 per cent would help the Centre and states to make up for the loss from rate cuts on other common-use items",
    "thumbnail": "https://images.indianexpress.com/2024/12/nirmala.jpg",
    "description1": "IN A step that would mark the first major restructuring of tax rates under the Goods and Services Tax (GST) seven years after its rollout, a special rate of 35 per cent could be carved out for demerit (sin) goods such as aerated beverages, cigarettes, tobacco and related products. At a meeting on Monday, ahead of the GST Council meeting on December 21, the Group of Ministers (GoM) on rate rationalisation finalised its report with this recommendation of a special rate, in addition to proposing a slew of rate tweaks for over 148 items including readymade garments. The proposed hike in GST rates for sin goods, from the current highest slab of 28 per cent, would help the Centre and the states to make up for the loss from other rate cuts for common-use items, officials said. The current four-slab GST structure - of 5 per cent, 12 per cent, 18 per cent and 28 per cent - will continue for the medium term, a state finance minister said. Among other rate change proposals, the GoM, headed by Bihar Deputy Chief Minister Samrat Choudhary, has suggested levying 5 per cent GST on readymade garments priced up to Rs 1,500; 18 per cent for those priced at Rs 1,500-10,000; and 28 per cent for garments costing above Rs 10,000. “The GoM has proposed raising the rates for tobacco and related products, and aerated beverages to 35 per cent. It will be a special rate and will help in minimising the revenue loss impact from the other rate changes,” a state finance minister, who is part of the GoM, told The Indian Express. The GoM has also proposed hiking rates on other high-end items such as cosmetics, watches and shoes. With this, the indirect tax regime would transition towards a regime where taxation gets linked to the pricing of the product and hence, a greater incidence would be on those who buy luxury and high-end items. The GST Council is scheduled to meet in Jaisalmer on December 21, where it will also take up the key proposal of GST on life and health insurance premiums. The premiums paid by seni",
    "description2": "or citizens for health insurance and premiums paid by all for term life insurance are likely to be exempted. For other citizens, health insurance cover till Rs 5 lakh is likely to be exempted and the existing rate of 18 per cent will be charged for health insurance cover over Rs 5 lakh. At its meeting in October, the GoM had suggested GST rejig for several items and proposed cutting rates for some items such as packaged water above 20 litres (5 per cent from 18 per cent), bicycles priced less than Rs 10,000 (5 per cent from 12 per cent) and exercise notebooks (5 per cent from 12 per cent). Shoes costing above Rs 15,000 and wristwatches above Rs 25,000 are likely to be shifted to the highest slab of 28 per cent GST from 18 per cent. Separately, the GoM on compensation cess, headed by Minister of State for Finance Pankaj Chaudhary, also held its meeting on Monday and sought an extension of six months to submit its report to the GST Council. This GoM, which includes members from Assam, Chhattisgarh, Gujarat, Karnataka, Madhya Pradesh, Punjab, Tamil Nadu, Uttar Pradesh and West Bengal, was mandated to submit its report by December 31. The GoM is looking at the legal implications of removal of the cess - levied on sin and luxury goods such as cars, tobacco, over and above the existing highest rate of 28 per cent. “There is time till March 2026 to take a decision regarding the levy of the cess. So it was felt that a detailed discussion should happen, and so more time will be sought for submission of the report,” the minister said. The compensation cess was proposed to be levied for five years after the rollout of GST, till June 2022, to compensate states for revenue loss. In 2022, the Council decided to extend the levy till March 2026 to repay the interest and principal amount of the Rs 2.69 lakh crore of loans taken in 2021-2022 to pay off states' revenue loss during Covid years. At its meeting on September 9, the Council decided to set up a GoM to decide the future course of the cess.",
    "image": "https://images.indianexpress.com/2024/12/nirmala.jpg",
    "date": "3/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T01:15:46+05:30",
    "dateModified": "2024-12-03T01:15:46+05:30"
  },
  {
    "title": "6E vs 6e: IndiGo takes Mahindra Electric to court alleging trademark infringement",
    "link": "https://worldsnews24.vercel.app/business/6e-vs-6e-indigo-takes-mahindra-electric-to-court-alleging-trademark-infringement",
    "siteurl": "https://worldsnews24.vercel.app/business/6e-vs-6e-indigo-takes-mahindra-electric-to-court-alleging-trademark-infringement",
    "description": "In a filing with the stock exchanges, M&M said that it does not see any conflict with IndiGo pertaining the trademarks, and that along with MEAL, it is in talks with the airline to arrive at an “amicable solution”.\n\n",
    "thumbnail": "https://images.indianexpress.com/2024/12/IndiGo-1.jpg",
    "description1": "India’s largest airline IndiGo has filed a case in the Delhi High Court against automobile major Mahindra &amp; Mahindra’s (M&amp;M) electric mobility arm—Mahindra Electric Automobile (MEAL)—for using the airline’s identifier code 6E in the name of its recently unveiled electric vehicle BE 6e. IndiGo has the registration for the “6E” trademark and uses it extensively in its branding and advertising. “The ‘6E’ mark is an integral part of IndiGo’s identity for the past 18 years and is a registered trademark that holds strong global recognition. The ‘6E’ mark, whether standalone or in its variants and formative forms, is extensively used by IndiGo for its offerings and for goods and services provided in collaboration with trusted partners. Any unauthorised use of the “6E” mark, whether standalone or in any form, constitutes an infringement of IndiGo’s rights, reputation, and goodwill. IndiGo is committed to taking all necessary and appropriate steps to safeguard its intellectual property and brand identity,” the airline said in a statement. MEAL unveiled its electric origin SUVs — BE 6e and XEV 9e — on November 26, and has applied for trade mark registration for “BE 6e”. In ",
    "description2": "a filing with the stock exchanges, M&amp;M said that it does not see any conflict with IndiGo pertaining the trademarks, and that along with MEAL, it is in talks with the airline to arrive at an “amicable solution”. “.the Company (M&amp;M) does not see a conflict as Mahindra’s mark is ‘BE 6e’, not the standalone ‘6E’. It differs fundamentally from IndiGo’s ‘6E’, which represents an airline, eliminating any risk of confusion. The distinct styling further emphasizes their uniqueness,” M&amp;M said, adding that the trade mark registration filed by the MEAL is specifically for the vehicle class. “The Company and MEAL has taken on board the concerns that InterGlobe Aviation Limited (‘IndiGo’) have to infringement of their goodwill, which was not our intention. The Company and MEAL are engaged in discussions with them to find an amicable solution,” the automobile company said. The case came up for hearing before the Delhi High Court on Tuesday, and is now likely to come up for hearing next week. The starting price for the BE 6e is Rs 18.90 lakh and it will be launched in phased manner from January end. MEAL expects to start deliveries towards the end of February or early March.",
    "image": "https://images.indianexpress.com/2024/12/IndiGo-1.jpg",
    "date": "3/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T20:07:14+05:30",
    "dateModified": "2024-12-03T20:07:14+05:30"
  },
  {
    "title": "Rupee recovers from all-time low, rises 3 paise to 84.69 against US dollar",
    "link": "https://worldsnews24.vercel.app/business/rupee-recovers-from-all-time-low-rises-3-paise-to-84-69-against-us-dollar",
    "siteurl": "https://worldsnews24.vercel.app/business/rupee-recovers-from-all-time-low-rises-3-paise-to-84-69-against-us-dollar",
    "description": "One of the main reasons for the depreciation of INR has been the broad-based strength of the USD. ",
    "thumbnail": "https://images.indianexpress.com/2024/12/rupee-2.jpg",
    "description1": "The rupee recovered from its all-time low level and settled for the day with gains of just 3 paise at 84.69 (provisional) against the US dollar in a range-bound trade on Tuesday, amid a positive trend in domestic equities. Forex traders said the rupee has been on a downtrend largely on the back of Donald Trump's rhetoric on BRICS currency, political instability in the Eurozone, weaker domestic macroeconomic indicators and unabated foreign portfolio outflows. US President-elect Trump on Saturday threatened a 100 per cent tariff on BRICS nations if they act to undermine the US dollar. Moreover, market participants are also awaiting cues from the upcoming RBI monetary policy on December 6, which will likely focus on balancing inflation and growth. At the interbank foreign exchange, the rupee opened at 84.75 and moved in a narrow range and touched an intra-day high of 84.64 and an all-time low of 84.76 against the greenback. On Monday, the rupee depreciated 12 paise to close at an all-time low of 84.72 against the dollar. Meanwhile, the dollar index, which gauges the greenback's strength against a basket of six currencies, was trading lower by 0.18 per cent at 106.25. Brent crude, the global oil benchmark, rose by 1.11 per cent to USD 72.63 per barrel in futures trade. Meanwhile, Minister of State for Finance Pankaj Chaudhary on Monday said in Parliament that the rupee remains one of the best-pe",
    "description2": "rforming Asian currencies despite geopolitical tensions in the Middle East and other headwinds, indicating India's sound economic fundamentals. One of the main reasons for the depreciation of INR has been the broad-based strength of the USD, he said. \"During CY 2024, Dollar Index has increased by about 4.8 per cent till November 19, 2024. More recently, the Dollar Index touched 108.07 on November 22, 2024, its highest in more than a year, exerting pressure on emerging market currencies,\" he said. Further, geopolitical tensions in the Middle East and uncertainty surrounding US elections results also added to the headwinds. The depreciation of a currency is likely to enhance export competitiveness, which in turn impacts the economy positively. On the other hand, depreciation may raise the prices of imported goods. He further said, the RBI monitors key developments across the globe which may have an impact on USD-INR exchange rate. On the domestic equity market front, the 30-share benchmark index Sensex closed 597.67 points, or 0.74 per cent higher, at 80,845.75. The Nifty rose 181.10 points, or 0.75 per cent, to settle at 24,457.15. Traders said the persistent selling pressure by foreign funds added further strain on the currency. Foreign Institutional Investors (FIIs) were net sellers in the capital markets on Monday, as they offloaded shares worth Rs 238.28 crore, according to exchange data.",
    "image": "https://images.indianexpress.com/2024/12/rupee-2.jpg",
    "date": "3/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T19:29:35+05:30",
    "dateModified": "2024-12-03T19:29:35+05:30"
  },
  {
    "title": "Japanese firms keen to set up semiconductor units in India: Deloitte",
    "link": "https://worldsnews24.vercel.app/business/japanese-firms-keen-to-set-up-semiconductor-units-in-india-deloitte",
    "siteurl": "https://worldsnews24.vercel.app/business/japanese-firms-keen-to-set-up-semiconductor-units-in-india-deloitte",
    "description": "India aspires to have 10 semiconductor manufacturing plants in 10 years.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Untitled-design-13-2.png",
    "description1": "Japanese firms are keen to set up semiconductor units in India and they have all the expertise and specialisation to partner with domestic firms, Deloitte has said. It also said that skilled workforce, funds and continuation of support measures are key to push growth of the semiconductor sector in India. Japanese firms are \"super enthusiastic\" about India, Shingo Kamaya, Deloitte AP and SRT Leader, Deloitte Japan said. In July, Japan became the second Quad partner after the US to sign an agreement with India for the joint development of the semiconductor ecosystem and maintain the resilience of its global supply chain. The two countries signed the memorandum for semiconductor design, manufacturing, equipment research, talent development and to bring resilience in the semiconductor supply chain. With around 100 semiconductor manufacturing plants, Japan is among the top five countries to have a semiconductor ecosystem. Japan houses companies that are global leaders in raw form of semiconductor wafers, chemical and gases, lenses that are used in chip manufacturing equipment, and display technologies. India aspires to have 10 semiconductor manufacturing plants in 10 years. \"Given the technology, given the specialization, there is no better partner ",
    "description2": "to get on to developing such an ambitious and a critical ecosystem of semiconductor than Japan,\" Rohit Berry, President - Strategy, Risk and Transactions, Deloitte India, said. He said that the semiconductor story in the country is not just about setting up one factory, but it is about that entire ecosystem. \"And that is where many Japanese companies who have set up such ecosystems in Japan or in any other places are going to be absolutely critical to set it up (in India). So this is the vision. This is a grand plan. This is the investment. This is the commitment,\" he added. Berry also said that developing the right kind of partnerships between Indian and Japanese firms are fundamental for the growth of the sector. \"This is not a one year game, it's not a two year game. This will basically benefit us and Japan for generations,\" he noted. He also emphasised that the government incentive program on a sustained basis will also be a key factor for the sector's growth in India. When asked if Japanese firms are looking for any specific support measures from states, he said that a \"centre-state partnership, together with the private and Japanese partnership, all four of them coming together will be a prerequisite to create a once in a lifetime setup\".",
    "image": "https://images.indianexpress.com/2024/12/Untitled-design-13-2.png",
    "date": "3/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T14:49:06+05:30",
    "dateModified": "2024-12-03T14:49:06+05:30"
  },
  {
    "title": "Home price index rises by 4.3% amid high interest rates, inflation: RBI",
    "link": "https://worldsnews24.vercel.app/business/home-price-index-rises-by-4-3-amid-high-interest-rates-inflation-rbi",
    "siteurl": "https://worldsnews24.vercel.app/business/home-price-index-rises-by-4-3-amid-high-interest-rates-inflation-rbi",
    "description": "The RBI’s home index is based on transaction-level data received from the registration authorities in top ten major cities.",
    "thumbnail": "https://images.indianexpress.com/2024/12/construct.jpg",
    "description1": "Home prices are on the rise in India despite high interest rates in the banking system and inflation. The All-India Home Price Index (HPI) of the Reserve Bank of India rose by 4.34 per cent to 322 as of September 2024 as against 308.6 in September 2023, indicating that price rise is continuing across the metros, according to Reserve Bank of India data. HPI has gone up by nearly 67 per cent in the last ten years from 193.05 in 2014-15 amid the pandemic, high inflation and interest rates. The annual HPI growth varied widely across the cities, ranging from a high growth of 8.76 per cent (Bengaluru) to a decline of (-)2.0 per cent (Kanpur). On sequential (quarter-on-quarter) basis, all-India HPI decreased by 0.1 per cent in September 2024-25. Ahmedabad, Lucknow, Kolkata and Chennai recorded a sequential rise in house prices during the latest quarter, RBI data shows. Home price index for Mumbai rose by 2.95 per cent to 303.62 in September 2024 as against 294.92 a year ago, Delhi increased by 3.31 per cent to 350.40 from 339.16 and Bengaluru by 8.76 per cent to 360.11 from 331.08. The RBI’s home index is based on transaction-level data received from the registration authorities in top ten major cities. Average housing prices across the top eight markets in India rose 11 per cent year-on-year at Rs 11,000 per sq ft during Q3 of 2024, led by sturdy demand and positive market sentiments, industry body CREDAI said. Interestingly, average housing prices have increased for the 15th consecutive quarter since 2021. All the eight major cities saw an annual increase in housing prices with Delhi NCR witnessing the highest rise at 32 per cent, followed by Bengaluru at 24 per cent rise during the quarter. After registering record high sales over the last two years, the demand momentum across the top cities is stabilizing. Nevertheless, with anticipation of healthy residen",
    "description2": "tial activity in the last quarter, 2024 is likely to end on a strong note, it said. However, overall unsold inventory continued to witness a quarterly drop for the third consecutive quarter, led by healthy uptake in housing units. At the end of September 2024, unsold inventory stood at over 10 lakh housing units across the eight major cities, with Mumbai Metropolitan Region (MMR) accounting for a majority at about 40 per cent share. Unsold units in Hyderabad saw a modest dip on a sequential basis despite a yearly increase of about 28 per cent. “The ongoing rise in housing prices is another validation of positive homebuyer sentiments and the highly conducive nature of the real estate market. We are seeing more and more aspirational homebuyers come to the fore – resulting in bigger homes that are also being reflected in the rise in prices as homes continue to get more expansive, truly reflecting the current market dynamics and consumer preferences,” said Boman Irani, President of CREDAI National. \"While the housing market is gradually stabilizing, the outlook for the residential segment remains positive supported by strong underlying market fundamentals. Developers are recalibrating their strategies, particularly in the price-sensitive segments, by offering compact size units,” said Badal Yagnik, Chief Executive Officer, Colliers India. “We expect this robust momentum to continue going into the new year and are hopeful of rate cuts in the impending future,” Irani said. “Although average housing prices have continued to increase steadily, witnessing a 11 per cent YoY growth during Q3 2024, the likely easing of monetary policy and anticipated repo rate cuts can potentially bring financial relief to homebuyers in the near term. Moreover, flexible payment plans and freebies to attract homebuyers will continue to aid in residential sales momentum,” Yagnik said.",
    "image": "https://images.indianexpress.com/2024/12/construct.jpg",
    "date": "3/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T06:32:39+05:30",
    "dateModified": "2024-12-03T06:32:39+05:30"
  },
  {
    "title": "Prime Minister's Internship Scheme to provide one crore opportunities in top companies over five years",
    "link": "https://worldsnews24.vercel.app/business/prime-minister-s-internship-scheme-to-provide-one-crore-opportunities-in-top-companies-over-five-years",
    "siteurl": "https://worldsnews24.vercel.app/business/prime-minister-s-internship-scheme-to-provide-one-crore-opportunities-in-top-companies-over-five-years",
    "description": "Prime Minister's Internship Scheme to provide one crore opportunities in top companies over five years",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204054917.jpg",
    "description1": "\n\n\nNew Delhi [India], December 4 (ANI): The Prime Minister's Internship Scheme (PMIS), announced in the Budget 2024-25, targets the creation of one crore internship opportunities within the next five years.\nAccording to the Ministry of Corporate Affairs, these internships will be offered in India's top 500 companies, identified based on their Corporate Social Responsibility (CSR) expenditure over the last three years.\n\nAs a precursor to the full-scale implementation, a Pilot Project under the PMIS has been launched, offering 1.25 lakh internship opportunities for the financial year 2024-25. This scheme is being executed through a dedicated online portal, pminternship.mca.gov.in, which facilitates the entire process, from application to selection.\n\n\nAs of now, companies have posted 1.27 lakh internship opportunities on the portal, attracting over 6.21 lakh applications from",
    "description2": " aspiring youth. The selection process is currently underway, ensuring a competitive and merit-based allocation.\nWhile the initial focus is on the top 500 companies, the scheme allows participation from other companies, banks, and financial institutions, subject to approval by the Ministry of Corporate Affairs (MCA). This approach ensures inclusivity, particularly for underrepresented sectors and regions.\nThe PMIS aims to address the critical gap between academic learning and industry requirements. Interns will have the opportunity to gain practical training, hands-on experience, and industry-specific skills, enhancing their employability in a competitive job market.\nSpeaking about the scheme, Harsh Malhotra, Minister of State for Corporate Affairs and Road Transport and Highways, highlighted its transformative potential in a written reply in Rajya Sabha on Tuesday. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204054917.jpg",
    "date": "Invalid Date",
    "time": "Updated 3:49:47 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "CCI approves subscription of optionally convertible debentures of GMR infra enterprises by Platinum Stone A 2014 Trust",
    "link": "https://worldsnews24.vercel.app/business/cci-approves-subscription-of-optionally-convertible-debentures-of-gmr-infra-enterprises-by-platinum-stone-a-2014-trust",
    "siteurl": "https://worldsnews24.vercel.app/business/cci-approves-subscription-of-optionally-convertible-debentures-of-gmr-infra-enterprises-by-platinum-stone-a-2014-trust",
    "description": "CCI approves subscription of optionally convertible debentures of GMR infra enterprises by Platinum Stone A 2014 Trust",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204051356.jpg",
    "description1": "\n\n\nNew Delhi [India], December 4 (ANI): The Competition Commission of India (CCI) has given its nod for the subscription to optionally convertible debentures (OCDs) of GMR Infra Enterprises Private Limited (Target SPV) by Platinum Stone A 2014 Trust, acting through its trustee, Platinum Rock B 2014 RSC Limited (Acquirer).\nAccording to the Competition Commission of India, the proposed combination involves the issuance of unlisted and unrated OCDs by GMR Infra Enterprises to Platinum Stone A 2014 Trust.\n\nThis transaction is linked to the Target SPV acquiring approximately 9 per cent of the fully diluted shareholding of GMR Airports Limited (GAL) from its promoter, GMR Enterprises Private Limited (GEPL), both before and after the subscription of OCDs.\n\n\nThe acquired shares of GAL will be pledged to the Acqu",
    "description2": "irer as collateral for the OCD subscription amount.\nPlatinum Stone A 2014 Trust is a trust established under the Abu Dhabi Global Market, with its sole beneficiary being the Abu Dhabi Investment Authority (ADIA).\nADIA is an independent investment institution established by the Government of the Emirate of Abu Dhabi.\nGMR Airports Limited, the focus of this transaction, is a publicly listed company actively engaged in the development, management, and operation of airports in India and globally. GAL operates three major airports in India: Delhi International Airport, GMR Hyderabad International Airport, and GMR Goa International Airport.\nThe Target SPV, GMR Infra Enterprises, is presently non-operational. A detailed order from the CCI is expected to follow, outlining further specifics of the approval. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204051356.jpg",
    "date": "Invalid Date",
    "time": "Updated 3:49:47 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "Supply chain council formed under Indo-Pacific agreement with US as Chair, India Vice-Chair",
    "link": "https://worldsnews24.vercel.app/business/supply-chain-council-formed-under-indo-pacific-agreement-with-us-as-chair-india-vice-chair",
    "siteurl": "https://worldsnews24.vercel.app/business/supply-chain-council-formed-under-indo-pacific-agreement-with-us-as-chair-india-vice-chair",
    "description": "Supply chain council formed under Indo-Pacific agreement with US as Chair, India Vice-Chair",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204042014.jpg",
    "description1": "\n\n\nNew Delhi [India], December 4 (ANI): In a step towards bolstering supply chain resilience, a Supply Chain Council (SCC) has been established under the Supply Chain Resilience Agreement, a key component of the Indo-Pacific Economic Framework for Prosperity (IPEF).\nAccording to the Ministry of Commerce and Industry, the United States has assumed the role of Chair, with India serving as Vice-Chair, reflecting the deepening collaboration between these two major economies.\n\nThe Agreement, signed in November 2023 and effective from February 24, 2024, seeks to enhance supply chain stability, particularly in critical sectors vital for national security, economic stability, and public health.\nThe IPEF, comprising 14 member countries, collectively represents around 40 per cent of global GDP and 28 per cent of global trade, underscoring its pivotal role in international economic dynamics.\nThe first SCC meeting, held in Washington in September 2024, laid the groundwork for Action Plan Teams targeting key areas such as semiconductors, critical minerals, and chemicals.\nIndia has expressed its willingness to lead efforts in the healthcare and pharmaceutical sector, demonstrating its commitment to addressing global suppl",
    "description2": "y chain vulnerabilities.\n\n\nAdditionally, two sub-committees have been formed under the SCC, focusing on logistics and movement of goods, and data analytics, to streamline operations and enhance decision-making processes.\nIndia also participated in the inaugural Crisis Response Network meeting in September 2024, which included a tabletop exercise designed to prepare member nations for potential supply chain disruptions.\nThis exercise aims to improve response times and coordination in real-world scenarios of economic and logistical crises.\nThe Union Minister of State for Commerce and Industry, Jitin Prasada, informed the Lok Sabha that India has signed two Memoranda of Understanding (MoUs) with the United States over the past two years.\nThese agreements focus on semiconductor and critical mineral sectors, critical for ensuring supply chain resilience in emerging industries.\nArticle 6.10 of the Agreement underscores the importance of private sector participation in improving supply chain resilience, efficiency, and sustainability.\nCollaborative efforts with industry leaders, academia, and experts are underway in India to identify critical sectors and key goods for enhanced cooperation with IPEF partners. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204042014.jpg",
    "date": "Invalid Date",
    "time": "Updated 3:49:47 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "L&T Technology Services Secures $50 Million Deal as a Strategic Partner From a Global Network Provider",
    "link": "https://worldsnews24.vercel.app/business/l-t-technology-services-secures-50-million-deal-as-a-strategic-partner-from-a-global-network-provider",
    "siteurl": "https://worldsnews24.vercel.app/business/l-t-technology-services-secures-50-million-deal-as-a-strategic-partner-from-a-global-network-provider",
    "description": "L&T Technology Services Secures $50 Million Deal as a Strategic Partner From a Global Network Provider",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204054154.jpg",
    "description1": "\n\n\nBusinessWire India\nBengaluru (Karnataka) [India], December 4: L&T Technology Services Limited (BSE: 540115, NSE: LTTS), a global leader in engineering and technology services, announced its selection by a leading global network solutions firm to provide Product Integration Services in North America, ensuring seamless deployment and support for customers across the region.\n\n\n\n\nThe multi-year agreement, estimated at USD 50 million, will enable the company to provide comprehensive support for the client's advanced networking solutions, ensuring seamless integration and success for customers across the region. LTTS will leverage its capabilities in AI and automation frameworks for the project deployment and execution.\n\nThe partnership combines LTTS' deep expertise in engineering and R&D services with the client's cutting-edge wireless networking solutions. Additionally, the companies aim to offer secure LTE an",
    "description2": "d 5G private networks across industries, unlocking new opportunities and enabling future-ready operations. The partnership will address current market demands while positioning itself for upcoming 5G advancements under 3GPP standards.\n\"This strategic engagement represents a significant milestone for LTTS, marking our first sizable breakthrough in global markets by leveraging the deep expertise of our Smart World & Communication (SWC) division in managing communication networks. By integrating a GLOCAL services model, cutting-edge automation and AI-driven frameworks, we will deliver value and reliability to our customer. This will help us elevate our partnership with the client further,\" said Amit Chadha, CEO & Managing Director, L&T Technology Services.\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by BusinessWire India. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204054154.jpg",
    "date": "Invalid Date",
    "time": "Updated 3:49:47 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "LTIMindtree Announces Partnership and Strategic Investment in Voicing.AI, An Agentic AI Solution for Customer Engagement Processes",
    "link": "https://worldsnews24.vercel.app/business/ltimindtree-announces-partnership-and-strategic-investment-in-voicing-ai-an-agentic-ai-solution-for-customer-engagement-processes",
    "siteurl": "https://worldsnews24.vercel.app/business/ltimindtree-announces-partnership-and-strategic-investment-in-voicing-ai-an-agentic-ai-solution-for-customer-engagement-processes",
    "description": "LTIMindtree Announces Partnership and Strategic Investment in Voicing.AI, An Agentic AI Solution for Customer Engagement Processes",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204053052.jpg",
    "description1": "\n\n\nBusinessWire India\nWarren (New Jersey) [US]/ Mumbai (Maharashtra) [India], December 4: LTIMindtree USA Inc., a wholly owned subsidiary of LTIMindtree [NSE: LTIM, BSE: 540005], a global technology consulting and digital solutions company, announced a partnership, including a strategic investment in Voicing.AI, a next-generation start-up. This partnership aligns with LTIMindtree's strategy, AI in everything, Everything for AI and AI for Everyone. Voicing.AI's proprietary technology brings human-like voice capability across more than 20 languages with conversational, contextual, and emotional intelligence, in what is typically referred to as 'agentic AI'.\n\nLTIMindtree aims to reshape the future of Business Processes by leveraging AI-led platforms. This will enable their clients to optimize costs, reduce risk, enhance user experience, address revenue leakages, and enhance upsell opportunities. LTIMindtree will help clients integrate Voicing.AI with their custom tools, knowledge bases - both structured or unstructured, CRM systems, and leading call management platforms and systems. This Agentic AI technology is fully compliant with SOC2, HIPAA, and multi-layered data ",
    "description2": "security protocols.\n\n\nYou can view the demo video here.\n\"Our investment with Voicing.AI aims to redefine how businesses interact with their customers through intelligent automation and AI,\" said Debashis Chatterjee, CEO and Managing Director, LTIMindtree. \"This partnership and investment not only underscore our commitment to innovation but also ensures that LTIMindtree is an early mover in capitalizing on the disruption expected across platform operations.\"\n\"Voicing.AI is fundamentally disrupting the massive customer engagement market by powering new revenue growth, personalizing customer connections, and fostering a human dialogue between a business and its customers. LTIMindtree presented us with a deeply focused comprehensive vision for this Responsible AI transformation and we are excited to partner with them,\" said Abhi Kumar, Co-Founder - Voicing.AI. \"We look forward to working with LTIMindtree's global clients to fulfill the growing demand as more enterprises look to automate their platform operations.\"\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by BusinessWire India. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204053052.jpg",
    "date": "Invalid Date",
    "time": "Updated 3:49:47 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "Quantum AMC launches the Quantum Ethical Fund NFO (New Fund Offer) opens for subscription till December 16",
    "link": "https://worldsnews24.vercel.app/business/quantum-amc-launches-the-quantum-ethical-fund-nfo-new-fund-offer-opens-for-subscription-till-december-16",
    "siteurl": "https://worldsnews24.vercel.app/business/quantum-amc-launches-the-quantum-ethical-fund-nfo-new-fund-offer-opens-for-subscription-till-december-16",
    "description": "Quantum AMC launches the Quantum Ethical Fund NFO (New Fund Offer) opens for subscription till December 16",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204052452.jpg",
    "description1": "\n\n\nPRNewswire\nMumbai (Maharashtra) [India], December 4: Quantum AMC announced the launch of a new fund offer (NFO) with Quantum Ethical Fund. It closes on Monday, December 16, 2024. The Fund is an open-ended Equity Fund that invests in companies meeting an Ethical Set of Principles, with the objective of achieving long-term capital appreciation. The Fund will be managed by Chirag Mehta - Chief Investment Officer, Quantum AMC.\n\nIts investment objective is to achieve long-term capital appreciation by investing in Equity & Equity Related Instruments of companies following an Ethical Set of Principles.\nThe scheme will have a Direct and Regular Plan. The Fund Managers will allocate 80%-100% to the Equity & Equity related instruments of Companies following an Ethical set of Principles and 0%- 20% to the Debt & Money Market Instruments in compliance with Ethical Principles. The Scheme will follow an active investment strategy. The corpus of the scheme will invest in shares of companies meeting an Ethical set of Principles including of Shariah, Jainism and other ethical principles, encompassing a broad Ethical Framework.\nEthical investing allows investors to align their investments to their values, beliefs and ethical ideologies. There are many ideologies and there seems to be a large overlap between them alongside subtle differences. For e.g.: Shariah investing has unique approach in that financial transactions should be fair and equitable, financial rewards are correlated with the level of risk, efforts and responsibility and prohibits interest, excessive uncertainty / speculation, gambling and harmful businesses. Jainism also has a unique approach to economic development which is strongly centered on sincerity and integrity' around Ahimsa and Karma, which 'encourages a light footprint in life. To follow such principles while investing the fund will exclude sector and industry such as Alcohol, gambling, tobacco, vulgar entertainment, animation content provider, exhibition of films, media-broadcasting ,media-content, production and distribution of films, mainstream or conventional financial services, non-halal food and beverages, narcotics substance or anything largely harmful to society, Meat & Animal Products, Pharmaceutical involving Animal Testing, Weapon & Defense, & Betting.\nCommenting on the fund launch, Chirag Mehta, Chief Investment Officer & Fund Manager, Quantum AMC, said, \"The Quantum Ethical Fund will enable investors to align their investments to their beliefs, values and ",
    "description2": "ideologies. While encouraging ethical business practices, the robust integrity and financial checks will ensure investments reflect less risk and high quality which would drive long term performance. 'Responsibility and profitability are complementary traits' and thereby 'good ethics is good business'. The Quantum Ethical Fund will allow investors to generate wealth through equity investments with a clear conscience. By investing in this fund, thoughtful investors have an opportunity undertake investments aligned to their values.\"\nAdding to this, I. V. Subramaniam, MD & Group Head- Equities, Quantum Advisors - Sponsor to Quantum Mutual Fund, said, \"If you are an investor, for whom where a fund invests is as important as how much fund is invested, with this fund, you can be more intentional with your investments. Ethical investing is an investment approach in which investors invest in businesses that align with their religious or social values and generate financial returns. Sometimes, some businesses are involved in activities which are not good in terms of social values. As an individual investor it can be difficult to identify businesses that conduct their operations in accordance with the social values followed by the investor and at the same time remain profitable. That's where the Ethical Fund is a good fit.\"\n\n\nAbout Quantum AMC\nQuantum Mutual Fund was established in 2006 with the launch of its first fund. Quantum Mutual Fund nurtures a partnership culture with investors, business partners, and employees to spread the goodness of investing.\nQuantum Mutual Fund is committed to providing simple Investment Solutions with simplicity, transparency, and integrity.\n- Investment options to convert savings to wealth.\n- Simple products that are easy to understand.\n- Dependable standards of service.\n- Sensible, risk-adjusted returns over the long term through a disciplined research and investment process\nWe now offer 14 simple and easy-to-understand products for achieving different financial goals. Our tried and tested research-oriented process gives a channel to receive risk-adjusted returns that outperform the market in the long term. Quantum's continued relevance is a product of its reputation as trailblazer in the realm of mutual fund investing. With a solid track record and a commitment of providing progressive investment strategies.\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by PRNewswire. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204052452.jpg",
    "date": "Invalid Date",
    "time": "Updated 3:49:47 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "A New Era for Cuesports: WPA World Junior Heyball Championship 2024 Concludes in Bangalore",
    "link": "https://worldsnews24.vercel.app/business/a-new-era-for-cuesports-wpa-world-junior-heyball-championship-2024-concludes-in-bangalore",
    "siteurl": "https://worldsnews24.vercel.app/business/a-new-era-for-cuesports-wpa-world-junior-heyball-championship-2024-concludes-in-bangalore",
    "description": "A New Era for Cuesports: WPA World Junior Heyball Championship 2024 Concludes in Bangalore",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204045120.jpg",
    "description1": "\n\n\nPNN\nBangalore (Karnataka) [India], December 4: The world of cuesports witnessed a game-changing moment as the inaugural World Junior Heyball Championship 2024 lit up the Karnataka State Billiards Association (KSBA) in Bangalore. Bringing together the brightest young talents from across the globe, this electrifying event redefined standards for Heyball and positioned India as a rising hub for the sport.\n\nThe championship showcased the next generation of Heyball stars:\n- Under-19 Boys Champion: Maks Benko (Slovenia)\n- Under-19 Boys Runner-Up: Mykola Moroz (Ukraine)\n- Under-19 Girls Champion: Linnea Hjalmarstrom (Sweden)\n- Under-19 Girls Runner-Up: Shirin Volery (Switzerland)\nIndia's pride, Natasha Chethan from Bengaluru, claimed the bronze medal in the Under-19 Girls category. A protege of acclaimed coach Pranit J Ramchandani, Natasha's achievement has sparked hope for India's bright future in the global Heyball scene.\n\n\nAdding to the experience were world-class Joy billiards Heyball tables, celebrated for their precision and quality, providing a flawless playing surface. To further enhance the scene, advanced LED scoreboards and dynamic lighting for the fans.\nParticipants and their families from over 25 countries enjoyed premium hospitality, thanks to Shangri-La Bengaluru, the official hotel partner, ensuring the event's success beyond the arena.\nDriving Heyball's Growth in India, the championship was made possible by the vision and dedication of Pranit J Ramchandani",
    "description2": " and Upender Singh Thapa, co-founders of Luxebilliards Impex LLP. Established in 2024, the company exclusively distributes Joy Billiards Heyball tables in India and is committed to growing the sport nationwide.\n\"This championship is dreams come true. With the support of the WPA and BSFI, we've laid the foundation for Heyball in India. Next, we're excited to launch the National Heyball Championship in 2025 and an Asian Tour with prize money exceeding $50,000. This is just the beginning,\" said Pranit.\nUpender further added, \"As someone from Dehradun, I am passionate about introducing Heyball to players in North India and beyond. Our goal is to make the sport exciting, accessible, and a game-changer for young talent across the country.\"\nThis championship, officially sanctioned by the World Pool Association (WPA) and the Billiards and Snooker Federation of India, featured top-quality tables from Joy Billiards and is proudly supported by our main sponsors.\nPlayed in over 80 countries, Heyball is rapidly gaining global popularity, with aspirations to join the Olympics by 2032. The success of this championship solidifies India's role as a vital hub for the sport's growth.\nLooking ahead, Luxebilliards Impex LLP aims to establish world-class Heyball academies to nurture young talent, making India a powerhouse in international cuesports.\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by PNN. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204045120.jpg",
    "date": "Invalid Date",
    "time": "Updated 3:49:47 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "42Gears Launches SureAccess: Zero Trust Network Access Solution to Transform Enterprise Security",
    "link": "https://worldsnews24.vercel.app/business/42gears-launches-sureaccess-zero-trust-network-access-solution-to-transform-enterprise-security",
    "siteurl": "https://worldsnews24.vercel.app/business/42gears-launches-sureaccess-zero-trust-network-access-solution-to-transform-enterprise-security",
    "description": "42Gears Launches SureAccess: Zero Trust Network Access Solution to Transform Enterprise Security",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204045148.jpg",
    "description1": "\n\n\nPRNewswire\nBengaluru (Karnataka) [India], December 4:42Gears, a global leader in Enterprise Mobility Management, announced the launch of SureAccess, a cutting-edge Zero Trust Network Access (ZTNA) solution today. This innovative solution reinforces the company's commitment to enterprise security by ensuring that only authenticated users and verified devices can access corporate resources from anywhere, anytime.\n\n\"In today's hybrid work environment, traditional security perimeters are no longer enough,\" said Onkar Singh, Co-Founder & CEO of 42Gears. \"SureAccess represents our response to evolving security challenges, offering organizations a robust solution that verifies every access attempt, regardless of location or device.\"\nSureAccess (42Gears' ZTNA solution) is designed to protect organizations from unauthorized access, data breaches, and insider threats.\nKey Features of SureAccess:\n- Secure Protocol: SureAccess leverages Wireguard, a modern and secure protocol.\n- Split Tunnel: Enables selective internet routing through secure tunnels for specific DNS or IP addresses and bypasses the rest.\n- DNS-Based Access Policy: Streamlines secure access to corporate resources by managing which domains utilize the SureAccess tunnel.\n- Cloud Scalable: Scales automatically to handle device traffic surges.\n- Advanced Authentication: Deploy advanced authentication methods from IdPs like MFA and passwordless authentication.\n- Access Policy Manager (APM): Enables real-time, context-aware, and conditional access to enterprise resources.\n- Per App VPN: Routes specific applications through the SureAccess tunnel while excluding others.\n\n\nSureAccess offers the following benefits:\n- Continuous Verification: Ensures continuous verification for all users and devices attempting to",
    "description2": " access corporate resources.\n- Enhanced Security: SureAccess provides encrypted tunnel network access, safeguarding data transmission and blocking unauthorized users.\n- Granular Control: SureAccess only grants network access to authorized devices and apps that meet security requirements, enhancing breach protection.\n- Secure BYOD Access: SureAccess enforces security policies on personal devices accessing corporate resources through its built-in Zero Trust framework.\n- Data Breach Protection: Secure ZTNA tunneling protects all internet traffic, preventing data breaches and unauthorized network access.\n- Selective Routing: SureAccess ensures secure routing for critical services, protecting business functions without changing existing security policies\nThis new offering strengthens 42Gears' portfolio of enterprise mobility solutions, providing organizations with the tools they need to secure their digital assets in an increasingly complex threat landscape.\nAbout 42Gears\n42Gears is a leader in enterprise IT management, offering cutting-edge solutions that aim to transform the digital workplace. Delivered from the cloud and on-premise, 42Gears products support all major mobile and desktop operating systems, enabling IT and DevOps teams to improve frontline workforce productivity and the efficiency of software development teams. 42Gears products are used by over 23,000 customers across various industries in more than 170 countries, and are available for purchase through a global partner network.\nFor more information, visit https://www.42gears.com\nLogo: https://mma.prnewswire.com/media/2210925/4276263/42Gears1_Logo.jpg\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by PRNewswire. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204045148.jpg",
    "date": "Invalid Date",
    "time": "Updated 3:49:47 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "Kuwait's Foreign Minister Abdullah Ali Al-Yahya arrives in India for official visit",
    "link": "https://worldsnews24.vercel.app/business/kuwait-s-foreign-minister-abdullah-ali-al-yahya-arrives-in-india-for-official-visit",
    "siteurl": "https://worldsnews24.vercel.app/business/kuwait-s-foreign-minister-abdullah-ali-al-yahya-arrives-in-india-for-official-visit",
    "description": "Kuwait's Foreign Minister Abdullah Ali Al-Yahya arrives in India for official visit",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241203185324.jpg",
    "description1": "\n\n\nNew Delhi [India], December 4 (ANI): Kuwait Foreign Minister Abdullah Ali Al-Yahya has arrived in India for an official visit to the nation on Tuesday.\nFollowing his arrival, the Ministry of External Affairs (MEA) expressed a warm welcome to the Kuwait minister and stated this visit would further strengthen the multifaceted relationship between India and Kuwait.\n\n\"Further strengthening India-Kuwait multifaceted relations. Warm welcome to FM Abdullah Ali Al-Yahya MoFA Kuwait as he arrives in India on an official visit,\" the MEA said, taking to the social media platform X.\n\nFurther strengthening 🇮🇳-🇰🇼 multifaceted relations.\n\nWarm welcome to FM Abdullah Ali Al-Yahya @MoFAKuwait as he arrives in India on an official visit. pic.twitter.com/gWgi51QFKe\n\n— Randhir Jaiswal (@MEAIndia) December 3, 2024\n\n\nAccording to an official press release by the MEA, Abdullah Ali Al-Yahya will be here in India till Wednesday, December 4.\nHis visit will include high-profile meetings, starting with a call on Prime Minister Narendra Modi at the PM's residence on Wednesday. Later, he will meet with External Affairs Minister S Jaishankar at the Hyderabad House in the national capital.\nAl-Yahya will depart back to Kuwait on Wednesday night, the press release stated.\nIndia and Kuwait share a historically strong bilateral relationship that has stood the tes",
    "description2": "t of time. Rooted in centuries of trade and cultural exchange, the partnership predates Kuwait's independence in 1961, during which the Indian Rupee served as its legal tender.\nKuwait's economy, before the discovery of oil, thrived on maritime activities, including shipbuilding, pearl diving, and trading goods like Arabian horses, dates, and pearls with India in exchange for wood, spices, and textiles.\nThis legacy of cooperation was commemorated during the 60th anniversary of diplomatic relations between the two countries in 2021-22.\nThe Indian community, estimated to be one million strong, forms the largest expatriate group in Kuwait. Known for their diverse contributions, Indians hold roles across various fields, from engineering, medicine, and IT to business and trade.\nThe robust Indian business community in Kuwait, comprising retailers, distributors, and professionals, has played a pivotal role in strengthening economic ties.\nNotably, prominent Indian brands like Lulu Hypermarket and Centre Point have become integral to the Kuwaiti market.\nCultural and social engagement also thrives through over 200 Indian associations registered with the Indian Embassy in Kuwait. These groups actively organise programs to promote cultural exchange and community welfare, further solidifying the people-to-people connection between the nations. (ANI)",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241203185324.jpg",
    "date": "Invalid Date",
    "time": "Updated 3:49:47 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "India’s first Fast Track Immigration-Trusted Traveller Programme sees over 19,000 enrolments! Programme a replica of US global entry scheme",
    "link": "https://worldsnews24.vercel.app/business/india-s-first-fast-track-immigration-trusted-traveller-programme-sees-over-19-000-enrolments-programme-a-replica-of-us-global-entry-scheme",
    "siteurl": "https://worldsnews24.vercel.app/business/india-s-first-fast-track-immigration-trusted-traveller-programme-sees-over-19-000-enrolments-programme-a-replica-of-us-global-entry-scheme",
    "description": "India’s first Fast Track Immigration-Trusted Traveller Programme sees over 19,000 enrolments! Programme a replica of US global entry scheme",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892151/115892151.jpg",
    "description1": "India’s first Fast Track Immigration-Trusted Traveller Programme: Since June this year, more than 19,000 Indian and foreign nationals with Overseas Card of India (OCI) have registered for India's inaugural Fast Track Immigration-Trusted Traveller Programme (FTI-TTP). Officials confirmed that whilst initially available only at Delhi airport, the service has expanded to 31 international airports, including Mumbai, Chennai, Kolkata, Bengaluru, Hyderabad, Cochin and Ahmedabad.Officials indicated that whilst the programme mirrors the US global entry programme, it has been adapted for Indian requirements. This initiative followed the US's offer to include India in its trusted travellers programme. The US Global Entry offers precheck benefits and expedited US Customs and Border Protection screening for international travellers entering the US with valid documentation.Officials familiar with the development told ET that the Global Entry Programme (GEP), by the Ministry of Home Affairs (MHA), registered 1,491 individuals in August and 515 in September. They anticipate the total enrolments to exceed 20,000 by year-end. The programme mandates biometric submission for all applicants, without which enrolment is not possible.A seni",
    "description2": "or government official informed ET, \"For any one between 12 and 18 years, email id and mobile number of parents or guardians may be used for the purpose of FTI-TTP registration and those below 12 years or above 70 are not eligible for trusted travellers programme. The registration process usually takes a month with verification done by the field agencies.\"The programme has attracted frequent global travellers, OCI card holders, high net worth individuals, chief executive officers and businessmen. Officials report that the e-Gates have achieved 60-65% faster immigration clearance for passengers.According to the programme guidelines: \"Eligible individuals can apply online for the fast-track immigration facility. Those with approved applications are called to submit their biometrics (fingerprint and facial image) at the international airports in India or the Foreigners Regional Registration Offices.\" Registration validity extends to five years or until passport expiry, whichever occurs first.Another official explained, \"FTI-TTP aims to facilitate international mobility with faster, smoother, secure immigration clearance. In the initial phase, it has been started for Indian nationals and OCI cardholders on a gratis basis.\"",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892151/115892151.jpg",
    "date": "2/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-02T17:30:00+05:30",
    "dateModified": "2024-12-02T17:30:00+05:30"
  },
  {
    "title": "Top Fixed Deposit Rates: These bank FDs will earn you up to 9% return for 3-year deposits - check list",
    "link": "https://worldsnews24.vercel.app/business/top-fixed-deposit-rates-these-bank-fds-will-earn-you-up-to-9-return-for-3-year-deposits-check-list",
    "siteurl": "https://worldsnews24.vercel.app/business/top-fixed-deposit-rates-these-bank-fds-will-earn-you-up-to-9-return-for-3-year-deposits-check-list",
    "description": "Top Fixed Deposit Rates: These bank FDs will earn you up to 9% return for 3-year deposits - check list",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115692494/115692494.jpg",
    "description1": "Top Bank FD rates: Although interest rates have generally peaked, several banks continue to provide attractive fixed deposit rates for retail customers depositing less than Rs 3 crore. Senior citizens receive preferential rates, typically 0.25% to 0.50% higher than standard rates.Below are the banks offering competitive interest rates on three-year fixed deposits for individuals under 60 years, with deposits below Rs 3 crore. The list below, prepared by ET, is for small finance banks. It’s important to note that deposits in small finance banks come with DICGC insurance protection of up to Rs 5 lakh, yet financial experts recommend a prudent approach whilst investing in their fixed deposits. The distinctive operational structure of these banks means that their FD investments carry different risk factors compared to traditional scheduled commercial banks.To safeguard against possible uncertainties, investors would be well-advised to restrict their small finance bank FD investments within the DICGC insurance limit, says the ",
    "description2": "ET report. This strategy ensures comprehensive protection of both the invested capital and earned interest should any unexpected situations arise.Top FD Rates For 3 Year Fixed DepositsBank NameInterest RateNorthEast Small Finance Bank9%Suryoday Small Finance Bank8.60%Utkarsh Small Finance Bank8.50%Jana Small Finance Bank8.25%Unity Small Finance Bank8.15%Equitas Small Finance Bank8%Source: ET quoting Paisabazaar.com as of November 20,2024North East Small Finance Bank leads with a 9% interest rate on three-year FDs for general citizens.Suryoday Small Finance Bank provides an 8.6% interest rate for general citizens on three-year FD tenure.For three-year FD maturity, Utkarsh Small Finance Bank offers general citizens an 8.5% interest rate.Jana Small Finance Bank maintains an 8.25% interest rate for fixed deposits with a three-year tenure.Unity Small Finance Bank provides an 8.15% interest rate on their three-year fixed deposits.Equitas Small Finance Bank offers general citizens an 8% interest rate on three-year FD investments.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115692494/115692494.jpg",
    "date": "26/11/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-11-26T18:00:00+05:30",
    "dateModified": "2024-11-26T18:00:00+05:30"
  },
  {
    "title": "Special Vande Bharat trains for Kashmir! Indian Railways to introduce new Vande Bharat trains with ‘heating’ features - check details",
    "link": "https://worldsnews24.vercel.app/business/special-vande-bharat-trains-for-kashmir-indian-railways-to-introduce-new-vande-bharat-trains-with-heating-features-check-details",
    "siteurl": "https://worldsnews24.vercel.app/business/special-vande-bharat-trains-for-kashmir-indian-railways-to-introduce-new-vande-bharat-trains-with-heating-features-check-details",
    "description": "Special Vande Bharat trains for Kashmir! Indian Railways to introduce new Vande Bharat trains with ‘heating’ features - check details",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115721756/115721756.jpg",
    "description1": "Special Vande Bharat trains for Jammu & Kashmir! The Indian Railways has incorporated specialised heating features in Vande Bharat trains that will run in Jammu & Kashmir, according to officials.The Kashmir Valley's first direct train service is scheduled to commence this fiscal year, with specially designed Vande Bharat trains operating in areas experiencing sub-zero temperatures.Vande Bharat Express trains for J&K\"The existing design of chair car variant Vande Bharat rakes has been modified for the journey to Kashmir,\" a senior official requesting anonymity told ET. \"There will be specialised heating arrangement for plumbing and water tanks, embedded heating element for driver front look out glass and advanced safety features for Kashmir-bound Vande Bharat trains.\"The special Vande Bharat trains for J&K will feature an integrated heating element for the driver's front window. \"Driver cab front look-out glass has been specially developed with embedded heating elements. These elements will keep the glass defrosted in sub-zero temperatures,\" the official explained, noting this as a first for Indian Railways. 115721358The brake syst",
    "description2": "em's air dryer mechanism has been equipped with heaters for optimal performance.Officials revealed that the special Vande Bharat trains' water tanks are fitted with silicone heating pads (1800 W per water tank) to prevent freezing. \"Heating pads have been provided for bio retention tanks. There are also self-regulating heating cables for plumbing to avoid freezing of water,\" the official stated.The trains' water distribution system includes heating cables and thermal insulation throughout.Indian Railways maintains a standard temperature of 24 degrees Celsius in air-conditioned trains.The Udhampur-Srinagar-Baramulla Rail Link will establish railway connectivity between Kashmir and the mainland. Currently, rail travel extends only to Katra in Jammu. The Rs 37,012-crore project aims to eliminate the transport gap between Jammu and Srinagar.Railway connectivity already exists between Baramulla, Srinagar, Qazigund, Banihal and Sangaldan. Chenab bridge, which is the world’s highest, is ready. Several small tunnels linking to the Chenab Rail Bridge are nearing completion, with the entire route expected to be operational shortly.112962818",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115721756/115721756.jpg",
    "date": "27/11/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-11-27T11:58:00+05:30",
    "dateModified": "2024-11-27T11:58:00+05:30"
  },
  {
    "title": "PAN 2.0: Why you should apply for new PAN Card with QR code - top 5 benefits explained",
    "link": "https://worldsnews24.vercel.app/business/pan-2-0-why-you-should-apply-for-new-pan-card-with-qr-code-top-5-benefits-explained",
    "siteurl": "https://worldsnews24.vercel.app/business/pan-2-0-why-you-should-apply-for-new-pan-card-with-qr-code-top-5-benefits-explained",
    "description": "PAN 2.0: Why you should apply for new PAN Card with QR code - top 5 benefits explained",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115888519/115888519.jpg",
    "description1": "PAN 2.0: The Modi government has approved a new PAN 2.0 project and the first question that comes to the mind of taxpayers is, should they apply for the upgraded PAN Card under PAN 2.0? A free application option for a new PAN will be available for those needing to correct or update their details, such as name or date of birth. It’s important to note that the Income Tax Department has issued a statement confirming that current PAN cardholders need not mandatorily obtain a new PAN under the PAN 2.0 initiative. Should you replace old PAN with new PAN Card under PAN 2.0?Experts are of the view that individuals holding older white PAN cards or PAN cards without QR codes should obtain the newer version featuring a QR code. Experts believe that the updated PAN card design with PAN 2.0 will reduce fraud risks through its integrated QR code whilst enabling quick verification.What are the benefits of PAN Card with QR Code?Vikram Babbar, Partner, EY Forensic & Integrity Services - Financial Services told ET, \"Upgrading to the new PAN card design with a QR code is a proactive step for users to safeguard their identity and financial information. It helps reduce the likelihood of falling prey to fraudulent activities.\"Supporting this perspective, Ankit Ratan, CEO & Co-founder, Signzy - an online identity verification and customer onboarding company told ET, \"Under the PAN 2.0 initiative, the entire process of PAN application has been digitized. This enables provision of seamless PAN authentication and validation services to various organisations, including financial institutions, banks, and governmental bodies at both central and state levels.\"Also Read | PAN 2.0 FAQs answered! Will your PAN Card change, will it have a new number? Income Tax Department releases top 10 pointsAccording to Babbar, the QR code integration with PAN Card offers several advantages to taxpayers:Strengthened Security Features: The incorporation of QR code technology in the new PAN card significantly reduces vulnerability to duplication or alteration. The encrypted personal information within the QR code is accessible solely to authorised personnel with specific software. This security measure prevents fraudsters from modifying names and photographs whilst retaining the original PAN number. Financial institutions ",
    "description2": "can utilise the QR code to authenticate the printed information.Efficient Authentication Process: Identity verification becomes streamlined through the QR code scanning feature on the updated PAN card. The immediate verification process serves as protection against identity theft and impersonation. This functionality proves particularly valuable during financial transactions by reducing errors and fraudulent activities.Current Information Maintenance: The upgraded PAN card ensures user details conform to the Income Tax Department's latest formatting requirements.Regulatory Adherence: Users who obtain the redesigned PAN card align with the government's updated identification protocols, supporting a more secure financial system.Fraud Prevention: The technical complexity involved in accurately reproducing QR codes creates a significant barrier for fraudsters attempting to duplicate PAN cards.Ratan from Signzy, Ratan, explains that the new PAN card design incorporating a QR code represents a crucial advancement in fraud prevention and regulatory adherence. The QR code technology provides enhanced security and verification capabilities by storing encrypted information about the cardholder. The sophisticated encryption makes PAN card replication virtually impossible, as the QR code verification requires authorised software, confirming the card's authenticity and proper ownership, he says.A contrasting perspective comes from Sandeep Jhunjhunwala of Nangia Andersen LLP, who notes, \"Printed PAN cards carry QR code on them, now as well. Hence, while an upgrade to a new PAN card could be done anytime, it may not necessarily mean that under PAN 2.0 project, this would always protect the taxpayer against any potential fraud. The new system is expected to include features such as mandatory Aadhaar linkage, real-time validation and advanced data analytics, all of which could potentially help in identifying and preventing frauds. However, it remains unclear now as to how effectively these features would address the potential of fraud. As PAN 2.0 evolves, stakeholders could watch out for further updates from the authorities to understand how these features would be implemented and whether additional measures would be introduced to specifically tackle the menace of financial frauds.\"115804021",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115888519/115888519.jpg",
    "date": "2/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-02T11:46:00+05:30",
    "dateModified": "2024-12-02T11:46:00+05:30"
  },
  {
    "title": "Stock market today: BSE Sensex opens in green; Nifty50 above 24,450",
    "link": "https://worldsnews24.vercel.app/business/stock-market-today-bse-sensex-opens-in-green-nifty50-above-24-450",
    "siteurl": "https://worldsnews24.vercel.app/business/stock-market-today-bse-sensex-opens-in-green-nifty50-above-24-450",
    "description": "Stock market today: BSE Sensex opens in green; Nifty50 above 24,450",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115957244/115957244.jpg",
    "description1": "Stock market today: Indian equity benchmark indices, BSE Sensex and Nifty50, opened in green on Wednesday. While BSE Sensex was near the 81,000 mark, Nifty50 was above 24,450. At 9:23 AM, BSE Sensex was trading at 80,962.87, up 117 points or 0.14%. Nifty50 was at 24,492.30, up 35 points or 0.14%.Market experts anticipate further gains in the short term, supported by positive global indicators, expectations of increased government expenditure and accommodative RBI monetary policies.Bulls are likely to maintain control whilst the index remains above 24,400, potentially testing 24,600-24,700. Support lies at 24,4",
    "description2": "00, below which correction towards 24,150 is possible, according to an ET report.The S&P 500 and Nasdaq achieved record closings on Tuesday, driven by technology sector gains. The Dow showed marginal decline.Asian equities declined following South Korean President Yoon Suk Yeol's unexpected martial law announcement and subsequent reversal.The euro showed slight gains against the US dollar on Tuesday amidst French political uncertainty.FPIs were net buyers at Rs 3,664 crore on Monday, while DIIs sold shares worth Rs 251 crore.FII net short position decreased from Rs 1.24 lakh crore to Rs 97,387 crore on Tuesday.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115957244/115957244.jpg",
    "date": "4/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-04T09:27:00+05:30",
    "dateModified": "2024-12-04T09:27:00+05:30"
  },
  {
    "title": "Aadhaar card update: Deadline to update your Aadhaar details for free is approaching - here’s what you need to know",
    "link": "https://worldsnews24.vercel.app/business/aadhaar-card-update-deadline-to-update-your-aadhaar-details-for-free-is-approaching-here-s-what-you-need-to-know",
    "siteurl": "https://worldsnews24.vercel.app/business/aadhaar-card-update-deadline-to-update-your-aadhaar-details-for-free-is-approaching-here-s-what-you-need-to-know",
    "description": "Aadhaar card update: Deadline to update your Aadhaar details for free is approaching - here’s what you need to know",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115657021/115657021.jpg",
    "description1": "The deadline for updating the Aadhaar card for free is approaching, with less than three weeks left until December 14, 2024. The Unique Identification Authority of India (UIDAI) has been urging citizens to update their Aadhaar information for a long time, especially those who received their cards more than 10 years back. It’s important to note that the updation process is not mandatory.What is Aadhaar?Aadhaar, issued by the UIDAI, proves to be an effective tool in preventing fake or ghost identities by assigning a unique identification number to every resident. Additionally, it cannot be duplicated because it is linked to an individual’s biometric data.While updates are not mandatory, they contribute to smoother living, improved service delivery, and ensure accurate authentication.Why update Aadhaar card?Aadhaar is an important identification document for every Indian citizen owing to its reliability, legal compliance and ease of access.It should be updated in case of relocation to a new place and changing of address, or the information in the current Aadhaar card is inaccurate. It can be easily achieved with the help of a valid address proof or by using the Address Validation Letter (for those without valid address proof).Cost of updating AadhaarAadhaar update is free of cost till 14 December 2024, however, after the deadline, documents submission at an Aadhaar center, will cost Rs. 50 for any update.How to update AadhaarFirstly, visit the myAadhaar portal and click on the ‘Login’ button.Enter the Aadhaar number, captcha code and then proceed to click the ‘send OTP’ button. Once the OTP is entered click on the ‘login’ button and then on the ‘document update’ button.Read the guidelines and click",
    "description2": " the ‘next’ button. Check the detail verification box and click ‘next.’Upload personal identification documents like ‘proof of identity’ and ‘proof of address’ Click ‘submit’, after which a ‘service request number (SRN)’ would be sent to your email to track the document update status.Aadhaar regulationsA PIB release from 2022 stated that the residents who had got their Aadhaar issued a decade back and have never updated since, such Aadhaar number holders are encouraged to get their documents updated.UIDAI had previously issued a press release urging residents to keep their documents up to date. The recently issued gazette notification further clarifies that residents \"may\" update their details every 10 years.“Keeping the documents in Aadhaar updated helps in ease of living, better service delivery, and enables accurate authentication. UIDAI has always encouraged residents to keep their documents updated, and the gazette notification is another step in that direction.”According to the Aadhaar enrolment and update regulations, 2016, “An Aadhaar number holder may, on completion of every period of 10 years from the date of generation of the Aadhaar number assigned to him, update the documents or the information evidencing proof of identity and proof of address, at least once, by submitting an application.”On the social media platform X, UIDAI revealed that it will be availing a facility to update Aadhaar cards for free till 14 December 20, 2024.\"UIDAI extends free online document upload facility till 14th December 2024; to benefit millions of Aadhaar Number Holders. This free service is available only on myAadhaar portal. UIDAI has been encouraging people to keep documents updated in their Aadhaar.\"",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115657021/115657021.jpg",
    "date": "25/11/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-11-25T17:30:00+05:30",
    "dateModified": "2024-11-25T17:30:00+05:30"
  },
  {
    "title": "IndiGo takes Mahindra to court over use of '6e' name",
    "link": "https://worldsnews24.vercel.app/business/indigo-takes-mahindra-to-court-over-use-of-6e-name",
    "siteurl": "https://worldsnews24.vercel.app/business/indigo-takes-mahindra-to-court-over-use-of-6e-name",
    "description": "IndiGo takes Mahindra to court over use of '6e' name",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115953863/115953863.jpg",
    "description1": "NEW DELHI: IndiGo has filed a trademark infringement suit against Mahindra Electric Automobile, objecting to the latter naming its upcoming EV as BE 6e as \"6E\" is the airline's flight code. Mahindra launched the electric car on Nov 26, with company officials insisting then there is no copyright infringement with use of 6e.Indigo went to the court within days. Titled Interglobe Aviation (IndiGo parent) vs Mahindra Electric Automobile, the case was on Tuesday listed to be heard in the court of Justice Amit Bansal. However, the judge recused himself from hearing the matter. The next hearing is scheduled for Dec 9. Appearing for IndiGo, senior advocate Sandeep Sethi informed the court that Mahindra had initiated discussions with the airline to address the issue.In a statement, IndiGo said: \"6E mark is an integral part of IndiGo's identity for the past 18 years and is a registered trademark that holds strong global recognition. The 6E mark, whether standalone or in its variants and formative forms, is extensively used by IndiGo for its offerings and for goods and services provided in collaboration with trusted partners.\"The airline further said, \"Any unauth",
    "description2": "orised use of the '6E' mark, whether standalone or in any form, constitutes an infringement of IndiGo's rights, reputation and goodwill. IndiGo is committed to taking all necessary and appropriate steps to safeguard its intellectual property and brand identity.\"Mahindra said it revealed EV SUVs - the BE 6e and XEV 9e - late last month. \"Mahindra has applied for trade mark registration under class 12 (vehicles) for 'BE 6e' a part of its electric origin SUV portfolio. We hence don't see a conflict as Mahindra's mark is 'BE 6e,' not the standalone '6E.' It differs fundamentally from IndiGo's '6E,' which represents an airline, eliminating any risk of confusion...\" The distinct styling further emphasises their uniqueness. We have taken on board the concerns that InterGlobe Aviation Limited have to infringement of their goodwill, which was not our intention. We are engaged in discussions with them to find an amicable solution.\"This is the second time IndiGo is locked in a legal battle with some other company using a name associated with it. In 2015, the airline had a trademark dispute with Tata Motors which then used to sell its sedan under the name IndiGo. ",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115953863/115953863.jpg",
    "date": "4/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-04T07:25:00+05:30",
    "dateModified": "2024-12-04T07:25:00+05:30"
  },
  {
    "title": "Musk's record Tesla pay plan rejected again",
    "link": "https://worldsnews24.vercel.app/business/musk-s-record-tesla-pay-plan-rejected-again",
    "siteurl": "https://worldsnews24.vercel.app/business/musk-s-record-tesla-pay-plan-rejected-again",
    "description": "Musk's record Tesla pay plan rejected again",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115953730/115953730.jpg",
    "description1": "Elon Musk's record-setting Tesla pay package was again rejected by a Delaware judge even after shareholders supported reinstating it.Despite the June 13 shareholder vote at the company's annual meeting, Delaware Chancery court judge Kathaleen McCormick decided to stick with her original finding in Jan that the company's board was too much under the influence of the billionaire entrepreneur when it adopted the plan in 2018. The stock options package was initially worth $2.6 billion and spiked to $56 billion by the time the judge cancelled it. The package was worth $101.5 billion at Monday's closing price.McCormick's ruling striking down the highest-ever pay arrangement for a US corporate executive could take a giant bite out of Musk's wealth. Even without the payout, he remains the world's richest person. Tesla shares fell 1.4% in after-hours trading.The ruling comes just after Musk's wealth hit an all-time high - surpassing the previous record of $340.4 billion set in Nov 2021 - thanks to a Tesla stock rally following the presidential election and a new funding round for his artificial intelligence startup.Musk, 53, spent much of Oct campaigning for Donald Trump, including speaking at a Madison Square Gar",
    "description2": "den rally in New York City about a week before the election. The president-elect has tapped Musk to co-lead a cost-cutting effort that the new administration is calling \"DOGE,\" or the \"Department of Government Efficiency.\" Tesla and its board, which includes Musk, didn't immediately respond to a request for comment.115953724In Monday's ruling, McCormick awarded $345 million to the lawyers who fought Musk and Tesla to kill the pay plan.While that amount was far less than the attorneys' request to be compensated with 29 million Tesla shares - more than $10 billion at the company's current share price - it's still among the largest lawyer paydays in the history of US litigation.\"We hope that the chancellor's well-reasoned decision will end this matter for the shareholders of Tesla,\" said lawyers at the firm of Bernstein Litowitz Berger & Grossmann.Musk now has 30 days to decide whether to appeal McCormick's ruling under Delaware law. Unlike the US Supreme Court, the state's highest court reviews all appeals of lower-court rulings. The billionaire is expected to contest McCormick's finding that Tesla directors awarded him excessive compensation because they were handcuffed by conflicts of interest Bloomberg. ",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115953730/115953730.jpg",
    "date": "4/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-04T07:08:00+05:30",
    "dateModified": "2024-12-04T07:08:00+05:30"
  },
  {
    "title": "SECI lifts ban on R-Power from bidding for projects",
    "link": "https://worldsnews24.vercel.app/business/seci-lifts-ban-on-r-power-from-bidding-for-projects",
    "siteurl": "https://worldsnews24.vercel.app/business/seci-lifts-ban-on-r-power-from-bidding-for-projects",
    "description": "SECI lifts ban on R-Power from bidding for projects",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115953959/115953959.jpg",
    "description1": "NEW DELHI: State-run renewable project aggregator SECI on Tuesday withdrew its order banning Anil Ambani-led Reliance Power (R-Power) for three years from bidding for projects.SECI had imposed the ban on grounds of its group entity, Reliance NU BESS, submitting allegedly invalid bank guarantee in one of its recent tenders. The ban was imposed without seeking R-Power's response to the allegation, an argument the company had put forth while challenging the ban in the Delhi high court.\"The company (R-Power) and its subsidiaries (except Reliance NU BESS) are eligible to participate in all tenders issued by SECI,\" the parent said in a statement.R-Power had invoked the principle of natural justice and arguments that the parent company or other gr",
    "description2": "oup entities cannot be debarred because of an \"issue\" arising between the bidder subsidiary - Reliance NU BESS - and SECI. R-Power further argued that SECI did not issue notice for the company's response before imposing the ban.Staying the SECI ban imposed on Nov 6, the court also ordered removal of the public notice, except regarding Reliance NU BESS, from the SECI website and set the next hearing for Dec 12.The bank guarantee in question was purportedly issued by the FirstRand Bank through its branch supposed to be located in Manila City (Philippines). But during SECI's due diligence, however, the bank's Indian branch denied existence of any branch in Manila City, prompting the agency to conclude the company had submitted \"fake documents\".",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115953959/115953959.jpg",
    "date": "4/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-04T07:33:00+05:30",
    "dateModified": "2024-12-04T07:33:00+05:30"
  },
  {
    "title": "Swiggy eyes operational profitability by December 2025",
    "link": "https://worldsnews24.vercel.app/business/swiggy-eyes-operational-profitability-by-december-2025",
    "siteurl": "https://worldsnews24.vercel.app/business/swiggy-eyes-operational-profitability-by-december-2025",
    "description": "Swiggy eyes operational profitability by December 2025",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115953912/115953912.jpg",
    "description1": "MUMBAI: Swiggy is eyeing operational profitability by Dec 2025, the company said in its first earnings after its public debut in Nov. The company's net losses narrowed to Rs 625.5 crore on a consolidated basis in the Sept quarter from Rs 657 crore in the year-ago period. Revenue from operations increased by 30% year-on-year to Rs 3,601.4 crore. In a letter to shareholders, the firm said that at the consolidated group level, it expects to achieve positive adjusted ebitda by Q3 FY26. Swiggy's rival Zomato, with which it competes in both the food delivery and quick commerce markets, is profitable. \"Our food delivery business turned profitable last year, and continues to ramp-up... quick commerce is in the investment phase, amidst rapid expansion of its addressable market and substantial competitive intensity in the near-",
    "description2": "term,\" the company said.The gross order value of Swiggy's food delivery business grew by 15% year-on-year to Rs 7,191 crore. The firm's recently-launched 10-minute food delivery service Bolt already accounts for 5% of its total food delivery orders. Swiggy will build more consumption occasions and use-cases for consumers to fuel the growth of its food delivery business which had 14.7 million average monthly transacting users as of Q2. For its quick commerce business Instamart - which competes with players like Zomato's Blinkit, Zepto and BigBasket - the growth strategy will be to launch in new cities as well as deepen the footprint in existing markets. Plans are afoot to more than double its active dark store area to 4 million square feet by March 2025 through a mix of new dark store additions and larger sized stores.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115953912/115953912.jpg",
    "date": "4/12/2024",
    "time": "Updated 3:49:47 pm",
    "courtesy": "Times Of India",
    "datePublished": "2024-12-04T07:31:00+05:30",
    "dateModified": "2024-12-04T07:31:00+05:30"
  },
  {
    "title": "Sensex, Nifty decline in early trade amid disappointing macroeconomic data",
    "link": "https://worldsnews24.vercel.app/business/sensex-nifty-decline-in-early-trade-amid-disappointing-macroeconomic-data",
    "siteurl": "https://worldsnews24.vercel.app/business/sensex-nifty-decline-in-early-trade-amid-disappointing-macroeconomic-data",
    "description": "Global oil benchmark Brent crude climbed 0.56 percent to USD 72.24 a barrel.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Untitled-design-3.png",
    "description1": "Benchmark indices Sensex and Nifty declined in early trade on Monday amid disappointing macroeconomic data and weak trends in frontline stocks, including Reliance Industries, HDFC Bank, and Tata Consultancy Services. Foreign fund outflows also dented market sentiment. The BSE benchmark Sensex tanked 493.84 points to 79,308.95 in early trade. The NSE Nifty declined 122.45 points to 24,008.65. From the 30-share Sensex pack, IndusInd Bank, HDFC Bank, Larsen &amp; Toubro, Tata Consultancy Services, Reliance Industries, Bajaj Finance, NTPC, and Hindustan Unilever were the biggest laggards. Maruti, UltraTech Cement, Adani Ports, and Tata Motors were among the gainers. India's economic growth slowed to a near two-year low of 5.4 percent in the July-September quarter of this fiscal due to poor perform",
    "description2": "ance of manufacturing and mining sectors as well as weak consumption, but the country continued to remain the fastest-growing large economy, data showed on Friday. \"The Q2 GDP shocker of 5.4 percent will weigh on markets but the impact is unlikely to be big since part of the declining growth was factored in by the market after the disappointing Q2 results,\" V K Vijayakumar, Chief Investment Strategist, Geojit Financial Services, said. In Asian markets, Seoul traded lower while Tokyo, Shanghai, and Hong Kong quoted higher. US markets ended in positive territory on Friday. Global oil benchmark Brent crude climbed 0.56 percent to USD 72.24 a barrel. The BSE benchmark jumped 759.05 points or 0.96 percent to settle at 79,802.79 on Friday. The Nifty climbed 216.95 points or 0.91 percent to 24,131.10.",
    "image": "https://images.indianexpress.com/2024/12/Untitled-design-3.png",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 12:18:24 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T10:45:40+05:30",
    "dateModified": "2024-12-02T10:45:40+05:30"
  },
  {
    "title": "Amid slowdown, RBI-Govt gulf widens, growth to holding rates",
    "link": "https://worldsnews24.vercel.app/business/amid-slowdown-rbi-govt-gulf-widens-growth-to-holding-rates",
    "siteurl": "https://worldsnews24.vercel.app/business/amid-slowdown-rbi-govt-gulf-widens-growth-to-holding-rates",
    "description": "The RBI, on its part, has been constantly flagging the risk from continued high rate of inflation.",
    "thumbnail": "https://images.indianexpress.com/2024/12/das.jpg",
    "description1": "Much before data released on November 29 showed that India’s economic growth had slumped to a seven-quarter low of 5.4 per cent in July-September, discussions within the government had questioned RBI’s upward revision of growth estimates to 7.2 per cent for 2024-25 and flagged worries about the cumulative impact of its prudential measures, The Indian Express has learnt. There were apprehensions that these had begun hurting India’s growth prospects and the RBI’s decision to keep policy rates static because of food and gold/silver inflation, has made the effective real rate of interest for the non-food part of the economy very high now, top officials said. The RBI would not agree with this assessment, said some analysts and experts tracking the central bank’s regulatory and monetary policy actions. They said housing loans are at 8.5 per cent, MSME loans are at 10-11 per cent, and if you net out inflation at 6 per cent, then the rates are not so high. A government official said, the first red flag came when RBI raised the GDP growth forecast for 2024-25 to 7.2 per cent in June from 7 per cent in April since it was out of sync with other signals. “At this point, incremental information – very hot summer, monsoon getting delayed – was negative,” the official said. This move by the RBI surprised many in the government. While there were expectations that the central bank would become more cautious, it became more confident about the growth number. On top of this, the RBI also kept its key policy rate unchanged at 6.5 per cent since February 2023, which had by the beginning of the second quarter resulted in high lending rates for non-agricultural sectors. But analysts tracking the central bank said the upward growth revision came in the backdrop of a very strong momentum from Q3 and Q4 in 2023-24. “Growth slowed in the first quarter this year because of low capex in the Centre and states, and there is a blip in Q2 mainly because of excess rains in August and September when construction activity was disrupted, and mining and electricity also slowed down,” one such analyst said. All eyes are now on RBI’s monetary review meeting December 4-6 – with Governor Shaktikanta Das’s term expected to end December 10. Government officials said the central bank’s many credit actions and macro-prudential measures such as higher risk weights on unsecured personal loans, a discussion paper on higher provisioning for project loans, and steps for digital lending were seen to be all well-intended and individually correct at the respective points of time. “But their cumulative impact was denting growth prospects,” the official said. The government thinks these measures were important, singed as it is from what it feels were the “mistakes” in the past that led to the cropping up of doubtful and bad loans. But the government couldn’t still come to terms with what it feels is RBI’s misplaced alarm over high credit-deposit ratio, which eventually has led to a sharp moderation in credit growth. The credit growth rate dropped to around 11 per cent from over 16 per cent in January this year. “Their (RBI’s) insistence on bringing down the credit-deposit ratio – if you bring down credit growth, you bring down deposit growth. You ask any banker, you give credit, and then it creates deposits. But if you crimp credit growth, you’re going to crimp deposit growth as well,” the official explained. The RBI’s financial stability report, published in June 2024, says the credit-deposit ratio meanders for 41 months before it comes back, the official pointed out. “So, it is not as if the episode of the credit-deposit ratio growing above the trend is happening for the first time. It comes down over time, with the credit growth slowing down. Collectively, they may have exerted an influence,” the official said. Analysts tracking the banking regulator attributed the prudential actions to credit exuberance – credit card outstanding was growing at 30 per cent, unsecured loans at 30 per cent, and NBFCs were diluting credit appraisal norms ",
    "description2": "and underwriting standards. Credit was being pushed irrespective of demand, and the RBI saw clear signs of a future crisis. The RBI actions in November slowed down credit growth in those segments, and this was the desired objective, they said. When a bubble bursts, then all questions are asked to the regulator, the analysts said. As the RBI maintained its guard against the high rate of inflation over the year, concerns also emerged within the government on whether the monetary policy stance is becoming too tight. It was felt the central bank was focusing a lot on food inflation, which is not completely in its control, and has been rising primarily due to price shocks in just a few items such as tomato, onion, potato among other perishables. The RBI’s action against inflation, especially as a supply-side driven issue in the aftermath of the Covid-19 pandemic, was seen as ideal but the grip does not seem to have been loosened on time as per government officials. “By reacting to food inflation, where they have no control, where there are no second-round effects, and even core inflation is more influenced by gold and silver rather than overall, it is very clear that your effective real rate of interest for the non-food part of the economy is very high now. So effectively, there is a restrictive monetary policy,” the official said. Retail inflation rate surged to a 14-month high of 6.21 per cent in October with a sharp rise in prices of food items, especially fruits, vegetables, meat and fish, and oils and fats. Food inflation shot up to a double-digit level of 10.87 per cent in October — a 15-month high — from 9.24 per cent in September, and 6.61 per cent in the year-ago period. Food and beverages account for 45.86 per cent of the total weight of the Consumer Price Index (CPI), on which retail inflation is based. Barring two months of July and August this year, the headline retail inflation rate has remained above the 4 per cent mark in the 4+/- 2 per cent band of RBI’s medium-term inflation target for 59 months. The RBI, on its part, has been constantly flagging the risk from continued high rate of inflation. In the October Monetary Policy Committee (MPC) meeting, RBI Governor Shaktikanta Das had said the RBI cannot risk ‘another bout of inflation’ and so there is a need to wait for more evidence of inflation aligning durably with the 4 per cent target. If bank interest rates are low when inflation is high, it would mean a further credit exuberance, and lead to dilution of the quality of balance sheet of banks, said analysts explaining RBI action. The RBI Act, analysts pointed out, mandates price stability, and is defined in terms of headline inflation i.e., 4 per cent +/- 2 per cent. Whether it is food that causes inflation to rise, or some other constituent, at the end of the day, the mandate is to ensure it does not breach the upper end of the band, i.e., 6 per cent, they said. “In developed countries, when you have inflation targeting, you are effectively targeting labour income. Central banks react when wages start rising. In a developing country, given food is a larger component, the moment you start reacting to food, you are reacting to farmers’ terms of trade. Effectively, it is not a technocratic decision; it is a political economy decision,” the government official said. The sole focus on inflation targeting has come under question after the recent growth fallout in Q2, bringing the spotlight on the inflation versus growth debate and whether the country is facing a cyclical slowdown and is in need of anti-cyclical policy measures. “If there is a second-round effect, you must react. If it becomes generalised, you must react. My point is that the core inflation (non-food, non-fuel inflation) has suddenly gone up in the last three months from 3.2 per cent to 4.2 per cent…you take out gold and silver, core inflation is tame. So, you cannot say that food inflation is passing the second round of the passthrough effect on gold and silver. That’s a bit far-fetched,” the official said.",
    "image": "https://images.indianexpress.com/2024/12/das.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 12:18:24 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T04:20:05+05:30",
    "dateModified": "2024-12-02T04:20:05+05:30"
  },
  {
    "title": "Kharif procurement: Govt departments call for reforms beyond MSP hike to tackle agri concerns",
    "link": "https://worldsnews24.vercel.app/business/kharif-procurement-govt-departments-call-for-reforms-beyond-msp-hike-to-tackle-agri-concerns",
    "siteurl": "https://worldsnews24.vercel.app/business/kharif-procurement-govt-departments-call-for-reforms-beyond-msp-hike-to-tackle-agri-concerns",
    "description": "While the departments did not directly oppose the hike in the MSP, the documents show, they gave varying suggestions to look beyond the MSP to provide remunerative prices to the farmers.",
    "thumbnail": "https://images.indianexpress.com/2024/12/farmer_c5dcc8.jpg",
    "description1": "From seeking implementation of non-price recommendations, a five-year plan for oilseeds to supply-side bottlenecks in procurement, two key financial departments, a top government think tank and a department responsible for most of the procurement in the country wrote to the Ministry of Agriculture and Farmers Welfare, expressing concerns before the Cabinet meeting this June to clear the proposal to hike the minimum support price (MSP) of kharif crops for marketing season 2024-25, an RTI filed by The Indian Express shows. While the departments did not directly oppose the hike in the MSP, the documents show, they gave varying suggestions to look beyond the MSP to provide remunerative prices to the farmers. The Ministry of Agriculture did not agree to the suggestion on oilseeds, but it took note of the situation and proposed a maximum hike for oilseeds. The procurement of kharif crops commenced on October 1 in line with the Cabinet decision dated June 19 which increased the MSP of 14 kharif crops such as paddy, jowar, bajra, ragi, maize, tur/arhar, moong, urad, groundnut, sunflower seed, soyabean, sesamum, nigerseed and cotton. The maximum increase over the previous year was 12.70 per cent for nigerseed in oilseeds, 11.50 per cent for ragi in cereals and 7.90 per cent for tur in pulses. Look beyond MSP hike The documents accessed by The Indian Express show that the two financial departments i.e the Department of Economic Affairs (DEA) &amp; Department of Expenditure (DOE) and Niti Aayog primarily focused on non-price recommendations of the Commission for Agricultural Costs and Prices (CACP), an Agriculture Ministry body which recommends MSP hike every season, and apparently opined that the government should focus on the schemes other than MSP. It also raised concerns over supply-side bottlenecks in procurement. Non-price policy recommendations aim to achieve a long-term and multi-dimensional solution to the agrarian crisis. As part of Inter-Ministerial consultation on MSP hike, DEA and DOE wrote that special schemes that are focussed on productivity enhancement, push towards atmanirbharta in pulses and oilseeds, crop diversification, micro-irrigation, empower farmers with solar power etc., which comes under non-price recommendations, are supported “in-principle”. However, these special schemes may be routed through the appraisal mechanism of Expenditure Finance Committee (EFC) on financial outlays, said the departments. “While supporting the recommendations, this ministry feels that the price increase in crops should be accompanied by implementation of key non-price recommendations also … Supply- side bottlenecks such as storage, warehouse infrastructure and transportation need to be addressed in mission mode,” reads the letter of the departments dated May 16, 2024. In response before the Cabinet on this, the Ministry of Agriculture said that issues related to non-price recommendations will be dealt with separately by the department concerned. Niti Aayog also stressed on non-price recommendation and said that Shree Anna (promotion for production and consumption of nutri-cereals/millets), push towards pulses and oilseed should be given due priority and close monitoring by the department. “The price policy should be able to maintain inter-crop price parity and ensure rational utilisation of inputs and natural resources. It should enhance diversification to meet the growing food and nutritional security,” reads Niti Aayog’s letter dated May 3, 2024. In response to this, the Ministry of Agriculture said, “…to encourage crop diversification towards oilseeds and pulses, the highest absolute increase in MSP over the previous year is proposed for these crops viz. Nigerseed by Rs 983 per qtl., sesamum by Rs 632 per qtl., tur by Rs 550 per qtl., sunflower seed by Rs 420 per qtl. And that of urad by Rs 450 per qtl.” Low product",
    "description2": "ion of Oilseeds While the maximum increase in MSP was proposed for oilseeds, the Department of Food &amp; Public Distribution (DoFPD), which procures paddy, wheat and coarse grains, said that the hike has not resulted in required increase in domestic production and country needs a long-term MSP policy for oilseeds. It further said that even though an increase in production of oilseeds is estimated for 2023-24, the country will have to rely on imports to meet its requirement for edible oils. “CACP fixes the MSP on oilseeds on a seasonal basis. Although it helps in ensuring a remunerative price to the farmers, it has not delivered the required result by means of increase in domestic production. It may be helpful if a long term MSP policy, preferably for the next 5 years, is in place so that farmers know what they will get in future for their crops and may accordingly take an informed decision,” said the department in its letter dated May 24, 2024. However, the Ministry of Agriculture rejected the suggestion and said that long-term MSP policy was not viable. “While recommending MSP, CACP considers estimated cost of production, ongoing demand and supply situation and inter-crop parity in returns, terms of trade between agriculture and non-agriculture sector, rational utilization of land, water and other production resources. Therefore, long term MSP policy is not viable,” said the Agriculture Ministry in its response before the Cabinet. Oilseeds are primarily used for oil, food, feed and industrial applications. However, despite domestic production, approximately 60 per cent of India’s edible oil demand, is fulfilled through imports. Need better infra and technology Along with DOE, DEA and Niti Aayog, DoFPD also sought implementation of other Non-price recommendations and said that warehouses/storage infrastructure constructed under any government scheme/Agriculture infrastructure should mandatorily be WDRA (Warehousing Development and Regulatory Authority) registered. “It will help to ensure e-NWR (Electronic Negotiable Warehouse Receipt) based pledge finance. The warehouse/storage infrastructure may be declared/notified as deemed sub-market yards under state APMC act so that the logistics cost incurred on procurement can be reduced and agri commodities can be procured at a less logistic cost,” reads the letter. Similarly, the DEA and DOE said that technology upgradation in cultivation, R&amp;D and mechanisation of farming needs to be focused upon to improve agricultural productivity. \"Improvement in marketing platforms for small and marginal farmers by promoting and strengthening FPOs (Farmer Produce Organizations), cooperatives and self-help groups (SHGs) needs priority,\" reads the letter further. In response to these, the Ministry of Agriculture said that it is implementing Agri Infra Fund (AIF) to address the existing infrastructure gaps and mobilise investment in agricultural infrastructure. It further said that the Sub-Mission in Agricultural Mechanization (SMAM) is being implemented for creating high-tech farm equipment. Regarding marketing platforms, the ministry said that it is implementing the Marketing Research and Information Network, a sub-scheme of Integrated Scheme for Agricultural Marketing (ISAM), to link important agricultural produce markets spread all over the country. The Ministry has estimated to procure around 828 lakh metric tonnes (LMT) of 14 agricultural produce this kharif season, out of which expected procurement of Paddy alone is 806 LMT. However, the fact is that the procurement of Rice, which recorded a continuous increase from 31.8 million tonnes in 2013-14 to 60.2 million tonnes in 2020-21, witnessed a decline during the last three seasons. The increase in MSP for paddy this season is 5.40 per cent (Rs. 117 per quintal) as the cost of production went up by 5.4 per cent over last year.",
    "image": "https://images.indianexpress.com/2024/12/farmer_c5dcc8.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 12:18:24 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T04:30:29+05:30",
    "dateModified": "2024-12-02T04:30:29+05:30"
  },
  {
    "title": "RBI Policy: Why MPC is likely to keep the repo rate unchanged in December meeting?",
    "link": "https://worldsnews24.vercel.app/business/rbi-policy-why-mpc-is-likely-to-keep-the-repo-rate-unchanged-in-december-meeting",
    "siteurl": "https://worldsnews24.vercel.app/business/rbi-policy-why-mpc-is-likely-to-keep-the-repo-rate-unchanged-in-december-meeting",
    "description": "The six-member MPC may also retain the monetary policy stance as ‘neutral’ in the upcoming policy, economists said. The MPC’s decision is expected to be announced on December 6.",
    "thumbnail": "https://images.indianexpress.com/2024/11/RBI_84780d.jpg",
    "description1": "The Reserve Bank of India (RBI) Monetary Policy Committee (MPC), which is scheduled to meet from December 4 to 6, is likely to keep the repo rate – the key policy rate – unchanged at 6.5 per cent in the meeting. This would be the 11th consecutive monetary policy, or for 22 months, that the repo rate would have been left unchanged. The six-member MPC may also retain the monetary policy stance as ‘neutral’ in the upcoming policy, economists said. The MPC’s decision is expected to be announced on December 6. What is RBI likely to announce in the December policy? The rate-setting panel will meet against a backdrop of growing concerns over slowing economic growth and elevated inflationary pressures. These two factors will likely weigh on the MPC’s decision in its December 6 policy announcement. “Given the rather uncertain global environment and the possible impact on inflation and the fact that currently inflation has been averaging close to 5.9 per cent in the last two months, a status quo on the repo rate will be the logical outcome from the policy,” said Madan Sabnavis, Chief Economist, Bank of Baroda. The recent data released by the National Statistics Office (NSO) showed that the country’s real gross domestic product (GDP) slumped to a seven-quarter low of 5.4 per cent in July-September 2024. This compares with a growth of 6.7 per cent in the April-June 2024 quarter and 8.1 per cent in the July-September 2023 period. Consumer price-based inflation (CPI), or retail inflation, surged to a 14-month high of 6.21 per cent in October 2024, compared to 5.5 per cent in September. “RBI is expected to remain on pause in December 2024, with upside risk to food inflation in the near-term. Overall headline CPI inflation in Q3FY25 is averaging closer to 6 per cent versus RBI’s estimate of 4.8 per cent. Subdued core inflation shows that inflation pressures remain localised due to presence of negative output gap,” said Gaura Sengupta, Chief Economist, IDFC FIRST Bank. Goldman Sachs also expects the RBI to keep the policy repo rate unchanged at 6.5 per cent at the December 6 policy meeting as a base case. Can there be a change in monetary policy stance? The Reserve Bank’s MPC changed the policy stance from “withdrawal of accommodation” to “neutral” in the October 2024 policy. The RBI may not tweak the stance in the forthcoming policy, analysts said. “We further expect the RBI to retain the ‘neutral’ policy stance and remain “unambiguously focused on durably aligning inflation to the target, while supporting growth”,” Goldman Sachs said in the report. In the last policy meeting, the MPC changed ",
    "description2": "the monetary policy stance to 'neutral', after keeping it as 'withdrawal of accommodation' for 28 straight months. The neutral stance indicates that conditions are now congenial for a cut in the repo rate in the near future. Growing clamour for repo rate cut Recently, two Union ministers have called for a cut in the repo rate. Last month, Finance Minister Nirmala Sitharaman batted for “affordable bank interest rates” to support industries to ramp up and build capacities. “…at a time when we want industries to ramp up and build capacities, bank interest rates will have to be far more affordable,” Sitharaman had said at an event while responding to a question on whether she expects a reduction in interest rates soon or if there could be a delay in the cut given current inflation print. Union Minister for Commerce and Industry, Piyush Goyal, had also urged the RBI to cut interest rates to boost economic growth and look through food prices while deciding on monetary policy. Will RBI revise inflation and GDP projections? There could be a change in RBI projections for both inflation and GDP as inflation has been higher so far than the RBI forecast for Q3 and GDP growth is expected to be lower in Q2, said Bank of Baroda’s Sabnavis. “It would hence be of interest to see what the projections this time are,” he said. The RBI has projected real GDP growth for 2024-25 at 7.2 per cent with Q2 at 7 per cent; Q3 at 7.4 per cent; and Q4 at 7.4 per cent. The forecast for CPI is 4.5 per cent for 2024-25, with Q2 at 4.1 per cent; Q3 at 4.8 per cent; and Q4 at 4.2 per cent According to IDFC FIRST Bank’s Sengupta, there could be a downside risk to RBI’s FY25 GDP growth estimate of 7.2 per cent and upside risk to FY25 CPI inflation estimate of 4.5 per cent. So, what happens to lending rates if the repo rate is left steady? If the RBI leaves the repo rate steady at 6.5 per cent, all external benchmark lending rates (EBLR) linked to the repo rate will not increase, giving relief to borrowers as their equated monthly instalments (EMIs) will not increase. However, lenders may raise interest rates on loans that are linked to the marginal cost of fund-based lending rate (MCLR), where the full transmission of a 250 bps hike in the repo rate between May 2022 and February 2023 has not happened. In response to the 250 bps hike in the policy repo rate since May 2022, banks have revised upwards their repo-linked external benchmark-based lending rates (EBLRs) by a similar magnitude. The median 1-year marginal cost of funds-based lending rate (MCLR) of SCBs has increased by 170 bps during May 2022 to October 2024.",
    "image": "https://images.indianexpress.com/2024/11/RBI_84780d.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": " Updated 12:18:24 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T20:48:36+05:30",
    "dateModified": "2024-12-01T20:48:36+05:30"
  },
  {
    "title": "GST collection rises by 8.5% to Rs 1.82 lakh crore in November",
    "link": "https://worldsnews24.vercel.app/business/gst-collection-rises-by-8-5-to-rs-1-82-lakh-crore-in-november",
    "siteurl": "https://worldsnews24.vercel.app/business/gst-collection-rises-by-8-5-to-rs-1-82-lakh-crore-in-november",
    "description": "The total gross Goods and Services Tax (GST) revenue grew 8.5 per cent to over Rs 1.82 lakh crore in November as compared to Rs 1.68 lakh crore in the same month a year ago. ",
    "thumbnail": "https://images.indianexpress.com/2024/12/gst.jpg",
    "description1": "Gross GST collections grew 8.5 per cent to over Rs 1.82 lakh crore in November on higher revenues from domestic transactions. The Central GST collection stood at Rs 34,141 crore, State GST at Rs 43,047 crore, Integrated IGST at Rs 91,828 crore and cess at Rs 13,253 crore, according to government data released on Sunday. The total gross Goods and Services Tax (GST) revenue grew 8.5 per cent to over Rs 1.82 lakh crore in November as compared to Rs 1.68 lakh crore in the same month a year ago, it said. In October, GST collections of Rs 1.",
    "description2": "87 lakh crore were the second-best GST mop-up with 9 per cent annual growth. The highest-ever collection was in April 2024 at over Rs 2.10 lakh crore. During the month under review, GST from domestic transactions grew 9.4 per cent to Rs 1.40 lakh crore, while revenues from tax on imports rose about 6 per cent to Rs 42,591 crore. Refunds worth Rs 19,259 crore were issued during the month, registering 8.9 per cent decline over the year-ago period. After adjusting refunds, net GST collection increased by 11 per cent to Rs 1.63 lakh crore.",
    "image": "https://images.indianexpress.com/2024/12/gst.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": " Updated 12:18:24 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T19:52:22+05:30",
    "dateModified": "2024-12-01T19:52:22+05:30"
  },
  {
    "title": "Post Supreme Court ruling, EPFO issued 16,282 higher pension payment orders under Employees’ Pension Scheme",
    "link": "https://worldsnews24.vercel.app/business/post-supreme-court-ruling-epfo-issued-16-282-higher-pension-payment-orders-under-employees-pension-scheme",
    "siteurl": "https://worldsnews24.vercel.app/business/post-supreme-court-ruling-epfo-issued-16-282-higher-pension-payment-orders-under-employees-pension-scheme",
    "description": "A total of 17.49 lakh applications were received for the higher pension option after the Supreme Court directed the EPFO to open a window for pensioners and members to apply for it.",
    "thumbnail": "https://images.indianexpress.com/2024/12/epfo.jpg",
    "description1": "Around 16,282 pension payment orders have been issued so far by the Employees’ Provident Fund Organisation (EPFO) to members and pensioners who had applied for higher pension under the Employees’ Pension Scheme (EPS) after the November 2022 Supreme Court ruling. Even as the retirement fund body has rejected 2.6 lakh forms for higher pension, over 6 lakh applications for validation of option and joint options from employers and employees are still under examination by the EPFO’s field offices. While the EPFO has not specified the total financial impact of the rollout of the higher pension option, it said the sample data of around 38,000 applicants for pension on higher wages shows a deficit of around Rs 9,500 crore, that is, approximately Rs 25 lakh per person. It means a member has to shell out Rs 25 lakh on an average if he/she has opted for the higher pension option based on the sample figures. “An initial estimate suggested that approximately a sum of Rs 1,86,920 crore will be depleted out of the Fund on settlement of even as less as 50 per cent of the joint option (post 2014 cases) received,” said a note shared by the EPFO on the current status of the implementation of the higher pension scheme in the 236th meeting of the EPFO’s Central Board of Trustees held Saturday. The EPFO said the actuarial analysis can be completed only after all the applications for validation of joint options are processed. A total of 17.49 lakh applications were received for the higher pension option after the Supreme Court directed the EPFO to open a window for pensioners and members to apply for it. The SC in a ruling on November 4, 2022 had upheld the amendments to the Employees’ Pension (Amendment) Scheme, 2014, providing another chance for employees who were existing EPS members as on September 1, 2014, to contribute up to 8.33 per cent of their ‘actual’ salaries — as against 8.33 per cent of the pensionable salary capped at Rs 15,000 a month — towards pension. Given the high number of pending applications for higher pension, the ",
    "description2": "EPFO is aiming for a timeline of next three months to process all the applications. To speed up the process, the EPFO is considering engaging retired officials for work. Out of the total 17.49 lakh applications received by the EPFO for higher pension, 3.12 lakh forms are pending with the employers. Thus, the net number of applications received in EPFO has been 14.37 lakh, out of which 2.7 lakh are by pensioners who retired prior to 01.09.2014, while 11.67 lakh applications are for validation of joint options by employees who were EPS members as on 01.09.2014. Demand letters have been issued to just 21 pensioners (those who retired before 01.09.2014), while 1.19 lakh demand letters have been sent to the members who were employees as on 01.09.2014. Pensioners, who retired before 01.09.2014, saw a higher rejection number with 1.91 lakh rejected forms compared with rejection of 69,767 forms of employees who were EPS members as on 01.09.2014. Pensioners also saw a lower issuance of pension payment orders with just 4 orders as against 16,278 payment orders issued to employees. In case of some exempted establishments, the EPFO said the trust rules have mentioned that the contributions to the pension fund and the provident fund would be restricted to the wage ceiling. The EPFO had kept the deadline to apply for higher pension till July 11 last year. It had then given further time of three months to employers till September 30, 2023 and then another extension till December 31, 2023, while employees had time till July 11, 2023 to submit their applications. Applications that are complete with the required information are processed and demand letters issued by the EPFO indicate the additional due amounts to the pension fund. If the applicants for higher pension under EPS have the due amount available in their provident fund accounts maintained with the EPFO, then only a diversion is required. In cases where the due amount is not available with the EPFO, then it has to be deposited by the member directly or through the employer.",
    "image": "https://images.indianexpress.com/2024/12/epfo.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 12:18:24 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T04:20:20+05:30",
    "dateModified": "2024-12-02T04:20:20+05:30"
  },
  {
    "title": "EPFO Board approves reinvestment norms for ETF redemption, amnesty scheme for employers",
    "link": "https://worldsnews24.vercel.app/business/epfo-board-approves-reinvestment-norms-for-etf-redemption-amnesty-scheme-for-employers",
    "siteurl": "https://worldsnews24.vercel.app/business/epfo-board-approves-reinvestment-norms-for-etf-redemption-amnesty-scheme-for-employers",
    "description": "The Board also discussed the pilot of the Centralised Pension Payment System (CPPS), which is likely to be launched on December 31.",
    "thumbnail": "https://images.indianexpress.com/2024/05/EPFO-1600-File.jpg",
    "description1": "A redemption policy for investments in exchange-traded funds (ETFs) and reinvestment of 50 per cent of those redemption proceeds into ETFs, along with an amnesty scheme for employers to voluntarily disclose and rectify past non-compliance without penalties was approved by the Central Board of Trustees of the Employees’ Provident Fund Organisation (EPFO) in its 236th meeting Saturday. The Board also discussed the pilot of the Centralised Pension Payment System (CPPS), which is likely to be launched on December 31. The EPFO, which has 7.37 crore contributing subscribers and a total of 32.56 crore members, plans to increase the ETF redemption period to 7 years from 4 years over the next six years to improve yields. While 50 per cent of the redemption proceeds will get reinvested in equity through ETFs such as Bharat 22 and CPSE ETFs, the remaining 50 per cent would be invested in other asset classes as per the existing pattern such as government securities and corporate bonds. The changes in investment norms is being done with an aim to earn better returns through investment in equity. The investment committee of the EPFO had earlier noted that “there is a need to balance the short-term returns on investments under EPF Scheme with the future growth prospects in equity”. As per the notified pattern of investment by the Ministry of Labour and Employment, the EPFO can invest up to 15 per cent of its incremental flows in equity. EPFO started with an investment of 5 per cent in equity through ETFs on Sensex or Nifty in August 2015. Subsequently from 2017 the investment in ETFs was increased to 15 per cent of the fresh accretion. The 44-member CBT, headed by Labour and Employ",
    "description2": "ment Minister Mansukh Mandaviya and having both employees’ and employers’ representatives, also gave nod for the EPFO Amnesty Scheme 2024. The scheme is being brought as the Labour and Employment Ministry moves ahead with the implementation plan for the Budget announcement of Employment Linked Incentive (ELI) scheme. “The initiative is designed to encourage employers to voluntarily disclose and rectify past non-compliance or under-compliance without facing penalties or legal repercussions. A simple online declaration from employers will be sufficient to avail the scheme benefits,” the Ministry said in a statement. The amnesty scheme has been proposed in the backdrop that several small establishments, especially Micro, Small and Medium Enterprises (MSMEs), may opt for the ELI scheme but would have faced a roadblock if there were past dues of non-compliance for EPF contribution. The CBT also approved a key feature of crediting interest at the time of claim settlements. At present, for the claim settled till 24th of the month, interest is paid only up to the end of the previous month. Now, the interest will be paid to the member up to the date of settlement. The Board also discussed the earlier decision to increase the limit for auto claims settlement facility to Rs 1 lakh from Rs 50,000 which is now applicable for advances for housing, marriage and education. In the current financial year 2024-25, the EPFO has settled 1.15 crore claims in auto mode. “During the Financial Year 2023-24, the EPFO settled 4.45 crore claims for an amount of Rs 1.82 lakh crore. In the current FY, 3.83 crore claims have already been settled for more than Rs.1.57 lakh crore,” the Ministry said.",
    "image": "https://images.indianexpress.com/2024/05/EPFO-1600-File.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": " Updated 12:18:24 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T04:00:08+05:30",
    "dateModified": "2024-12-01T04:00:08+05:30"
  },
  {
    "title": "Trump threat to BRICS: Give up idea of replacing dollar or face 100% tariffs",
    "link": "https://worldsnews24.vercel.app/business/trump-threat-to-brics-give-up-idea-of-replacing-dollar-or-face-100-tariffs",
    "siteurl": "https://worldsnews24.vercel.app/business/trump-threat-to-brics-give-up-idea-of-replacing-dollar-or-face-100-tariffs",
    "description": "Trump's statement was made on his social media platform, Truth Social, on Saturday, targeting the bloc's ongoing efforts to challenge the dominance of the dollar.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Trump-13_20241130201351.jpg",
    "description1": "Setting the stage to counter any challenge to the dollar’s domination in global trade, US President-elect Donald Trump has threatened the BRICS grouping, which has India, Russia and China among its key members, with “100 per cent tariffs” if it moved to create a new currency or back any other option as the world’s reserve. “The idea that the BRICS countries are trying to move away from the dollar while we stand by and watch is OVER,” Trump wrote in a social media post early Sunday. “We require a commitment from these countries that they will neither create a new BRICS currency nor back any other currency to replace the mighty U.S. dollar, or they will face 100 per cent tariffs and should expect to say goodbye to selling into the wonderful U.S. economy. They can go find another ‘sucker!’ There is no chance that the BRICS will replace the US dollar in international trade, and any country that tries should wave goodbye to America,” Trump posted. With the USD accounting for over 90 per cent of global transactions, Trump's latest remarks come amid divergent views on the issue at the BRICS summit in October. At the time, Russian President Vladimir Putin had warned that the “dollar is being used as a weapon”. But Prime Minister Narendra Modi had cautioned that the grouping should not acquire the image of one that is trying to replace global institutions. Trump’s threat also comes at a time when US sanctions on Russia have resulted in Russian oil being redirected from Europe to Asia. However, international trade experts warn that any such tariff move by the US would “ultimately hurt America the most”. According to them, several countries have been looking at other “mechanisms” after the US “weaponised the global financial infrastructure” by throwing Iran and Russia out of the Society for Worldwide Interbank Financial Telecommunication (SWIFT), which is the key to international transactions. “It is the actions of the United States that have pushed many countries to seek alternatives to the US dollar. The US has a history of leveraging its influence over global financial systems, such as the SWIFT network, to impose unilateral sanctions. By blocking countries like Russia and Iran from accessing SWIFT, the US has effectively weaponised the global financial infrastructure, forcing other nations to find alternative payment mechanisms to continue legitimate trade,” former trade officer and head of the think tank, Global Trade Research Initiative, Ajay Srivastava, said. Srivastava also said that imposing a 100 per cent tariff on BRICS countries could backfire economically. “Imports into the US would simply shift to third countries, potentially increasing costs for American consumers without bringing manufacturing jobs back home. The US has become less competitive in manufacturing labour-intensive goods due to higher production costs, and tariffs are unlikely to reverse this trend,” he said. BRICS stands for Brazil, Russia, India, China and South Africa, the original five members. This year, the group admitted four new members - Egypt, Ethiopia, Iran and UAE - and now represents almost half the world’s population and almost one quarter of its economy. Federation of Indian Export Organisations (FIEO) Director General &amp; CEO Ajay Sahai said that India should engage diplomatically with the US to explain its position, emphasising that diversifying trade mechanisms is not anti-American but a move towards multipolarity and financial stability. “We should accelerate the development and internationalisation of digital currency (CBDC) and financial platforms like UPI to take a leadership role in BRICS currency initiatives. Trump’s threat might am",
    "description2": "plify geopolitical tensions, but it is unlikely to deter BRICS nations from pursuing alternatives to the US dollar. For India, the best course is a balanced approach: supporting financial reforms within BRICS that align with its interests while maintaining strong ties with the US to safeguard its broader strategic and economic priorities,” Sahai said. Meanwhile, the IMF’s Currency Composition of Official Foreign Exchange Reserves (COFER) has pointed to a gradual decline in the dollar’s share of central bank and government foreign reserves. But the reduced role of the US dollar over the past two decades has not been matched by corresponding increases in the shares of the other “big four” currencies, the euro, yen and pound, according to the IMF. “Rather, this has been accompanied by a rise in the share of what we refer to as non-traditional reserve currencies, including the Australian dollar, Canadian dollar, Chinese renminbi, South Korean won, Singaporean dollar, and the Nordic currencies,” the IMF said in July. Significantly, the IMF also said that one non-traditional reserve currency gaining market share is the Chinese renminbi, whose gains match a quarter of the decline in the dollar’s share. “The Chinese government has been advancing policies on multiple fronts to promote renminbi internationalization, including the development of a cross-border payment system, the extension of swap lines, and piloting a central bank digital currency. It is thus interesting to note that renminbi internationalization, at least as measured by the currency’s reserve share, shows signs of stalling out,” IMF said about the key BRICS member. “China is very keen to assume a dominant role to use the (BRICS) bloc against the US, though India, Brazil and South Africa are more keen to work with the US and settle the differences amicably through negotiations,” FIEO chief Sahai said. In India, an effort to reduce reliance on the US dollar and internationalise the rupee saw the RBI allowing invoicing and payments for global trade in rupees in 2022 after sanctions were imposed on Russia amid the Ukraine war. According to the BIS Triennial Central Bank Survey 2022, foreign exchange market turnover - daily averages - shows that the US dollar accounted for 88 per cent of the global forex turnover while the rupee accounted for 1.6 per cent. The survey stated that if rupee turnover rises to equal the share of non-US, non-Euro currencies in global forex turnover of 4 per cent, it will be regarded as an international currency. But India’s trade with Russia in domestic currency remains low due to Indian banks' fear of US sanctions and an unbalanced trade relationship between the two countries. While there has been a multifold rise in India-Russia trade after the Ukraine war, it has been firmly in favour of Russia. According to official data, India’s exports to Russia stood at $4.2 billion in FY24, but increasing oil imports from Moscow have widened the import bill to $61 billion. As a result, Russia has a huge pile of rupee reserves that it has not been able to use to settle bilateral trade using domestic currency and is instead using it to invest in Indian stocks and bonds. In October, External Affairs Minister S Jaishankar had said that while India is pursuing its trade interests, avoiding the use of the US dollar is not part of economic policy. Jaishankar said US policies often complicate trade with certain countries, and India is seeking “workarounds” without intending to move away from using the dollar, unlike some other nations. However, the Union Minister did add that a multipolar world will eventually be reflected in “currencies and economic dealings”.",
    "image": "https://images.indianexpress.com/2024/12/Trump-13_20241130201351.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": " Updated 12:18:24 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T00:16:50+05:30",
    "dateModified": "2024-12-01T00:16:50+05:30"
  },
  {
    "title": "Real estate developers’ luxury push continues even as launches below Rs 2.5 crore slow down",
    "link": "https://worldsnews24.vercel.app/business/real-estate-developers-luxury-push-continues-even-as-launches-below-rs-2-5-crore-slow-down",
    "siteurl": "https://worldsnews24.vercel.app/business/real-estate-developers-luxury-push-continues-even-as-launches-below-rs-2-5-crore-slow-down",
    "description": "After the pandemic, housing became increasingly aspirational for urban Indians, with mid-segment buyers gravitating toward projects offering superior amenities and better connectivity.",
    "thumbnail": "https://images.indianexpress.com/2024/11/Realty.jpg",
    "description1": "After growing at a robust 52 per cent annually since the Covid-19 pandemic, residential launches across India’s top real estate markets fell by 2 per cent in the first three quarters of 2024 compared to the same period in 2023. This marks the sector’s first slowdown since the post-2020 boom, with just one ticket size bucking the trend – luxury units priced above Rs 2.5 crore. The growing premiumisation of India’s residential real estate sector amidst easing demand is also evident in sales, which fell by 3 per cent year-on-year (y-o-y) between April and September 2024, while the average ticket size of units sold grew by 23 per cent, an analysis of data from Anarock showed. In the Delhi-NCR market, where demand for luxury housing is especially pronounced, sales fell by 0.6 per cent while the average price of units sold surged by 56 per cent. The first signs of a slowdown in residential real estate mirror recent concerns around waning urban demand across sectors, from automobiles to consumer goods. Major developers have announced plans to transition away from affordable housing as they no longer see a business opportunity in the segment. Even in the upper-end Rs 1.5-2.5 crore segment, launches fell by 15 per cent y-o-y in the first three quarters of 2024, as against doubling each year between 2020 and 2023. Strong demand for luxury housing Launches of residential units priced above Rs 2.5 crore across the top seven cities—including the Mumbai Metropolitan Region (MMR), Delhi-NCR, Bengaluru, and Chennai—surged at a compounded annual growth rate (CAGR) of 116 per cent between 2020 and 2023, marking an unprecedented boom in luxury housing. From just 4,000 such units in 2020, launches soared to over 41,000 in 2023. Even in the first three quarters of 2024, when overall residential launches declined by 2 per cent, luxury launches displayed notable resilience, growing by 56 per cent to over 52,000 units. After the pandemic, housing became increasingly aspirational for urban Indians, with mid-segment buyers gravitating toward projects offering superior amenities and better connectivity. Demand for larger homes with flexible configurations, such as additional rooms, has also risen sharply. Reflecting this trend, the average flat size grew from 1,167 square feet in 2020 to 1,300 square feet in 2023—a rise of 11.4 per cent, according to data from Anarock. In an earnings call last month, Aakash Ohri, Joint MD at DLF Ltd, noted that demand for luxury housing is no longer confined by a north-south geographic divide. “I have seen in super luxury, including our projects in Goa and of course, Camellias, it has been pan-India. The recent sales and the interest that I'm seeing is coming from top families of Tier 2 cities all over the country… I feel that the start point is where we are today. It is only going to go up,” Ohri said. Others are more cautious–Jagadish Nangineni, MD of Bangalore-headquartered Sobha Ltd, believes that luxury sales may begin to s",
    "description2": "tabilise. “I think there is a steadiness in the market and probably what we can anticipate is not (what) we have seen (with) the increase in the sales volumes in the last couple of years. Probably we are reaching a steady state instead of continuous increase in terms of demand,” Nangineni told analysts on November 15. Developers pivot from affordable housing Between 2020 and 2023, launches below Rs 40 lakh grew at the slowest CAGR of 29 per cent to a little over 83,000 units. The next ticket size – launches priced between Rs 40 lakh and Rs 1.5 crore – grew at 50 per cent to around 2,60,000 units. Growth in both these ticket sizes was lower than the overall CAGR of 52 per cent. In the first three quarters of 2024, launches below Rs 40 lakh fell by 10 per cent and those between Rs 40 lakh and Rs 1.5 crore fell by 7 per cent. The latest data reflects what developers have been saying for some time – both demand and margins are higher in the premium segments. Soaring input costs and land prices have also made affordable projects in and around metropolitan cities harder to execute. Abhishek Lodha, MD and CEO of Macrotech Developers Ltd, reiterated the company’s “planned transition” away from entry-level housing towards the “upper end of the mid-income and beyond” in a recent earnings call. “As a consequence of that… we will be moving from a tilt of about 85% to 90% of our sales coming from lower mid-income and entry-level housing to that moving to 50%, obviously, over a period of 3 years,” Lodha said. Amit Kumar Sinha, MD and CEO of Mahindra Lifespace Developers Ltd, also confirmed that the company “will not pursue affordable anymore”. “So, that segment is out. And while super luxury and all are very exciting, our focus is going to mid-premium and premium. And the way we segment the market is affordable, mid-premium, premium and luxury… we will play in the middle 2 segments, we will not play in the 2 extreme segments,” Sinha told analysts last month. Pavitra Shankar, MD of Brigade Enterprises Ltd said on November 14 – “If in future, there was affordable housing, we would look at that, too, if there was opportunity there. But currently, there is a lot of demand in terms of premiumization of consumer demand itself, whether real estate or any sector. So that's why we are capitalizing on this trend.” Among top 7 cities, Delhi-NCR recorded the steepest rise in the average price of units sold, which surged to Rs 1.45 crore between April to September 2024 from Rs 0.93 crore during the same period in 2023. On the other hand, sales fell slightly by 0.6 per cent to 32,125 units. In Bangalore, the average price of units sold jumped by 44 per cent to Rs 1.21 crore while sales fell 0.2 per cent to 31,380 units. The MMR region was the only exception among major cities to record a positive growth in units sold – from 76,410 to 77,735 units, a growth of 1.7 per cent. The average price of units sold in and around Mumbai also did not change from Rs 1.47 crore.",
    "image": "https://images.indianexpress.com/2024/11/Realty.jpg",
    "image1": "",
    "date": "30/11/2024",
    "time": " Updated 12:18:24 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-30T22:59:05+05:30",
    "dateModified": "2024-11-30T22:59:05+05:30"
  },
  {
    "title": "As small and micro loans come under pressure, stress on small finance lenders could dent consumption further",
    "link": "https://worldsnews24.vercel.app/business/as-small-and-micro-loans-come-under-pressure-stress-on-small-finance-lenders-could-dent-consumption-further",
    "siteurl": "https://worldsnews24.vercel.app/business/as-small-and-micro-loans-come-under-pressure-stress-on-small-finance-lenders-could-dent-consumption-further",
    "description": "Indicating the rising indebtedness, credit card outstanding rose to Rs 2.71 lakh crore by September 2024 from Rs 2.30 lakh crore in September last year.",
    "thumbnail": "https://images.indianexpress.com/2024/11/RBI_84780d.jpg",
    "description1": "Early signs of stress in India's microfinance institutions, small finance lenders, and unsecured personal loans are beginning to show up, primarily driven by escalating borrower indebtedness. Latest data reveals a surge in delinquencies during the first half of FY25, with multiple analysts predicting this trend to persist into the next half year, casting a shadow over the asset quality of underlying loans. As a result, small and micro loans face significant risks to their growth and profitability, sparking concerns about the sector's resilience in these challenging times, analysts and rating agencies said. On November 13, ESAF Small Finance Bank, which used to focus on micro loans, reported a jump in gross non-performing assets (NPAs) to Rs 1,279.3 crore (6.9 per cent of advances) for the quarter ended September 2024 from Rs 399.1 crore (2.6 per cent) a year ago due to its concentration on micro loans. Its share price has plummeted from a 52-week high of Rs 82.26 to Rs 39.01 now. Aviom India Housing Finance informed its lenders earlier this month about an ongoing audit by the National Housing Bank (NHB) in the wake of the discovery of fraudulent transactions during a recent onsite supervisory inspection. Saying that there could be a delay in repayments to creditors, Aviom said in a letter to lenders that, “the NHB audit was initiated following the regular on-site supervisory inspection that resulted in observations, including that the statement of accounts of mutual fund(s) appear to be managed.” CRISIL has estimated that the gross non-performing assets (NPAs) of small finance banks (SFBs) are expected to move up to 2.9 per cent by the end of fiscal 2025 from 2.3 per cent as on March 31, 2024. “As a result, credit cost is set to rise 40 bps (basis points) to 1.4 per cent. The impact of the expected delinquency trends will not be uniform, though. The extent of rise in gross NPAs and credit costs across SFBs will vary based on the extent of their exposure to the vulnerable segments,” said Vani Ojasvi, associate director, CRISIL Ratings. Indicating the rising indebtedness, credit card outstanding rose to Rs 2.71 lakh crore by September 2024 from Rs 2.30 lakh crore in September last year. The Reserve Bank of India stepped in to check the rampant rise in the indebtedness and delinquencies in the personal loan segment with more restrictions last year, leading to a decline in the growth in the overall personal loan book of banks to 5 per cent as of September this year from 18 per cent a year ago. ICRA said delinquencies in the microfinance institutions (MFI) sector rose to 2.4 per cent by June 2024 from 2.1 per cent in March, while highlighting the increasing delinquencies in the microfinance sector, which is likely to push up the NBFC-MFI credit costs to 320-340 bps — one basis point is one hundredth of a percentage point — in FY25 from 220 bps in FY24. The evolving asset quality risks will dampen sectoral growth and earnings in the current fiscal. ICRA expects NBFC-MFIs’ assets under management (AUM) growth to dip to 17-19 per cent in FY25 from 29 per cent in FY24. Microfinance institutions faced a significant rise in delinquencies during the first quarter of fiscal 2025, according to Crisil. Early-stage delinquencies (0+ and 30+ days past due) increased by 110 basis points and 55 basis points, respectively, compared to the preceding March quarter. Four key factors contributed to this decline in portfolio quality: lending to over-leveraged borrowers, debt-waiver campaigns, high field-staff attrition, and operational challenges due to elections and extreme weather. As a result, average monthly collection efficiency dropped to 96 per cent in Q1 FY25 and further to 94 per cent in Q2, down from 98 per cent in the previous fiscal, CRISIL said. According to Jyoti Prakash Gadia, managing director, Resurgent India, while the banking industry as a whole is showing resilience with a gradually reduced NPA, stress is visible in microfinance, small finance, and unsecured loans. “This is primarily because of the relatively more aggressive approach adopted by these institutions in granting loans. The risk assessment and compliance criteria have been apparently diluted with the element of flexibility in selecting the borrowers,” Gadia said. Target hunting with an intent to expand quickly has prompted sanctions on some borrowers who did not have adequate cash flows to fall back upon for repayment, leading to stress. The overall economic scenario at the rural and semi-urban level has also not improved to a level of buoyancy, thereby creating stress for small loans, Gadia said. In fiscal 2025, microfinance loans and unsecured personal loans, where early signs of stress are visible on account of a rise in borrower indebtedness, will see a moderation in portfolio quality. Sub-segments within secured asset classes, catering in part to a similar customer segment, could also see higher delinquencies, CRISIL said. The RBI has recently imposed a ‘cease and desist order’ on some NBFC-MFIs, preventing them from sanctioning and disbursing loans. “The re",
    "description2": "strictions were due to issues related to predatory pricing, insufficient transparency in disclosures, and improper evaluation of household income and fixed monthly liabilities. Additionally, concerns have been raised about lending to customers with multiple fake voter IDs, often categorised as new-to-credit (NTC) customers, which further undermines the integrity of the lending process,” CareEdge Ratings said in a report. In October, the RBI cautioned non-banking finance companies against aggressively pursuing growth without building up sustainable business practices and risk management frameworks, commensurate with the scale and complexity of their portfolio. “The Reserve Bank is closely monitoring these areas and will not hesitate to take appropriate action, if necessary,” RBI Governor Shaktikanta Das said. Driven by the significant accretion to their capital from both domestic and overseas sources, and sometimes under pressure from their investors, some NBFCs — including microfinance institutions (MFIs) and housing finance companies (HFCs) — are “chasing excessive returns on their equity”, he said. Furthermore, the RBI has raised concerns regarding the practice of loan netting by MFIs and has instructed certain banks and MFIs to ensure that this does not lead to ‘ever-greening of delinquent loans’. The increasing borrower indebtedness is compounded by various factors, such as heatwaves, general elections, and political movements like the “Karja Mukti Abhiyan (loan waiver scheme).” This challenge is further aggravated by the weakening of the joint liability group model, characterised by a notable decrease in centre attendance and diminished peer pressure and collective accountability, which have historically helped maintain low default rates, CareEdge said. The profitability of small finance banks, measured in terms of return on assets (RoA), will moderate around 40 bps to 1.7 per cent this fiscal from 2.1 per cent for FY24 due to lower net interest margins (NIM) and higher credit costs, CRISIL said. The overall profitability will continue to be significantly influenced by credit costs. Small finance banks are bracing for a potential surge in delinquencies and credit costs, driven by economic stress, and rising borrower indebtedness. SFBs, catering to relatively vulnerable customers, tend to experience higher delinquencies during economic downturns, as witnessed during the pandemic. \"Early signs of stress are visible in microfinance and unsecured personal loans due to increasing borrower indebtedness,\" CRISIL noted. \"SFBs must proactively manage risk and tighten lending norms to mitigate potential losses,\" it said. “The challenge is higher for unsecured asset classes such as personal loans, business loans, and MFIs. The impact on the MFI segment is higher,” said Sanjay Aggarwal, senior director, CARE Ratings. He expects credit cost for NBFC-MFIs to be at 7 per cent in FY2025, compared to 2.5 per cent in FY24. Analysts see a significant slowdown in the loan book of NBFCs due to the higher base effect, the reduction in bank funding to NBFCs and the tightening of underwriting standards by non-bank lenders. “Overall, there will be a slowdown in the loan growth of NBFCs as bank funding to these entities has reduced. The lower funding is because the RBI wants growth in retail loans to come down as certain borrowers are overleveraged, which increases the risk of higher defaults,” said a banking analyst. CAUTIOUS APPROACH NEEDED The expectations of significant improvements in future earnings and social aspirations have led to a substantial increase in unsecured borrowings by new consumers, and this portfolio, particularly of NBFCs and microfinance institutions, has grown faster. The delinquencies have correspondingly grown in the absence of adequate generation of income and surplus impacting the repayment capacity, Gadia said. Experts said it’s a matter of concern and a careful approach with brakes on fresh sanctions in these segments is needed. In addition, stronger recovery efforts are also called for to bring in control of the overall position. The regulator has taken suitable steps in this direction to maintain the desired balance and order in the portfolio. The small loan industry faces significant challenges beyond financial and operational risks, including high staff turnover and rising fraud, both of which disrupt client relationships and loan recovery. These issues, coupled with vulnerabilities to socio-political risks and natural disasters, further complicate the already difficult operating environment for NBFC-MFIs, making 2025 a challenging year ahead. However, despite operating in a vulnerable segment, the NBFC-MFI sector has consistently shown resilience, overcoming challenges like Covid-19 and demonetisation. Its ability to recover and adapt has earned continued investor support, highlighting the sector's strength and its critical role in financial inclusion. CareEdge Ratings expect that the sector will also navigate through the current stress and continue playing a vital role in serving underserved communities.",
    "image": "https://images.indianexpress.com/2024/11/RBI_84780d.jpg",
    "image1": "",
    "date": "30/11/2024",
    "time": " Updated 12:18:24 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-30T22:49:42+05:30",
    "dateModified": "2024-11-30T22:49:42+05:30"
  },
  {
    "title": "Vodafone Idea shares surge 18% after Union Cabinet approves bank guarantee waiver",
    "link": "https://worldsnews24.vercel.app/business/vodafone-idea-shares-surge-18-after-union-cabinet-approves-bank-guarantee-waiver",
    "siteurl": "https://worldsnews24.vercel.app/business/vodafone-idea-shares-surge-18-after-union-cabinet-approves-bank-guarantee-waiver",
    "description": "",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115692195/115692195.jpg",
    "description1": "Vodafone Idea share price today: Vodafone Idea (Vi) shares surged 18.08% to Rs 8.23 on the BSE during early Tuesday trading, following the Union Cabinet's in-principle approval regarding the company's bank guarantee matter. At 2:53 PM, shares of Vi were trading at Rs 7.59, up 8.74%.The Cabinet offered relief to telecommunications firms by eliminating bank guarantee requirements for spectrum acquisitions through 2022. The Department of Telecommunications (DoT) had supported this waiver for spectrum purchases. The reforms of 2021 had already removed bank guarantee requirements for auctions from 2022 onwards. Vi's total bank guarantee obligation stands at Rs 24,700 crore, with the spectrum auction dues moratorium concluding in October 2025.Vodafone Idea defaulted on its second bank guarantee (BG) payment of approximately Rs 350 crore on November 1, relating to spectrum acquired in the 2012 auction. Previously, ",
    "description2": "the company had missed a BG payment exceeding Rs 4,600 crore for 2016 spectrum auction in September, as reported by ET.Although Vi spearheaded the BG waiver request, with support from other telecommunications firms, the government's decision particularly advantages Vi. Whilst competitors Bharti Airtel and Reliance Jio also require BG submissions for previous auction payments, their obligations are considerably smaller than Vi's.Bharti Airtel faces a BG payment of roughly Rs 2,200 crore due in September next year for the 2016 auction. Jio's obligation of approximately Rs 4,400 crore follows afterwards.Vi requested the waiver citing financial constraints, anticipating that this would enable banks to extend additional credit facilities to the company.Following this development, Bharti Airtel shares increased by 1.6% to Rs 1,604.95, whilst Jio Financial Services shares declined nearly 1% to Rs 320.10 on the BSE.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115692195/115692195.jpg",
    "image1": "",
    "date": "26/11/2024",
    "time": "Updated 12:18:24 pm",
    "courtesy": "TOI Business Desk",
    "datePublished": "2024-11-26T14:57:00+05:30",
    "dateModified": "2024-11-26T14:57:00+05:30"
  },
  {
    "title": "Stock market today: BSE Sensex opens over 350 points down; Nifty50 near 24,050",
    "link": "https://worldsnews24.vercel.app/business/stock-market-today-bse-sensex-opens-over-350-points-down-nifty50-near-24-050",
    "siteurl": "https://worldsnews24.vercel.app/business/stock-market-today-bse-sensex-opens-over-350-points-down-nifty50-near-24-050",
    "description": "",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115882451/115882451.jpg",
    "description1": "Stock market today: BSE Sensex and Nifty50, the Indian equity benchmark indices, opened in red on Monday following weaker than expected GDP data released on Friday after market hours. While BSE Sensex went below 79,500, Nifty50 was above 24,000. At 9:16 AM, BSE Sensex was trading at 79,451.25, down 352 points or 0.44%. Nifty50 was at 24,048.05, down 83 points or 0.34%.The domestic markets showed strong recovery on Friday, ending with gains for the second consecutive week. This week, markets are expected to respond to the lower-than-anticipated Q2 GDP figures of 5.4%, which fell short of the projected 6.5%. All eyes are also the RBI’s monetary policy meet later this week.According to market experts, future investor sentiment will be influenced by geopolitical events and FII movements, with markets likely to maintain a confined range due to mixed global indicators and limited domestic cat",
    "description2": "alysts.Market sentiment shows improvement with the index maintaining levels above 23,870. Short-term outlook suggests sideways to positive movement, contingent on sustaining above 23,870. Resistance levels are identified at 24,400-24,500, according to LKP Securities' Jateen Trivedi.Meanwhile, Asian equities advanced on Monday, following record-breaking sessions on Wall Street, whilst the US dollar recovered from several weeks of lows against Japanese yen and sterling, during a week critical for US interest rate decisions.Chinese equities received additional support from strong private sector manufacturing data released on Monday, which validated the positive official manufacturing statistics published over the weekend.The US dollar gained strength after President-elect Donald Trump cautioned BRICS nations against attempting to substitute the US currency with any alternative denomination.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115882451/115882451.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 12:18:24 pm",
    "courtesy": "TOI Business Desk",
    "datePublished": "2024-12-02T09:20:00+05:30",
    "dateModified": "2024-12-02T09:20:00+05:30"
  },
  {
    "title": "Stars are aligning for Indian bonds to extend rally into 2025",
    "link": "https://worldsnews24.vercel.app/business/stars-are-aligning-for-indian-bonds-to-extend-rally-into-2025",
    "siteurl": "https://worldsnews24.vercel.app/business/stars-are-aligning-for-indian-bonds-to-extend-rally-into-2025",
    "description": "",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115891044/115891044.jpg",
    "description1": "Indian bonds are set for the best year in four and investors expect more gains on a combination of policy drivers and resilient domestic demand.The central bank’s rate cuts anticipated from early next year on slowing economic growth, continued index-inclusion-related foreign inflows and strong demand from local pension and insurance companies are likely to further burnish the appeal of sovereign notes.Quantum Asset Management forecasts the yield on the benchmark 10-year bond to fall as much as 50 basis points by mid-2025, while Trust Mutual Fund sees the rate sliding toward 6.25%-6.5% over the next year and a half.While a resurgent dollar and higher Treasury yields have dented the appeal of emerging-market assets in recent weeks on concerns about US President-elect Donald Trump’s policies, Indian bonds have remained largely insulated.Even as “there are headwinds from a stronger dollar and higher US Treasury yields, the ongoing bond index inclusion flows are likely to provide sustained solid passive support to Indian bonds,” Barclays Plc strategists including Mitul Kotecha wrote in a note.Indian Bonds Set for Best Year in FourThe yield on the 10-year bond fell by nine basis points on Friday to close at 6.74%, a few basis points lower than early November when the US election results were announced.Bonds rallied on Friday after data showed Ind",
    "description2": "ia’s gross domestic product grew at its slowest pace in almost two years, stoking hopes of liquidity-easing measures or interest-rate cuts by the central bank.That’s not to say the market has been free of volatility. Yields rose to 6.87% on Nov. 22, the highest in more than two months, as some global investors chose to cash in until further clarity on Trump’s policy. The rush of inflows driven by the nation’s inclusion in JPMorgan Chase & Co.’s flagship index is also taking a breather.Notwithstanding the short-term swings, 10-year yields are down more than 40 basis points this year, the most since 2020. That happened as local bonds received about $15 billion of foreign inflows during the period, aided by the JPMorgan gauge addition.India’s index-eligible bonds are also due to find a place in other global indexes, including those of FTSE Russell from next year, potentially attracting more foreign inflows.While the Reserve Bank of India is likely to keep its policy rate unchanged on Dec. 6, traders will watch for cues on when it will start cutting rates. The RBI changed its policy stance to neutral in its most recent rate decision in October.Swaps are pricing in 50 basis points of rate cuts by June 2025, said Pankaj Pathak, a fixed-income fund manager at Quantum Asset. Bonds are likely to gain on the easing and higher foreign inflows, he said.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115891044/115891044.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 12:18:24 pm",
    "courtesy": "Bloomberg",
    "datePublished": "2024-12-02T12:27:00+05:30",
    "dateModified": "2024-12-02T12:27:00+05:30"
  },
  {
    "title": "Bajaj Auto announces 5% overall vehicle sales for November",
    "link": "https://worldsnews24.vercel.app/business/bajaj-auto-announces-5-overall-vehicle-sales-for-november",
    "siteurl": "https://worldsnews24.vercel.app/business/bajaj-auto-announces-5-overall-vehicle-sales-for-november",
    "description": "",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115894415/115894415.jpg",
    "description1": "Bajaj Auto Ltd on Monday reported a 5 per cent year-on-year growth in total vehicle sales, including exports, at 4,21,640 units in November 2024. The Pune-based automaker had sold 4,03,003 units in November 2023, according to a company statement.The automotive company announced a 5 per cent growth in overall vehicle sales in November. This figure includes exports, which stood at 4,21,640 units for the month.In a company statement, the Pune-based automaker reported selling 4,03,003 units in the corresponding month last year.In October 2024, overall domestic sales, including commercial vehicles, dropped by 7 per cent to 2,40,854 units, compared to 2,57,744 units sold in the same month last year.The statement also revealed that total exports during the month under review ",
    "description2": "soared 24 per cent to 1,80,786 units, compared to 1,45,259 vehicles in November 2023.In November 2024, total two-wheeler volume (domestic and exports) reached 3,68,076 units, marking a 5 per cent increase compared to 3,49,048 units sold in the same month last year, according to Bajaj Auto.However, domestic two-wheeler sales fell 7 per cent to 2,03,611 units, down from 2,18,597 units in November 2023.The statement added that two-wheeler exports registered a 26 per cent year-on-year growth, reaching 1,64,465 vehicles in November 2024, compared to 1,30,451 units a year earlier.Meanwhile, overall commercial vehicle sales (including exports) declined by 1 per cent to 53,564 units in November 2024, down from 53,955 units in the same month last year, as reported by Bajaj Auto.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115894415/115894415.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 12:18:24 pm",
    "courtesy": "TOI Business Desk",
    "datePublished": "2024-12-02T14:14:00+05:30",
    "dateModified": "2024-12-02T14:14:00+05:30"
  },
  {
    "title": "Crisil projects India's GDP growth slowdown to 6.8%",
    "link": "https://worldsnews24.vercel.app/business/crisil-projects-india-s-gdp-growth-slowdown-to-6-8",
    "siteurl": "https://worldsnews24.vercel.app/business/crisil-projects-india-s-gdp-growth-slowdown-to-6-8",
    "description": "",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115894346/115894346.jpg",
    "description1": "Rating agency Crisil has projected India's GDP growth to decline from 8.2 percent last year to 6.8 percent in the current fiscal year 2024-2025, pressured by rising interest rates and limited fiscal stimulus.The report mentioned that risks are tilted toward the downside given the lacklustre second-quarter growth numbers.However, many high-frequency indicators from October, such as automobile sales and export growth, still show a positive outlook for the third quarter, suggesting that the slowdown in the second quarter may be temporary.Official data from the Ministry of Statistics and Programme Implementation, released on Friday, revealed that the economy grew by 5.4 percent during the July-September quarter compared to 8.1 percent during the corresponding quarter last fiscal year.Meanwhile, in the April-June quarter, the economy grew by 6.7 percent, falling short of the RBI's forecast of 7.1 percent.Meanwhile, on a positive note, agricultural growth in the country is rising, with significant potential for further expansion",
    "description2": ". This growth is driven by expectations of strong kharif cultivation, owing to a healthy monsoon season that ended 8 percent above the Long Period Average.“All this should provide a fillip to agricultural incomes and rural consumption,” Crisil stated.Additionally, the abundant supply of kharif crops in the market is expected to help reduce food prices, which have been high in recent months, affecting the purchasing power of both rural and urban households. October’s food inflation was primarily driven by rising vegetable, oil, and fruit prices.“Easing inflation, along with the onset of the festive and wedding season, is likely to buoy consumption growth in the second half of this fiscal year,” the report added.India’s retail inflation in October stood at 6.21 percent, breaching the RBI’s upper limit of 6 percent.Food prices remain a major concern for policymakers in India, who aim to bring retail inflation down to a sustainable 4 percent. To keep inflation under control, the RBI has maintained the repo rate at 6.5 percent.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115894346/115894346.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 12:18:24 pm",
    "courtesy": "TOI Business Desk",
    "datePublished": "2024-12-02T14:11:00+05:30",
    "dateModified": "2024-12-02T14:11:00+05:30"
  },
  {
    "title": "IIT Madras student gets Rs 4.3 crore job offer! Here’s a look at big-ticket placement offers made so far at the old IITs this year",
    "link": "https://worldsnews24.vercel.app/business/iit-madras-student-gets-rs-4-3-crore-job-offer-here-s-a-look-at-big-ticket-placement-offers-made-so-far-at-the-old-iits-this-year",
    "siteurl": "https://worldsnews24.vercel.app/business/iit-madras-student-gets-rs-4-3-crore-job-offer-here-s-a-look-at-big-ticket-placement-offers-made-so-far-at-the-old-iits-this-year",
    "description": "",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115885931/115885931.jpg",
    "description1": "IIT students get big offers this year! Jane Street, a prominent Wall Street trading firm, has extended a remarkable annual salary package of Rs 4.3 crore-plus to a student from the Class of 2025. This offer, which includes base salary, fixed bonus and relocation benefits, sets a new benchmark for the placement season at Indian Institutes of Technology (IITs).The high-frequency trading firm made this pre-placement offer (PPO) to a computer science and engineering student at IIT Madras, who had previously interned with them. ET reported two placement sources as saying that the selected candidate will work as a quantitative trader in Hong Kong.Several prestigious firms have made substantial offers at the older IITs. BlackRock, Glean and Da Vinci have offered packages exceeding Rs 2 crore. APT Portfolio and Rubrik have proposed Rs 1.4 crore-plus, whilst Databricks, Ebullient Securities and IMC Trading have offered Rs 1.3 crore-plus. 115884513Quadeye's package ",
    "description2": "approaches Rs 1 crore, and Quantbox and Graviton have offered Rs 90 lakh. Additional offers include DE Shaw (Rs 66-70 lakh), Pace Stock Broking (Rs 75 lakh), Squarepoint Capital ( Rs 66 lakh plus), Microsoft (Rs 50 lakh plus) and Cohesity (Rs 40 lakh). These figures may differ across institutions, and companies might offer various roles across different IITs.The final placement process commenced on Sunday across the established IITs in Delhi, Bombay, Madras, Kanpur, Roorkee, Kharagpur, Guwahati and BHU.The initial day saw participation from notable recruiters including Qualcomm, Microsoft, Goldman Sachs, Bajaj Auto, Ola Electric, Alphonso and Nutanix. Whilst early high-value offers do not necessarily indicate overall placement success, the current scenario appears more positive compared to the previous year.As reported by the financial daily on Saturday, Jane Street's PPO if accepted will exceed all other offers. The company has not responded to enquiries.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115885931/115885931.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 12:18:24 pm",
    "courtesy": "TOI Business Desk",
    "datePublished": "2024-12-02T10:21:00+05:30",
    "dateModified": "2024-12-02T10:21:00+05:30"
  }
]