[
  {
      "title": "US Gautam Adani Group Bribery Allegations.",
      "source": "a0z8nwxEP4Y",
      "source1": "ScYsgvfLDeE",
      "link":"../crime/us-gautam-adani-group-bribery-allegations",
      "siteurl":"http://localhost:3000/shopping/us-gautam-adani-group-bribery-allegations",
      "description": "US SEC Can’t Summon Directly To Foreign Nationals, To Follow Proper Channel In Gautam Adani Alleged $265 Million Bribery Case.",
      "thumbnail": "https://news24online.com/wp-content/uploads/2024/11/adani.jpg",
      "description1": "The Adani Group has denied the allegations. The group assured their partners, employees and stakeholders, that they are law abiding organization. They said that will comply with all laws. The US Securities and Exchange Commission need to serve the summons on Founder and Chairman of Adani Group Gautam Adani, along with the nephew of Gautam Adani, Sagar, via the proper diplomatic channel. They will need to do this because the US Securities and Exchange Commission has no jurisdiction where he can directly summon them or the foreign national in the alleged USD 265 million payoff case, as per media reports. The US SEC cannot send any foreign nationals anything though post. According to the Hague Convention and the Mutual Legal Assistance treaty which was between India and US in the year 1965, it says a procedure to be followed in such case.",
      "description2": "As per the US SEC notice, within 21 days after this notice is summoned to you, must serve the plaintiff (SEC) an answer to the complaint under the rule 12 of Federal Rules of Civil Procedures. Founder of Adani Group Gautam Adani and seven other defendants, which includes nephew of Gautam Adani and Director at Adani Green Energy Limited Sagar, got allegedly agreed to pay the USD 265 million to the officials of government of India between year 2020 and 2024, to get the contract of Lucrative Solar energy supply. The Adani Group has denied the allegations. The group assured their partners, employees and stakeholders, that they are law abiding organization. They said that will comply with all laws. According to media reports, the investigation began in the year-2022.They allege that Adani group had raised USD 2 billion in loans and bonds by using false and misleading statements.",
      "image": "https://m.economictimes.com/thumb/msid-115608623,width-1200,height-900,resizemode-4,imgsize-40436/gautam-adani-new-ap.jpg",
      "image1": "https://static.toiimg.com/thumb/msid-115596433,width-1280,height-720,resizemode-4/115596433.jpg",
      "mp3": "https://static.nytimes.com/narrated-articles/synthetic/article-78eef104-e647-57ae-b9a4-1c1e1c0aebb9/job-1732442636362/article-78eef104-e647-57ae-b9a4-1c1e1c0aebb9-job-1732442636362.mp3",
      "date": "2024-11-24",
      "time": "21:14 PM",
      "courtesy": "India Today.",
       "datePublished": "2024-04-05",
      "dateModified": "31-05-2024"
    },
    {
      "title": "What does Trump’s win mean for Ukraine? | Ukraine War.",
      "source": "O-xicOsR4Ro",
      "link":"../crime/trumps-win-mean-for-ukraine",
      "siteurl":"http://localhost:3000/shopping/what-does-trump-s-win-mean-for-ukraine-ukraine-war",
      "description": "In his victory speech, president-elect Donald Trump said he was the man who “will stop wars” and make the world a 'safer place' ",
      "thumbnail": "https://i.ytimg.com/vi/O-xicOsR4Ro/maxresdefault.jpg",
       "date": "2024-11-23",
      "time": "21:14 PM",
      "image": "https://cloudfront-us-east-1.images.arcpublishing.com/opb/FVVMKUQWBNE73H4WNGCQTH3GRE.jpg",
      "pod": "https://www.youtube.com/watch?v=i3oX-NPaZ2c&list=PLG8IrydigQffW6a9KQhdtl8C1DwiUD6cb",
      "courtesy": "Sky News",
      "datePublished": "2024-04-05",
      "dateModified": "31-05-2024"
    }
  ]