{
  "videos": [
    {
      "title": "Movie Pushpa 2 - The Rule | Official Trailer",
      "source": "1kVK0MZlbI4",
      "description1": "Pushpa 2 - The Rule - Written and Directed by Sukumar. Produced by Naveen Yerneni and Y. Ravi Shankar of Mythri Movie Makers in association with Sukumar Writings. The film stars Allu Arjun, Fahadh Faasil, Rashmika Mandanna, Dhanunjay, Rao Ramesh, Sunil, Anasuya Bharadwaj & Ajay Ghosh. The film's music is composed by Devi Sri Prasad, with cinematography and editing performed by Miroslaw Kuba Brozek and Navin Nooli respectively.",
      "thumbnail": "https://img.youtube.com/vi/1kVK0MZlbI4/0.jpg",
      "date": "2024-11-20",
      "time": "10:30 AM",
      "courtesy": "T-Series"
    },
     {
      "title": "Entertainment: Movie The Sabarmati Report | Official Trailer",
      "source": "Mjtv0KkgCqM",
      "description": "The Sabarmati Report Box Office Collection Day 7: Vikrant Massey-Starrer Slows Down In Second Week",
      "description1": "'The Sabarmati Report' has slowly seen a growth as the movie completes a week at the box office. While the Friday numbers and the coming weekend numbers will play a huge role, it has made a decent Rs 11 crore in the span of 7 days which is good for a film like The Sabarmati Report may not exactly be doing what Vikrant Massey & previous theatrical release. However, the movie has been getting a lot of word of mouth, which is leading to it remaining consistent in the Rs 1 crore mark everyday. It has not seen any dip below that mark in the last seven days which is a good sign. The film stars Raashii Khanna and Riddhi Dogra alongside Vikrant It opened at Rs 1.25 crore last Friday, saw some growth on day 2 and 3, which was Saturday and Sunday but from Monday onwards, it was back to the Rs 1 crore range. The good part is that due to word of mouth surrounding the film, it has continued to remain steady in the Rs 1 crore range and didn't see a further dip. Infact, there's a slight bit of growth. On Tuesday, it made Rs 1.3 crore, while on Wednesday, the number was around Rs 1.45 crore. On Thursday, it made around Rs 1.1 crore. The total collection of the movie so far is Rs 11.45 crore. As the movie has now been declared tax free in Madhya Pradesh, Chhatisgarh, and now even Haryana, there's a possibility for more footfalls on Friday and over the coming weekend. The film has been having screenings for the Chief Ministers of various states, thus, leading to the spread of word of mouth, which may be seen working in its favour over the coming weekend. Today sees the release of Abhishek Bachchan starrer, I Want To which is also a very niche film, but the early reviews look fabulous and hence, it may start giving competition to, The Sabarmati Report",
      "description2": "The TOI Entertainment Desk is a dynamic and dedicated team of journalists, working tirelessly to bring the pulse of the entertainment world straight to the readers of The Times of India. No red carpet goes unrolled, no stage goes dark - our team spans the globe, bringing you the latest scoops and insider insights from Bollywood to Hollywood, and every entertainment hotspot in between. We don't just report; we tell tales of stardom and stories untold. Whether it's the rise of a new sensation or the seasoned journey of an industry veteran, the TOI Entertainment Desk is your front-row seat to the fascinating narratives that shape the entertainment landscape. Beyond the breaking news, we present a celebration of culture. We explore the intersections of entertainment with society, politics, and everyday life.",
      "thumbnail": "https://img.youtube.com/vi/Mjtv0KkgCqM/0.jpg",
      "image": "https://news24online.com/wp-content/uploads/2024/11/the-sabarmati-report-3.jpg?resize=768,432",
      "image1": "https://static.tnn.in/thumb/msid-115341189,thumbsize-2026941,width-1280,height-720,resizemode-75/115341189.jpg",
      "date": "2024-11-20",
      "time": "10:30 AM",
      "courtesy": "TOI"
    }
  ]
}