[
  {
    "title": "Pushpa 2 movie live updates: Allu Arjun-Sukumar film gears up for record-breaking run",
    "link": "https://worldsnews24.vercel.app/entertainment/pushpa-2-movie-live-updates-allu-arjun-sukumar-film-gears-up-for-record-breaking-run",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/pushpa-2-movie-live-updates-allu-arjun-sukumar-film-gears-up-for-record-breaking-run",
    "description": "Pushpa 2 The Rule Movie Release Date, Advance Booking, Box Office Collection Prediction LIVE Updates: Pushpa's journey that started in December 2019 is finally on its last leg, and it would be interesting to see what the Allu Arjun-Sukumar film ends up becoming.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Pushpa-2-Movie-LIVE.jpg",
    "description1": "Pushpa 2 The Rule movie release live updates: Three years back when Pushpa 1 hit the screens, not many could predict the kind of impact it would have on Indian cinema. The film about the rise of a gutsy nobody to the top echelons of a smuggling syndicate found resonance across the country. Among its many box-office achievements, Pushpa also made history by making Allu Arjun the first male Telugu actor to receive a National Award for Best Actor. In fact, in an interview on Nandamuri Balakrishna’s Unstoppable with NBK, Allu Arjun spoke about how it was very distressing to not see a single male Telugu actor’s name in the Best Actor list, and Pushpa’s role in making history. Finally, the journey that started in December 2021 will come full circle this December as Pushpa 2: The Rule is set to hit theatres on Thursday.  Despite various controversies surrounding Pushpa 2, including a purported tiff between director Sukumar and Allu Arjun, and a public spat between composer Devi Sri Prasad and producers Mythri Movie Makers, the film has been completed, and is gearing up for a blockbuster opening. Major credit to the hype surrounding the film has to go to the in tense promotional drive spearheaded by Allu Arjun and Rashmika Mandanna.",
    "description2": " They kept the movie in the news for the past couple of weeks by relentless promotions in cities like Patna, Kochi, Chennai, Hyderabad, and Mumbai. ALSO READ | Sukumar’s speech at Pushpa 2 Hyderabad event leaves Allu Arjun in tears: ‘Pushpa is not just cinema, it is my…’ Apart from Allu Arjun, other actors who would be reprising their roles from the first installment include Rashmika Mandanna, Fahadh Faasil, Rao Ramesh, Anasuya Bhardwaj, Sunil, Ajay Ghosh, Prathap Bhandari, and Dhananjaya.  ALSO READ | Pushpa 2 Movie: Release date, tickets price, advance booking, box office collection prediction, other details Even as other things changed around them, and the ensemble continued to star in other projects, Sukumar and Allu Arjun were completely focussed on the two Pushpa films, which first went on floors in December 2019 just weeks before the country was shut down due to the global pandemic. Since then, both these top-tier talents have been putting all their efforts to ensure Pushpa is a film that Indian cinema can be proud of. And in a few hours, we’d know if their vision comes true.",
    "image": "https://images.indianexpress.com/2024/12/Pushpa-2-Movie-LIVE.jpg",
    "image1": "https://connectmyindia.com/posts/images/2024/Pushpa-2-Movie-Trailer-Rele.jpg",
    "source": "1kVK0MZlbI4",
    "date": "4/12/2024",
    "time": " Updated 1:20:46 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T08:04:04+05:30",
    "dateModified": "2024-12-04T08:04:04+05:30"
  },
  {
    "title": "Allu Arjun’s Pushpa 2 The Rule ushers in wildfire level of promotions: Is it a one-off or a glimpse into the future?",
    "link": "https://worldsnews24.vercel.app/entertainment/allu-arjun-s-pushpa-2-the-rule-ushers-in-wildfire-level-of-promotions-is-it-a-one-off-or-a-glimpse-into-the-future",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/allu-arjun-s-pushpa-2-the-rule-ushers-in-wildfire-level-of-promotions-is-it-a-one-off-or-a-glimpse-into-the-future",
    "description": "With Allu Arjun, Rashmika Mandanna and team Pushpa 2 The Rule defining the way of promotions for big-ticket films, we look at whether this would pave the way for the future or it is a one-time opportunity that is being used to its fullest.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Allu-Arjun-and-Pushpa-2-The-Rule-redefine-promotions.jpg",
    "description1": "The digital era has simplified a lot of things. Cinema watching isn’t exactly a chore now even if some of the films might make one feel so. You don’t have to walk to the nearby theatre in the hope that your favourite film has tickets to spare. Everything happens in a few clicks and an OTP. Recently, I decided to go old-school and walk to the theatre and book a ticket directly. A middle-aged woman in her 50s walked up to the same ticketing counter asking if a particular film was running in the theatre. When they replied in the negative, she pulled out a newspaper listing and said the ad said otherwise. Now, this helped in recalibrating the urban audience’s belief that accessibility to cinema is at everyone’s fingertips. When you look at the returns of any big-ticket film, it is clear that the non-urban audience maketh the numbers. However, many times this loyal demographic is forgotten to cater to an audience that is seemingly growing distant from the kind of popcorn entertainment every industry dishes out with mind-boggling consistency. Probably why Allu Arjun, team Pushpa 2: The Rule, and Telugu cinema are changing the game. ALSO READ: Pushpa 2 advance booking: Allu Arjun film sells almost 12 lakh tickets; trumps Baahubali, KGF 2 and RRR to sell fastest 1 million tickets Manoj Bajpayee once said that the reason for the success of films like KGF and Pushpa is because the audience are searching for heroes that would tell them all is well, and winning in life will happen even for the ones who have hit rock bottom. This level of aspiration was seen in 1970s and 1980s Indian cinema where the heroes were catering to the masses, who are often overlooked as people whose tastes aren’t ‘refined’ enough. However, that was never the case in South cinema where the biggest of stars redefined the term ‘mass’ and made films that catered to everyone. Even when the characters did unimaginable things that defied all known laws of science, it was still a common man doing it. But there was a chasm between these believers, and their matinee idols. At the turn of the 2010s, Hindi cinema understood the need to bridge this chasm, but the stars continued to remain inaccessible. Yes, they were there on the billboards, the advertisements, the social media campaigns, and of course, on the big screen. But the ‘opportunity’ to see them in flesh and blood was becoming rare for the non-urban audience.  Here's the Pushpa 2 Trailer: Tamil filmmaker Hari, the brain behind films like Singam and Saamy, went to the theatres of Tamil Nadu to promote his film, Yaanai. When asked about the reason behind his action, Hari said, “It is important we let the patrons of the theatre know that our films are reaching them. It is important we respect them as an important stakeholder and urge them to come see our films.” This is an important angle to the debate about watching films in theatres vs watching films on OTT. Of course, it can be argued that the makers make money anyway, and why should the OTT watchers be shamed for watching the films legally on a paid subscription. But before all that, there comes the issue of stars appeasing their audience and not alienating them.  This is probably why South cinema, especially Telugu films, which ignited the pan-Indian cinema of today, continues to reap rich benefits from this phenomenon. Even though recent blockbusters of Hindi cinema made a lot of money all across the country, it was for their original Hindi versions. Almost every star didn't consider all markets as equally important. They might have appeared on podcasts, social media reels, YouTube interviews, and even press interactions in select urban cities. But the returns are there for everyone to see. On the contrary, look at what is happening with the likes of Kalki 2898 AD, Devara Part-1, and the upcoming juggernaut, Pushpa 2.  Pushpa 2: The Rule’s most-recent event happened in Hyderabad with just two days left for the release. But where did they start their promotional campaign? It was in Patna, Bihar. Why should a Telugu film’s trailer be launched in Patna? But seeing the crowd that turned up would have been a massive shot-in-the-arm for whoever devised this strategy. It was a masterstroke. Just a week or so before that Ram Charan and team Game Changer landed in Lucknow to launch the teaser of the Shankar film. The writing was clear on the wall. You want to be a pan-Indian hero, you have to go everywhere to promote your film. You must provide the audience an incentive to come watch your film. And what is that incentive? Respect. When stars descend to understand the ground reality, the support is massive. Allu Arjun was a bonafide superstar even before Sukum",
    "description2": "ar brought Pushpa into his life. But what he is today has been the dream of many a superstar before him. Many achieved it in varying degrees, but Allu Arjun has blazed an important trail. He is walking on a carefully curated path that suits him like a colourful shirt on the torso of Pushpa. Look at how he changed his demeanour and speeches at every leg of the Pushpa’s promotional drive. Well, Allu Arjun is definitely not the first one to go all guns blazing with pan-Indian promotions. Yes, Yash did something similar with his KGF films, but it is important he is back soon to stay in the national consciousness. He has the stardom, but not the cushion of an Arjun who is more than just Pushpa for his fans outside Telugu cinema. Then, we saw Ram Charan, Jr NTR, and SS Rajamouli do it for RRR. We saw Kamal Haasan do it for Vikram. We saw Suriya and team do it for Kanguva. However, most of them couldn't really bridge that gap with audiences of those regions. It wasn't enough to be there, it was important to connect with them. That is why Pushpa 2: The Rule is an important chapter of this changing ecosystem.   In Patna, Allu Arjun paraphrased the iconic “Jhukega nahi” line, and said he will indeed bow down to the love of the people of Bihar. In Kochi, he called himself ‘Mallu Arjun’ and spoke about how Kerala adopted him as their own, and gave rise to the term ‘Allu Arjun Army’. In Tamil Nadu, he called Chennai his home, and spoke about how he always wanted to do a massive function in the city to keep his connection strong with his home of 21 years. In Mumbai, he spoke about how he wanted to shave his beard off and hug his daughter. In Hyderabad, what transpired between an emotional Allu Arjun and Sukumar put to an end the chatter around their reported tiff. And in each of these events Rashmika Mandanna joined him to say just the right things to cater to each audience. She showcased her Hindi speaking skills, her fashion choices, her emotional side, and even touched upon her relationship status in these events. The makers also brought in Sreeleela for the last leg of the promotions that gave a big boost to the music of the film. It was also beautiful how these whirlwind promotions ensured the audience forgot the skirmishes between the producers and composer Devi Sri Prasad. What was beautiful was how Arjun danced with Rashmika only in Mumbai. What was beautiful was how Arjun danced on stage without being asked to in Chennai. Some might have been spontaneous, and some others might have been orchestrated like it was spontaneous. But make no mistake, everything was carefully planned, curated, and delivered like a boss!  It was almost like Allu Arjun, Rashmika and team Pushpa anticipated all the questions that might have been asked in individual interviews in each of these regions, and wrapped it all up in a nice bouquet and gave it to the audience. This move might not always work for every film and every actor, but it has definitely worked for Pushpa 2: The Rule and Allu Arjun. Without giving interviews to the media, be it on YouTube or newspapers, Pushpa 2: The Rule gave its audience an exclusivity that they don’t always get. The people who saw them talk and dance in person were the only ones who got to see it all LIVE. They were the first audience. Whatever got printed, circulated, written online, and shared as YouTube videos were secondary. Imagine that high for an audience who don’t always get to see these stars even this close.  ALSO READ: Making of Pushpa 2: BTS video reveals the true force behind this mass actioner isn’t Allu Arjun or Fahadh Faasil Of course, apart from Patna, even team Pushpa 2: The Rule only reached out to the big cities like Mumbai, Chennai, Hyderabad and Kochi, but in a world where stars are increasingly getting elusive, Allu Arjun and Co proved to the world that there is a path that circumvents the middlemen. A path that takes your film directly to the ones that matter the most… The people who would throng the theatres on the opening weekend even if the prices are jacked up. The people who would queue up on Day 1, burst crackers, light lamps, pour milk, and do everything in their power to celebrate their matinee idol. They might have done it anyway… but why would they put in their hearts and souls in it this time? Because they understand why Pushpa wants to prove to the world that he is not just a fire, but a wildfire… it is all about getting that respect. And when Allu Arjun told Patna that he would bow down to their love and adulation… it wasn’t a dialogue. It was a loud statement. A statement that would find many imitations soon, but that’s okay… because the brand will always belong to Pushpa.",
    "image": "https://images.indianexpress.com/2024/12/Allu-Arjun-and-Pushpa-2-The-Rule-redefine-promotions.jpg",
    "image1": "https://connectmyindia.com/posts/images/2024/Pushpa-2-Movie-Trailer-Rele.jpg",
    "date": "4/12/2024",
    "time": " Updated 1:20:46 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T08:03:55+05:30",
    "dateModified": "2024-12-04T08:03:55+05:30"
  },
  {
    "title": "Vivek Oberoi says he became a businessman after facing Bollywood lobbies: ‘They can’t decide my future, my livelihood is…’",
    "link": "https://worldsnews24.vercel.app/entertainment/vivek-oberoi-says-he-became-a-businessman-after-facing-bollywood-lobbies-they-can-t-decide-my-future-my-livelihood-is",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/vivek-oberoi-says-he-became-a-businessman-after-facing-bollywood-lobbies-they-can-t-decide-my-future-my-livelihood-is",
    "description": "In an exclusive interview, Vivek Oberoi speaks about facing lobbies in the Hindi film industry and how he refused to succumb to them, choosing to turn an entrepreneur by profession and actor by passion. ",
    "thumbnail": "https://images.indianexpress.com/2024/11/Vivek-Oberoi-on-dealing-with-lobbies-in-Bollywood.jpg",
    "description1": "Actor Vivek Oberoi burst on the screen with films such as Company and Saathiya. Establishing himself as an actor who can play the boy-next-door and a dreaded gangster with the same ease, it appeared that the actor was here to stay, but in Bollywood, things can be ephemeral despite talent and hard work. The actor faced a dull phase despite his films working and had to sit at home for a long period of time. Vivek, however, had his Plan B in place all along. Twenty-two years later, Vivek is a successful entrepreneur running multiple businesses across industries, which he juggles with his film career. He lives in Dubai and keeps his passion for acting alive still. In an exclusive conversation with SCREEN, the actor revisits his journey, and his Chocolate Boy era, and also reveals how he had to switch to business to counter the efforts of a lobby that existed within the industry. &nbsp; View this post on Instagram &nbsp; A post shared by Vivek Oberoi (@vivekoberoi)  Also Read: Vivek Oberoi says he became a salesman at age 10 because of his father: ‘It could be electronics, perfumes; I would keep profits’ Talking about facing concerted efforts against him in Hindi film industry, Vivek shared, \"I have done about 67 projects in 22 years, but the industry is a very insecure place. You could be performing well, winning awards, and doing your job as an actor, but at the same time, you can get no work for other reasons. After 2007 when I did Shootout At Lokhandwala, the Ganpat song went viral, I won awards, so I expected a lot of offers, but I didn’t get any. I sat at home for 14 to 15 months after the success of the film. It was only around the 2009 mark when I decided I didn’t want to be completely dependent on this but build my economic independence. I didn’t want to be in a situation where a lobby could decide your future. Somebody could bully you into doing something because they controlled things.\" Sharing how venturing into business gave him the independence he always needed, Vivek also added,",
    "description2": "  \"Business was always a Plan B, and I decided cinema will be my passion. My livelihood should be my business, which helped me earn my independence and get out of that whole trap of lobbies, or having to sell your soul or suck up to somebody that is no great way to live at least for me. Some people make a living out of it but for me, that’s not the case.\" &nbsp; View this post on Instagram &nbsp; A post shared by Vivek Oberoi (@vivekoberoi)  Currently, Vivek has three films in the pipeline and is promoting his firm Solatrio that sells lab-grown diamond jewelry. But sharing one lesson he has learned through his 22-year-long journey in Bollywood, the actor says, \"I was stressed about so many things, took so much tension, it was just not worth it. Life finds its way to sort it out, there is a karmic score - you do good, you will get that back; if you do bad, you will receive it too. Somebody may seem very successful and important, but inside he could be empty, sad, and lonely, that’s their score. Life is about choices, even today if you choose good, your life will start changing from tomorrow. It is we who don’t do things then we blame god and destiny. It's more like we have become human doings rather than human beings.\" He also added, \"I am at an age and stage in my life where money, fame, success, glory are something I have seen a lot. So it's not life-changing anymore.\" Sharing further updates on his professional front, Vivek said, \"On the business front, I am taking Solitario public early next year, I want to go global with it. On the film front, I have three movies signed up, the first one is Masti 4. I am having a lot of fun cracking up between me, Riteish, Aftaab, and Induji, Milap Zaveri is directing it. It's been 20 years since the first one, a lot of friends are coming together. We are shooting in March or April so I guess it should release in 2025. The other 2 are not announced yet but I am excited about them.\"",
    "image": "https://images.indianexpress.com/2024/11/Vivek-Oberoi-on-dealing-with-lobbies-in-Bollywood.jpg",
    "image1": "https://preview.redd.it/vivek-oberoi-says-bollywood-lobbies-pushed-him-to-become-v0-gfu13qbo9s4e1.jpeg?auto=webp&s=dc2ae92461cbce33bfa973aa9d87d44fa1d462d6",
    "date": "4/12/2024",
    "time": " Updated 1:20:46 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T08:03:45+05:30",
    "dateModified": "2024-12-04T08:03:45+05:30"
  },
  {
    "title": "Senna review: Spectacularly silly, Netflix’s big-budget mini-series is the cinematic equivalent of a flat tyre",
    "link": "https://worldsnews24.vercel.app/entertainment/senna-review-spectacularly-silly-netflix-s-big-budget-mini-series-is-the-cinematic-equivalent-of-a-flat-tyre",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/senna-review-spectacularly-silly-netflix-s-big-budget-mini-series-is-the-cinematic-equivalent-of-a-flat-tyre",
    "description": "Senna review: Expensive-looking but shoddily written, Netflix's biographical drama about Ayrton Senna is among the streamer's most disappointing shows of the year. ",
    "thumbnail": "https://images.indianexpress.com/2024/12/senna-review-netflix.jpg",
    "description1": "If nobody were to speak in the new Netflix show Senna, it would immediately warrant at least two extra stars. But each time any of its wafer-thin characters opens their mouths, you’re likely to be overcome by an intense desire to pump the breaks and make a pit stop, or perhaps rewatch Asif Kapadia’s seminal documentary on the subject. Based on the life and career of the legendary Brazilian Formula One driver Ayrton Senna, the six-part biographical drama is flat, uninteresting, and most criminally, boring. It is perhaps the least effective way in which his extraordinary career, and lasting influence, could’ve been commemorated. Starring Gabriel Leone, who, incidentally, has already played a slain race car driver once before — he appeared in a memorable supporting role in Michael Mann’s Ferrari — the show is undone by a kind of storytelling that can only be described as Kabir Khan-coded. Ayrton goes from buzzing around in imaginary race cars as a child to winning go-kart championships in the span of minutes; his talent is unquestionable, his passion is unmatched. He is virtually infallible; outsmarting, outmanoeuvring, and out-performing every rival who dares to create obstacles in his path. What a dull way to create drama. Also read - Sam Bahadur: Meghna Gulzar’s crash course on how not to make a biopic, a dramatic reenactment of a Vicky-pedia page With the unshakeable support of his parents, a teenage Ayrton is sent away to the United Kingdom, where he makes waves in the Formula Ford circuit and catches the attention of F1 ‘principals’. He is immediately hired by a team called Toleman, where he scores several podiums in his debut season. The storytelling in first couple of episodes isn’t economical, it’s indisciplined. The writers appear to be rushing through the beats, without bothering to linger on moments of emotional resonance. Not that there are too many to begin with. For instance, Ayrton’s childhood sweetheart is introduced and dispensed with in about half an hour. During this time, they get married and divorced. Forget examining the psychological impact that this had on Ayrton, the show appears to view this chapter in his life as little more than a speed bump. Netflix’s international programming has been thriving; there are enough examples of crossover hits to suggest that the streamer knows what it’s doing by letting local-language creators operate with relative freedom. But the writing in Senna is so juvenile that a simple interaction can often feel like watching two people from different countries conversing via Google Translate. Every character, including Aryton himself, speaks in exposition. “That bloody idiot’s going over 100 miles per hour on a track he doesn’t know!” one character declares during a dangerous race. \"You are the fastest driver in the history of Formula One,",
    "description2": "\" another character tells Ayrton to his face. Most hilariously, a woman that he hooks up with after his divorce gets out of bed, gazes into the distance, and says, “Down there, three out of three people think they’re royalty. To claim your place here, you have to act like a king.” There is a clap of thunder, and Ayrton replies, “I think it’s going to rain.” He doesn't mean it metaphorically. It’s painful to watch. And it doesn’t get any better as it goes along. If anything, show runner Vicente Amorim doubles down on this style as Ayrton’s personal life takes a back seat over his professional achievements. The racer’s fans would already be familiar with the highlights of his career, and the show checks off each event with a robotic diligence. We witness his exceptional driving skills during rainy weather in Portugal; we watch as he pushes his McLaren to the limits in Monaco; and we automatically take his side when a rivalry emerges between him and his teammate, Alain Prost. The Frenchman's sole purpose, it seems, is to silently glare at Ayrton at different settings, and then to complain about him to the chief of the FISA, Jean-Marie Balestre. These characters are entirely two-dimensional. Prost wants to defeat him on the track, Balestre wants to end his career off it. They do what they do because the show needs them to do it, not because they have any personal motivation to bring him down. There is shockingly little on the page here, and one wonders how something as by-the-numbers as this was green-lit in the first place. It would be unfair to blame the actors; even Daniel Day-Lewis would’ve struggled to polish this material. Leone was set up to fail. He delivers every line with the same earnest optimism, like a child begging their mother to be allowed an extra hour outside. Read more - Supersex review: Sensationalist new Netflix series strips the world’s most infamous porn star down to the bone Perhaps Netflix watched some pre-viz footage of the racing sequences? Heavily inspired by the stylised action in Ron Howard’s Rush, the races in Senna are nearly able rescue the show, but not quite. They’re dynamic, exciting, and unlike the rest of the series, easy to follow. The editing is melodic, the cinematography is evocative. You actually care about the outcome. It’s as if an entirely different team of filmmakers was responsible for the action, which swerves between practical and computer-generated with surprising smoothness. Had the drama around these sequences been even a fraction more engaging, Senna would’ve deserved a recommendation. But as it stands, it’s among the worst high-profile Netflix shows of the year. Senna Showrunner - Vicente Amorim Cast - Gabriel Leone, Kaya Scodelario, Susana Ribeiro, Marco Ricca, Patrick Kennedy, Matt Mella Rating - 1.5/5",
    "image": "https://images.indianexpress.com/2024/12/senna-review-netflix.jpg",
    "image1": "https://dnm.nflximg.net/api/v6/2DuQlx0fM4wd1nzqm5BFBi6ILa8/AAAAQeHDyuCQ4FnRsQmaJ77QvxjG-YSt5MDRxHUQZJFEnQrablFssXUqM19eLb-1HlkJmuBmfkUs_fmsPMq9PN73RhJnNUtg2u5A6y18_WvxfRP3ofELLo3zaVqnl9YluFiVbv7d1PV-qkoTr21dCn9GudG5.jpg?r=0bf",
    "date": "4/12/2024",
    "source": "_jMIULxyT4w",
    "time": " Updated 1:20:46 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T08:02:47+05:30",
    "dateModified": "2024-12-04T08:02:47+05:30"
  },
  {
    "title": "Vikrant Massey says he isn’t ‘retiring’, claims people ‘misinterpreted’ his post: ‘Just want to take some time off’",
    "link": "https://worldsnews24.vercel.app/entertainment/vikrant-massey-says-he-isn-t-retiring-claims-people-misinterpreted-his-post-just-want-to-take-some-time-off",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/vikrant-massey-says-he-isn-t-retiring-claims-people-misinterpreted-his-post-just-want-to-take-some-time-off",
    "description": "Vikrant Massey has clarified his recent social media post, which implied that he is considering retiring from acting. The actor said that he is burnt out and needs a long break to take care of his health.",
    "thumbnail": "https://images.indianexpress.com/2024/11/vikrant-massey-3.jpg",
    "description1": "A day after implying in a social media post that he is retiring from acting after 2025, Vikrant Massey said that his words had been 'misread' by the public. In an interview, Vikrant clarified that he is simply taking a 'break' because he is 'burned out'. He also said that his health has taken a hit, although he didn't specify his ailment. He told News18, “I’m not retiring… Just burned out. Need a long break. Miss home and health is also acting up… People misread it.\" The actor's spokesperson also shared a statement where he said that he is taking a break because his health has \"taken a hit.\" He shared that he wants to improve his craft as he is feeling a \"sense of monotony at the moment.\" He insisted that his post has been \"misinterpreted.\" His statement read, \"Acting is all I can do. And it has given me everything I have. My physical and mental health have taken a hit. I just want to take some time off, want to better my craft. I feel a sense of monotony at the moment. My post has been misinterpreted. That I am quiting or retiring from acting. I want to take some time off to focus on my family and health. I would be back when the time feels right.\" In his social media post on Monday, Vikrant had written, \"The last few years and beyond have been phe",
    "description2": "nomenal…But as I move forward, I realise it’s time to recalibrate and go back home. As a Husband, Father &amp; a Son. And also as an Actor. So, coming 2025, we would meet each other for one last time. Until time deems right.” &nbsp; View this post on Instagram &nbsp; A post shared by Vikrant Massey (@vikrantmassey) &nbsp; Many of Vikrant's colleagues in the film industry wondered why he'd make such an announcement, at what is considered the peak of his career. While some sympathised with him, others, like his Haseen Dillruba co-star Harshvardhan Rane suspected a PR move. \"I’m praying this is just some PR activity forced on him by some filmmaker,” Harshvardhan told Bollywood Bubble. On Monday evening, Vikrant attended a special screening of his film The Sabarmati Report with Prime Minister Narendra Modi and Home Minister Amit Shah, among others. He refused to take questions about his 'retirement'. In 2023, Vikrant delivered the biggest solo hit of his career, the acclaimed drama 12th Fail, directed by Vidhu Vinod Chopra. This month, a behind-the-scenes feature about the making of 12th Fail, titled Zero Se Restart, will be released in theatres. Vikrant broke out with roles on television before starring in films such as A Death in the Gunj and Lootera.",
    "image": "https://images.indianexpress.com/2024/11/vikrant-massey-3.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": " Updated 1:20:46 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T12:42:57+05:30",
    "dateModified": "2024-12-03T12:42:57+05:30"
  },
  {
    "title": "Eminem’s mother Debbie Nelson, the inspiration behind some of his biggest hits, dies at age 69",
    "link": "https://worldsnews24.vercel.app/entertainment/eminem-s-mother-debbie-nelson-the-inspiration-behind-some-of-his-biggest-hits-dies-at-age-69",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/eminem-s-mother-debbie-nelson-the-inspiration-behind-some-of-his-biggest-hits-dies-at-age-69",
    "description": "Eminem's mother Debbie Nelson has passed away at age 69 due to health complications. ",
    "thumbnail": "https://images.indianexpress.com/2024/12/eminem-mom-dead-childhood-3-1733266862560.jpg",
    "description1": "Debbie Nelson, the single mother of rapper Eminem, whose rocky relationship with her son was known widely through his hit song lyrics, has died. She was 69. Eminem’s long-time representative, Dennis Dennehy, confirmed Nelson’s death in an email on Tuesday. He did not provide a cause of death, although Nelson had battled lung cancer. Nelson was born in 1955 on a military base in Kansas. Her fraught relationship with her son, whose real name is Marshall Mathers III, has been no secret since the Detroit rapper became a star. Eminem has disparaged his mother in songs such as the 2002 single “Cleaning Out My Closet.” Eminem sings: “Witnessin’ your mama poppin’ prescription pills in the kitchen. My whole life I was made to believe I was sick when I wasn’t.” In lyrics from his Oscar-winning hit “Lose Yourself” from the movie “8 Mile,” his feelings seem to have simmered, referencing his \"mom’s spaghetti.” The song went on to win best rap song at the 2004 Grammy Awards. Nelson brought and settled a pair of defamation lawsuits over Eminem’s statements about her in magazines and on radio talk shows",
    "description2": ". In her 2008 book, “My Son Marshall, My Son Eminem,” she attempted to set the record straight by providing readers details about the rapper’s early life, writing that Eminem had forgotten the good times they had. “Marshall and I were so close that friends and relatives commented that it was as if the umbilical cord had never been cut,” she wrote. She also detailed her own childhood, describing a violent home life in which her dad’s mother, who she spent summers with, was “the one woman in my large, dysfunctional family to show us kids love. ”In 2004, she was dragged from her car on Eight Mile Road, the street in a Detroit suburb made famous by “8 Mile,” by a 16-year-old who was later sentenced to more than four years in prison. She suffered bruises and a broken foot. The highly acclaimed rapper Eminem won for best hip hop act at the 2024 MTV EMAs and was inducted into the Rock &amp; Roll Hall of Fame in 2022. He announced in October that he was going to be a grandfather, saying his daughter Hailie Jade is pregnant by way of a touching music video that is a tribute to their relationship.",
    "image": "https://images.indianexpress.com/2024/12/eminem-mom-dead-childhood-3-1733266862560.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": " Updated 1:20:46 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T10:22:06+05:30",
    "dateModified": "2024-12-04T10:22:06+05:30"
  },
  {
    "title": "Aamir Khan teams up with multiple Oscar-winning maestro Alfonso Cuarón to promote Laapataa Ladies",
    "link": "https://worldsnews24.vercel.app/entertainment/aamir-khan-teams-up-with-multiple-oscar-winning-maestro-alfonso-cuar-n-to-promote-laapataa-ladies",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/aamir-khan-teams-up-with-multiple-oscar-winning-maestro-alfonso-cuar-n-to-promote-laapataa-ladies",
    "description": "Laapataa Ladies' Oscar bid holds particular significance for Aamir Khan, whose Lagaan remains the most recent Indian film to receive a nomination in the Best Foreign Language Film category.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Laapataa-Ladies-Aamir-Khan-Alfonso-Cuaron.jpg",
    "description1": "Though mainstream Indian cinema has been making waves across the globe with impressive box office numbers, the industry — comprising numerous regional segments — has yet to make a lasting impact at prestigious award events like the Oscars. However, the landscape is gradually evolving, with Indian films making significant inroads into the international festival circuit and earning accolades. A notable example is director Payal Kapadia’s All We Imagine As Light (AWIAL), which has garnered top honours at nearly every festival it has attended this year. Despite its success, AWIAL was passed over as India’s official entry for the Best International Feature Film category at the 97th Academy Awards in favour of Kiran Rao’s Laapataa Ladies. Although AWIAL brought home the Grand Prix — the second-highest award at the Cannes Film Festival after the Palme d’Or — its exclusion as India’s Oscar entry sparked widespread debate. Many pointed to power politics in the selection process, especially since Laapataa Ladies is co-produced by Bollywood superstar Aamir Khan. However, some have argued that Aamir’s involvement could be advantageous, as his star power might draw the attention of members of the Academy of Motion Picture Arts and Sciences (AMPAS), who vote for the awards. Only in SCREEN | Vivek Oberoi says he became a businessman after facing Bollywood lobbies: ‘They can’t decide my future, my livelihood is…’ Strengthening this argument, a report has emerged that Aamir has joined forces with multiple Oscar-winning Mexican filmmaker Alfonso Cuarón for Laapataa Ladies' (released internationally as Lost Ladies) Academy Awards campaign. Cuarón, known for films like Y Tu Mamá También (2001), Harry Potter and the Prisoner of Az",
    "description2": "kaban (2004), Children of Men (2006), Gravity (2013) and Roma (2018), and the series Disclaimer (2024), will host a special screening of the film in London. Notably, Cuarón’s Roma won the Best International Feature Film Oscar in 2018, the same category in which Laapataa Ladies now competes. This Oscar bid holds particular significance for Aamir Khan, whose Lagaan (2001) remains the most recent Indian film to receive a nomination in the Best Foreign Language Film category, following Mother India (1957) and Salaam Bombay! (1988). Reflecting on the campaign process, Aamir told Variety, \"Your effort is to get your film seen by them (members of the Academy), and their attention onto your film. And then once they see it, it’s really up to them. That’s what we did in Lagaan. That’s what we’re doing here.\" Check out | Inside Ananya Panday’s home: Chunky Panday says daughter ‘destroyed’ their home during parties, but is ‘particular’ about hers Cuarón is set to host a screening of Laapataa Ladies in London on December 5. \"It just shows that there are different filmmakers around the world who are willing to champion the film,\" Jyoti Deshpande of Jio Studios, who co-produced the movie with Aamir and director Kiran, said. \"India has done a lot for the global film industry, in terms of the number of films it makes, the number of languages we have, how rich in culture we are… I think India has come of age and deserves to win an Oscar.\" Meanwhile, the overlooked AWIAL continues its phenomenal run on the festival circuit, collecting more prestigious awards with each outing. Just recently it won the Best International at the New York Film Critics Circle and the Best International Feature trophy at the reputed Gotham Awards 2024.",
    "image": "https://images.indianexpress.com/2024/12/Laapataa-Ladies-Aamir-Khan-Alfonso-Cuaron.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": " Updated 1:20:46 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T10:11:56+05:30",
    "dateModified": "2024-12-04T10:11:56+05:30"
  },
  {
    "title": "Pushpa 2 The Rule: Allu Arjun-starrer crosses Rs 100 crore mark in advance bookings; overtakes RRR, KGF 2, Baahubali 2",
    "link": "https://worldsnews24.vercel.app/entertainment/pushpa-2-the-rule-allu-arjun-starrer-crosses-rs-100-crore-mark-in-advance-bookings-overtakes-rrr-kgf-2-baahubali-2",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/pushpa-2-the-rule-allu-arjun-starrer-crosses-rs-100-crore-mark-in-advance-bookings-overtakes-rrr-kgf-2-baahubali-2",
    "description": "Allu Arjun, Rashmika Mandanna, and Fahadh Faasil-starrer Pushpa 2: The Rule has achieved a remarkable milestone, crossing the Rs 100 crore mark in advance bookings, setting the stage for a blockbuster opening.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Pushpa-2-advance-booking-day-1-01122024.jpg",
    "description1": "Alllu Arjun, Rashmika Mandanna and Fahad Faasil's 's Pushpa 2: The Rule, directed by Sukumar, is set to hit the screens worldwide on Thursday, December 5. With over 12,000 screens ready for release in multiple formats, the movie has created immense buzz. The highly anticipated film has already witnessed a staggering advance booking of over Rs 100 crore, shattering its previous records. According to industry tracking website Sacnik, Sukumar's directorial venture has achieved a remarkable feat in advance bookings. The film has grossed over Rs 30 crore in overseas pre-sales, while domestic sales have exceeded Rs 70 crore, including early premieres on December 4 evening. This impressive performance has propelled Pushpa 2: The Rule to become the second Indian movie of 2024 to surpass Rs 100 crore in worldwide advance booking gross for the first day, following Prabhas' Kalki 2898 AD. This impressive feat has catapulted Pushpa 2: The Rule to the top of the advance booking charts, surpassing the likes of Baahubali 2: The Conclusion and KGF: Chapter 2. The film's pre-sales have also eclipsed those of SS Rajamouli's RRR, which had raked in Rs 58.73 crore in advance booking. The makers of the film, Mythri Movie Makers, took to social media to share the exciting news, announcing that Pushpa 2: The Rule has already crossed the Rs 100 crore mark globally in its earnings from advanced bookings. Taking to Instagram, th",
    "description2": "ey wrote, \"#Pushpa2TheRule crosses the 100 CRORES mark with advance bookings 💥💥💥 THE BIGGEST INDIAN FILM is on a record breaking spree ❤‍🔥#RecordsRapaRapAA 🔥🔥.\" &nbsp; View this post on Instagram &nbsp; A post shared by Pushpa (@pushpamovie) Notably, Pushpa 2: The Rule has already become Allu Arjun's biggest domestic and worldwide opener, with pre-sales alone. The actor's previous best starter was Pushpa: The Rise, which opened to approximately Rs 64 crore gross worldwide, including around Rs 53 crore in India. Industry insiders predict that Pushpa 2: The Rule is poised to achieve a record-breaking start in India, with estimates suggesting a Rs 200 crore-plus gross opening. Worldwide, the film's opening could reach as high as Rs 300 crore, another record for an Indian title. Produced by Mythri Movie Makers and Sukumar Writings, Pushpa 2: The Rule is undoubtedly one of the most highly anticipated films of the year. Pushpa 2: The Rule continues the story of Pushpa Raj, played by Allu Arjun. The sequel is expected to explore his marriage to Srivalli, played by Rashmika Mandanna, and his enmity with Bhanwar Singh Shekawat, played by Fahadh Faasil. With its impressive advance booking numbers and positive word-of-mouth, it's clear that Pushpa 2: The Rule is poised for box office domination. The film is expected to break multiple records and cement its place as one of the highest-grossing films this year.",
    "image": "https://images.indianexpress.com/2024/12/Pushpa-2-advance-booking-day-1-01122024.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": " Updated 1:20:46 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T10:11:18+05:30",
    "dateModified": "2024-12-04T10:11:18+05:30"
  },
  {
    "title": "Maroon 5’s Adam Levine brings emotional fan on stage at Mumbai concert, she hugs him and says, ‘you’ve been the journey of my life’",
    "link": "https://worldsnews24.vercel.app/entertainment/maroon-5-s-adam-levine-brings-emotional-fan-on-stage-at-mumbai-concert-she-hugs-him-and-says-you-ve-been-the-journey-of-my-life",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/maroon-5-s-adam-levine-brings-emotional-fan-on-stage-at-mumbai-concert-she-hugs-him-and-says-you-ve-been-the-journey-of-my-life",
    "description": "A fan hugged Adam Levine and thanked him and Maroon 5 for being a part of her life's journey. She said, \"I love all your songs. You've been the journey of my life. Thank you so much.\" See here:",
    "thumbnail": "https://images.indianexpress.com/2024/12/Maroon-5-Mumbai-concert.jpg",
    "description1": "Grammy Award-winning American pop rock band Maroon 5 made their India debut with a power-packed performance at Mumbai's Mahalaxmi Race Course on Tuesday. The concert, which was part of their world tour, saw the band perform some of their biggest hits, including \"Girls Like You\" and \"Moves Like Jagger\". One of the most memorable moments of the evening came when frontman Adam Levine invited an emotional fan, Suman, on stage. Suman, who was visibly overwhelmed, hugged Levine and thanked him for being a part of her life's journey. \"I love all your songs. You've been the journey of my life. Thank you so much,\" she said, as Levine hugged her back and thanked her for her kind words. Watch the video here: &nbsp; View this post on Instagram &nbsp; A post shared by BookMyShow.Live (@bookmyshow.live) The band, which was originally formed in 1994 as Kara's Flowers, has evolved into a pop-rock powerhouse over the years. Their debut album, \"Songs About Jane\", won a Grammy Award for Best New Artist in 2005. The band's current lineup includes Adam Levine (vocals), Jesse Carmichael (keyboard), James Valentine (guitar), Matt Flynn (drums), PJ Morton (keyboard), and Sam Farrar (bass). In a behind-the-scenes video posted by the concert organisers, BookMyShow, the band members expressed their love for Mumbai and India. \"We ",
    "description2": "love India, we have been here once before, quickly, this is our first real show with the band. So we are stoked to be here,\" they said. When asked what took them so long to perform in India, they replied, \"It's exciting when people see us for the first time, because most people who know us from the records and the live shows is a little bit different. It's a little more high energy, more rock and roll.\" &nbsp; View this post on Instagram &nbsp; A post shared by BookMyShow.Live (@bookmyshow.live) The concert was attended by several celebrities from the Indian film industry, including Telugu actress Kajal Agarwal and her husband, Ritwik Bhowmik and others. The official Instagram handle of the band reposted several fan videos and photos from the concert, including a cute video of a kid listening to Maroon 5's \"Animals\" at home, with the caption stating, \"Alas, wish there was no age limit for @maroon5's Mumbai concert today (laughing with tears emoji).\" &nbsp; View this post on Instagram &nbsp; A post shared by BookMyShow.Live (@bookmyshow.live) Maroon 5's maiden performance in India dates back to 2019, but it wasn't a public concert. Instead, the band performed at a private event in Mumbai, specifically at the wedding reception of Mukesh Ambani and Nita Ambani's son Akash Ambani and his bride Shloka Mehta.",
    "image": "https://images.indianexpress.com/2024/12/Maroon-5-Mumbai-concert.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": " Updated 1:20:46 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T09:04:06+05:30",
    "dateModified": "2024-12-04T09:04:06+05:30"
  },
  {
    "title": "Payal Kapadia’s All We Imagine as Light wins best international film at New York Film Critics Circle",
    "link": "https://worldsnews24.vercel.app/entertainment/payal-kapadia-s-all-we-imagine-as-light-wins-best-international-film-at-new-york-film-critics-circle",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/payal-kapadia-s-all-we-imagine-as-light-wins-best-international-film-at-new-york-film-critics-circle",
    "description": "Earlier this year, Payal Kapadia's All We Imagine as Light, starring Kani Kusruti, Divya Prabha and Chhaya Kadam, won the prestigious Grand Prix at the Cannes Film Festival.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Payal-Kapadia-All-We-Imagine-New-York-Film-Critics-Circle.jpg",
    "description1": "Filmmaker Payal Kapadia's All We Imagine as Light has won the Best International at the New York Film Critics Circle. The update was shared by US-based portal Deadline. The outlet also reported that the Best Animated Feature award went to Gints Zilbalodis' Flow. This is the 90th anniversary of NYFCC whose members include Indiewire's David Ehlrich (2024 vice chair) and Kate Erbland, New York Magazine's Alison Wilmore and Bilge Ebiri, The Atlantic's David Sims (2024 chair), and Time's Stephanie Zacharek. Express Opinion | All We Imagine As Light: On Mumbai’s trains, the small, warm world of women Notably, on Monday, All We Imagine as Light won Best International Feature trophy at the reputed Gotham Awards 2024. Other nominees in the category incl",
    "description2": "uded, Green Border, Hard Truths, Inside the Yellow Cocoon Shell and Vermiglio. The Gothams Film Awards were held at Cipriani Wall Street on Monday in New York. Starring Kani Kusruti, Divya Prabha and Chhaya Kadam, the film is an official Indo-French co-production between petit chaos from France and Chalk &amp; Cheese and Another Birth from India. Watch All We Imagine as Light director Payal Kapadia at Express Film Club by SCREEN here: The film follows Prabha, a troubled nurse who receives an unexpected gift from her estranged husband, and Anu, her young roommate seeking intimacy with her boyfriend. A trip to a beach town allows them to confront their desires. Earlier this year, the film won the prestigious Grand Prix at the Cannes Film Festival.",
    "image": "https://images.indianexpress.com/2024/12/Payal-Kapadia-All-We-Imagine-New-York-Film-Critics-Circle.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": " Updated 1:20:46 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T08:36:37+05:30",
    "dateModified": "2024-12-04T08:36:37+05:30"
  },
  {
    "title": "'Euphoria' season 3 to premiere in 2026, 'The White Lotus' all set to return on this date",
    "link": "https://worldsnews24.vercel.app/entertainment/euphoria-season-3-to-premiere-in-2026-the-white-lotus-all-set-to-return-on-this-date",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/euphoria-season-3-to-premiere-in-2026-the-white-lotus-all-set-to-return-on-this-date",
    "description": "'Euphoria' season 3 to premiere in 2026, 'The White Lotus' all set to return on this date",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204034842.jpg",
    "description1": "\n\n\nWashington [US], December 4 (ANI): The wait is finally over as the makers of 'Euphoria' have announced the release date for the long-awaited third season of the popular drama, reported E! Online.\nThe third season of 'Euphoria' will finally premiere in 2026, according to Warner Bros. Discovery global streaming chief JB Perrette.\n\nIn the meantime, HBO has announced that 'The White Lotus' will return for the third season in February 2025.\nWhile 'Euphoria''s second season received critical praise, season three had to face several issues due to the 2023 WGA and SAG-AFTRA strikes. When shooting begins in January, a few prominent faces will be missing, notably Angus Cloud, who died in July 2023, and Storm Reid, who recently announced her departure from the series.\nThe series has become a cultural phenomenon since its debut in 2019, with Zendaya's portrayal of Rue, a teenager struggling with addiction, earning widespread acclaim.\nSeason 2, which aired in 2022, ended on a dramatic and emotional note, with the death of beloved character Ashtray (played by Javon Walton) and the uncertain fate of Fezco (played by the late Angus Cloud).\nRue's struggle with sobriety was also left unresolved, adding to the anticipation surrounding the next season.\nThe tragic death of Cloud, who passed away in August 2023 at the age of 25 following an accidental drug overdose, has left fans grieving and questioning the future of his character, Fez.\nIn addition to the loss of Cloud, the departure of Barbie Ferreira, who portrayed Kat Hernandez, has raised questions about the direction of the series.\n\n\nFerreira bid farewell to the show on social media with ",
    "description2": "an emotional message, leaving fans wondering whether her character would be written out of the storyline.\nDespite these challenges, the rest of the cast, including Jacob Elordi, Sydney Sweeney, Alexa Demie, and Hunter Schafer, are expected to return.\nThe Emmy-winning anthology series 'The White Lotus', produced by Mike White, will have a mostly new cast, while Natasha Rothwell will return as spa staffer Belinda from the first season. Jennifer Coolidge, Aubrey Plaza, and Theo James are unlikely to return.\nSeason 3 of The White Lotus is set in Thailand and will feature a new group of guests at another White Lotus resort.\nThe first season of The White Lotus, which aired in July 2021 and was set in Hawaii, earned 20 Emmy nominations in 13 categories and won ten awards, including Outstanding Limited or Anthology Series.\nThe second season, set in Sicily and premiering in December 2022, received 23 Emmy nominations, including Outstanding Drama Series, and won five awards, such as Outstanding Supporting Actress in a Drama Series for Coolidge and Outstanding Casting for a Drama Series.\nCreated, written, and directed by Mike White, 'The White Lotus' is executive produced by White, David Bernad, and Mark Kamine.\nSeason three will feature Patrick Schwarzenegger and Natasha.\n\"To work with Mike White and just to be a part of this project was a dream come true,\" said actor Patrick Schwarzenegger, adding, \"It was surreal, it was life-changing to learn amongst the other actors. It was incredible. I can't wait for it to come out.\"\nLeslie Bibb, Parker Posey, Jason Isaacs and Walton Goggins are also part of the series, reported E! Online. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204034842.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:20:46 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
 
  {
    "title": "Demi Moore opens up about self-acceptance, aging at Gotham Awards",
    "link": "https://worldsnews24.vercel.app/entertainment/demi-moore-opens-up-about-self-acceptance-aging-at-gotham-awards",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/demi-moore-opens-up-about-self-acceptance-aging-at-gotham-awards",
    "description": "Demi Moore opens up about self-acceptance, aging at Gotham Awards",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241203182507.jpg",
    "description1": "\n\n\nLos Angeles [US], December 3 (ANI): Actress Demi Moore recently opened up about her journey of self-acceptance and her efforts to set a positive example for her daughters.\nSpeaking to PEOPLE at the 2024 Gotham Awards on Dec. 2, the 62-year-old actress revealed how her middle daughter, Scout Willis, has inspired her perspective on life.\n\nRecalling a conversation with Scout, Demi said, \"My middle daughter Scout, in many of our conversations, she kind of succinctly put it. She said, 'I want to quit wasting time focusing on all that I'm not when I could be celebrating all that I am.'\"\n\n\nDemi, who shares daughters Rumer, 36, Scout, 33, and Tallulah, 30, with her ex-husband Bruce Willis, spoke about how aging has changed her views. She also spoke about her past judgments about herself and how she has shifted to a more accepting outlook.\n\"I don't know if",
    "description2": " I would contextualize it just around aging as much as looking at the idea of how, over the course of my whole life. How much I have had judgment against myself that I can look back and go, 'At 20, at 30,\" Demi said.\nThe G.I. Jane star further added, \"I was finding things that weren't good enough... and so my relationship with it now is much more in a joyous acceptance.\"\nDemi also shared, \"I mean, of course, there's things that you go, 'I wish that was not that way.' But in terms of the whole, I see myself in the fullness of who I am as opposed to just the external idea of who I am.\"\nThe actress recently showed her support for Scout during a live performance at The Loft in New York City's City Winery on Nov. 15. Demi shared the moment on her Instagram Stories, writing, \"@scoutlaruewillis live in NYC\" as Scout performed her song \"Over and Over.\" (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241203182507.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:20:46 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "Sabrina Carpenter, Barry Keoghan break up after year-long relationship",
    "link": "https://worldsnews24.vercel.app/entertainment/sabrina-carpenter-barry-keoghan-break-up-after-year-long-relationship",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/sabrina-carpenter-barry-keoghan-break-up-after-year-long-relationship",
    "description": "Sabrina Carpenter, Barry Keoghan break up after year-long relationship",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204032254.jpg",
    "description1": "\n\n\nWashington [US], December 4 (ANI): Singer and songwriter Sabrina Carpenter and actor Barry Keoghan have reportedly split up after one year of dating, reported E! Online.\nHowever, as per the outlet, Sabrina and Barry have not shared any official updates on their relationship.\n\nThe rumours about their relationship first started in December 2023, when they were seen having dinner together in Los Angeles. Sabrina and Barry made their red carpet debut by posing together at the 2024 Met Gala.\n\n\nSince then, the two have not been shy about showing their bond. The 'Nonsense' singer invited the actor to appear in t",
    "description2": "he music video for her smash song 'Please Please Please' back in June.\n\"I was like, 'Who's the greatest actor that I can find for this music video?'\" Sabrina said of casting Barry in the role, adding, \"And he was next to me in a chair. And he was so excited about it.\"\nBarry also supported her many times and was all praise for her while looking at her performance during Taylor Swift's Eras Tour.\n\"I'm in awe watching her work and how committed and the standards that she sets,\" Barry said. \"Especially being on that music video. She knows the vision, she knows what she wants,\" he added, reported E! Online. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204032254.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:20:46 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "Mindy Kaling, Morris Chestnut to present Golden Globes nominations",
    "link": "https://worldsnews24.vercel.app/entertainment/mindy-kaling-morris-chestnut-to-present-golden-globes-nominations",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/mindy-kaling-morris-chestnut-to-present-golden-globes-nominations",
    "description": "Mindy Kaling, Morris Chestnut to present Golden Globes nominations",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241203181429.jpg",
    "description1": "\n\n\nLos Angeles [US], December 3 (ANI): Stars Mindy Kaling and Morris Chestnut have come on board to present the nominees for the 82nd Annual Golden Globes.\nAs per Deadline, the nominees broadcast is scheduled to be held on December 9 on CBS. Kaling and Chestnut will present the nominees for each of the 27 award categories.\n\nCinematic and Box Office Achievement in Motion Pictures and Best Performance in Stand-Up Comedy on Television are the two new awards categories that will be presented this year.\n\n\nOther competitive categories include the film categories: Best Motion Picture - Drama, Best Motion Picture - Musical or Comedy, and Best Motion Picture - Animated. TV categories include Best Television Series - Drama, Best Television Series - Musical or Comedy, and Best Television Limited Series.\nPrevious presenters of the Golden Globes nominations include Alfre Woodard, America Ferrera, Angela Bassett, Anna Kendrick, Cedric \"The Entertainer,\" Chloe Grace Moretz,",
    "description2": " Christian Slater, Dakota Fanning, Danai Gurira, Dennis Quaid, Don Cheadle, and Garrett Hedlund.\nAlso, this time audience will see Comedian Nikki Glaser as the host for the next edition of Golden Globe Awards.\nGlaser will host the 82nd annual Golden Globes in January 2025, The Hollywood Reporter reported.Excited about it, Glaser in a statement said, \"I am absolutely thrilled to be hosting the Golden Globes. It's one of my favorite nights of television and now I get a front row seat (actually, I think I have to host from the stage).\"\nShe added, \"The Golden Globes is not only a huge night for TV and film, but also for comedy. It's one of the few times that show business not only allows, but encourages itself to be lovingly mocked (at least I hope so). (God I hope so). It's an exciting, yet challenging gig because it's live, unpredictable, and in front of Hollywood's biggest stars (who also might be getting wasted while seated next to their recent exes).\" (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241203181429.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:20:46 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "Sara Ali Khan spotted at Mumbai airport in chic style",
    "link": "https://worldsnews24.vercel.app/entertainment/sara-ali-khan-spotted-at-mumbai-airport-in-chic-style",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/sara-ali-khan-spotted-at-mumbai-airport-in-chic-style",
    "description": "Sara Ali Khan spotted at Mumbai airport in chic style",
    "thumbnail": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20241203180543.jpg",
    "description1": "\n\n\nMumbai (Maharashtra) [India], December 3 (ANI): Actor Sara Ali Khan was spotted at the Mumbai airport on Tuesday, where her choice of accessories became a talking point.\nThe actress was seen pairing her chic outfit with a rudraksha mala, giving her look a spiritual touch.\n\n\n\nIn a video shared by paps, the actress was seen in a white crop top and beige pants which she accessorized with sunglasses and the rudraksha mala. Sara was seen greeting paps with a warm smile as they captured h",
    "description2": "er at the airport.\n\n\n\nMeanwhile, Sara Ali Khan is set to share screen space with Ayushmann Khurrana for the first time in an upcoming untitled action-comedy.\nThe film will be produced by Karan Johar's Dharma Productions and Guneet Monga's Sikhya Entertainment. They are uniting once again for their third theatrical collaboration.\nThe film, yet to be named, will be directed by Aakash Kaushik.\nApart from this, Sara will be seen in 'Metro...In Dino', which is directed by Anurag Basu. (ANI)\n",
    "image": "https://aniportalimages.s3.amazonaws.com/media/details/ANI-20241203180543.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:20:46 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "Payal Kapadia's 'All We Imagine as Light' wins best international film at New York Film Critics Circle",
    "link": "https://worldsnews24.vercel.app/entertainment/payal-kapadia-s-all-we-imagine-as-light-wins-best-international-film-at-new-york-film-critics-circle",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/payal-kapadia-s-all-we-imagine-as-light-wins-best-international-film-at-new-york-film-critics-circle",
    "description": "Payal Kapadia's 'All We Imagine as Light' wins best international film at New York Film Critics Circle",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241203180132.jpg",
    "description1": "\n\n\nNew York [US], December 3 (ANI): Filmmaker Payal Kapadia's 'All We Imagine as Light' has won the Best International at the New York Film Critics Circle.\nThe update was shared by US-based portal Deadline. The outlet also reported that the Best Animated Feature award went to Gints Zilbalodis' Flow.\n\nThis is the 90th anniversary of NYFCC whose members include Indiewire's David Ehlrich (2024 vice chair) and Kate Erbland, New York Magazine's Alison Wilmore and Bilge Ebiri, The Atlantic's David Sims (2024 chair), and Time's Stephanie Zacharek.\n\n\nNotably, on Monday, 'All We Imagine as Light' won Best International Feature trophy at the reputed Gotham Awards 2024. Other nominees in ",
    "description2": "the category included, Green Border, Hard Truths, Inside the Yellow Cocoon Shell and Vermiglio. The Gothams Film Awards were held at Cipriani Wall Street on Monday in New York.\nStarring Kani Kusruti, Divya Prabha and Chhaya Kadam, the film is an official Indo-French co-production between petit chaos from France and Chalk & Cheese and Another Birth from India.The film follows Prabha, a troubled nurse who receives an unexpected gift from her estranged husband, and Anu, her young roommate seeking intimacy with her boyfriend. A trip to a beach town allows them to confront their desires.\n.Earlier this year, the film' won the prestigious Grand Prix at the Cannes Film Festival. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241203180132.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:20:46 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "Shahana Goswami, director Kanu Behl open up about their film 'Despatch'",
    "link": "https://worldsnews24.vercel.app/entertainment/shahana-goswami-director-kanu-behl-open-up-about-their-film-despatch",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/shahana-goswami-director-kanu-behl-open-up-about-their-film-despatch",
    "description": "Shahana Goswami, director Kanu Behl open up about their film 'Despatch'",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241203180524.jpg",
    "description1": "\n\n\nMumbai (Maharashtra) [India], December 3 (ANI): Actor Manoj Bajpayee is set to return with 'Despatch', a gripping investigative crime thriller that will premiere on ZEE5 on December 13.\nDirected by Kanu Behl and produced by Ronnie Screwvala's RSVP Movies, the film follows the journey of Joy Bag, a crime journalist who gets caught in a dangerous investigation while chasing a breaking story.\n\nThe film debuted at the MAMI Film Festival 2024 and was later showcased at the 55th International Film Festival of India (IFFI).\nThe trailer, released recently, shows Bajpayee's character, Joy Bag, navigating the murky world of media corruption and criminal underworld. His pursuit of uncovering a massive scam turns into a perilous journey as unknown threats mount against him. The trailer hints at a thrilling tale of truth versus survival.\nThe story not only follows Bajpayee's character, Joy Bag, as he navigates a dangerous investigation but also explores his troubled marriage.\n\n\nActor Shahana Goswami, who plays Manoj Bajpayee's wife in the upcoming crime thriller Despatch, opened up about her role in the film in a conversation with ANI.\nWhile speaking about her character, the actress said, \"Dekhie kya hota hain na aise situations me ek kisi ka dor kaatna zaruri hojata hain kyuki dono taraf se jo ek pull and push hota ha",
    "description2": "in na usme bhi uski ek adath pad jaati hain. Toh kahin ek moment hota hain ek mauka hota hain.kabhi kabhi koi zid me karleta hain. Abhi wo us makaam pe hain ki wo karega bhi nahin Puri tarah se jabtak ki dusri taraf pura settle na hojae. Toh kahin ek pull and push rhta hain toh I think wo uske khudke zindagi, Shweta ke lie zaroori tha.\"\nDirector Kanu Behl, speaking about the inspiration for Despatch, said, \"In 2016, I started thinking about the world of crime journalism. Incidents like the ones involving Gauri Lankesh disturbed me deeply. As a father of a five-year-old, I wondered what kind of world we are leaving behind for the next generation. My son's name is Duniya (world), and somewhere, this thought triggered the story. I felt this was something that needed to be talked about.\"\nArrchita Agarwaal, who is also a part of the cast, shared her excitement about working with Bajpayee and director Behl. She said, \"I feel very lucky that Manoj sir is part of this film. He has so much experience, but he created a space for me where I felt comfortable. With Kanu sir's guidance, I only had to learn. I started from zero, and everything I gained from this film was an achievement.\"\nApart from Manoj Bajpayee in the lead role, the movie also features Shahana Goswami, Arrchita Agarwaal, and others in crucial roles. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241203180524.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:20:46 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "Allu Arjun and Rashmika Mandanna’s Pushpa 2 is inching towards Rs 20 crore mark for premiere shows in USA",
    "link": "https://worldsnews24.vercel.app/entertainment/allu-arjun-and-rashmika-mandanna-s-pushpa-2-is-inching-towards-rs-20-crore-mark-for-premiere-shows-in-usa",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/allu-arjun-and-rashmika-mandanna-s-pushpa-2-is-inching-towards-rs-20-crore-mark-for-premiere-shows-in-usa",
    "description": "Allu Arjun and Rashmika Mandanna’s Pushpa 2 is inching towards Rs 20 crore mark for premiere shows in USA",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115959792/115959792.jpg",
    "description1": "Telugu cinema this year has witnessed massive hits like Hanu-Man, Tillu Square, Devara Part 1, and Kalki 2898 AD. The industry is now looking to end the year with another blockbuster—Allu Arjun and Rashmika Mandanna’s Pushpa 2: The Rule. The film is the highly anticipated sequel to the 2021 blockbuster Pushpa: The Rise, which earned Allu Arjun the National Award for Best Actor.https://www.youtube.com/watch?v=CFZdRigM11k&list=PLCo1aK6_bK23fRdIp2pnyUGyX5Clu_K0bThe film is set to release worldwide tomorrow, and the excitement is palpable. According to current trends, the film has already sold tickets worth nearly Rs 79 crore in India for its first day, including block bookings and the trade is expecting the film to hit Rs 100 crore mark before the day ends.. In the United States, which over the past few years has become a big market for Tel",
    "description2": "ugu films, Pushpa 2 is also creating a significant buzz, nearing theRs ₹20 crore mark for its premiere day shows. As per trends, the film has already earned $2.2 million( Rs 19.32 crore) from almost 4,000 shows, selling over 80,000 tickets.The record for the biggest premiere day sale of 2024 belongs to Prabhas’ Kalki 2898 AD, which earned $3.9 million in North America. It will be interesting to see if Allu Arjun can surpass that figure. Pushpa 2 has already become Allu Arjun's biggest premiere day sale in the circuit, and before the final shows begin, the film is expected to hit at least $3 million, making it the third-biggest premiere day opening for a Telugu film this year, after Kalki 2898 AD and Devara Part 1.The film also boasts an impressive ensemble cast, including Rashmika Mandanna, Fahadh Faasil, Jagapathi Babu, and Prakash Raj.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115959792/115959792.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:20:46 pm",
    "courtesy": "TOI Entertainment Desk",
    "datePublished": "2024-12-04T10:52:00+05:30",
    "dateModified": "2024-12-04T10:52:00+05:30"
  },
  {
    "title": "Sidharth Malhotra and Kiara Advani's UNSEEN snap with a child goes viral",
    "link": "https://worldsnews24.vercel.app/entertainment/sidharth-malhotra-and-kiara-advani-s-unseen-snap-with-a-child-goes-viral",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/sidharth-malhotra-and-kiara-advani-s-unseen-snap-with-a-child-goes-viral",
    "description": "Sidharth Malhotra and Kiara Advani's UNSEEN snap with a child goes viral",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115958706/115958706.jpg",
    "description1": "The most loved couple in Bollywood, Sidharth Malhotra and Kiara Advani has raised eyebrows as an unseen snap of both posing with a child is now making the rounds on social media.115900064Shared by Instant Bollywood, the picture features Kiara and Sidharth posing together with a charming kid. Kiara is seen wearing casual attire and is looking simply radiant as always. In the viral snap, Sidharth Malhotra is seen posing from behind and looking dapper in a brown sweater and matching pants.115902905 The picture of Sidharth and Kiara quickly took the netizens’ attention with several posting comments with heart emojis. One commented, “Cutest Bollywood couples.” Another commented, “Princess !!!.” A third one commented, “Such an adorable snap.”115958706Meanwhile, on the work front, Kiara has the most awaited Yash starrer ‘Toxic’ which is directed by the Malayalam filmmaker Geethu Mohandas and the expectations are quite high for the action drama movie. Kiara also has the highly awaited ‘War 2’ in the pipeline where she will be playing the female lead opposite",
    "description2": " Hrithik Roshan. The movie also features the ‘Devara’ actor Jr NTR in a pivotal role. Adding to her most awaited upcoming movies list, Kiara will be also seen in Shankar’s big budget film ‘Game Changer’ starring the ‘RRR’ actor Ram Charan in the lead.On the other hand, Sidharth Malhotra was last seen in the action flick ‘Yodha’. ETimes rated the film 3 out of 5 and our review read, “After the reel-life portrayal of the war hero Vikram Batra in Shershaah, Sidharth returns as commando Arun Katyal in Yodha, showcasing his competence as an action hero. The movie majorly rests on his shoulders. Raashii Khanna pulls off the part of playing Arun's love interest with ease. Disha Patani plays a pivotal role as an air hostess caught amid the hostage drama. Tanuj Virwani, another commando of the special task force, makes his presence felt in his limited role. Sunny Hinduja pulls off his role with confidence. All said, Yodha’s action is thrilling, but it does not really take your imagination to the flight.”Sidharth will be next seen in the thriller ‘Vvan-Force’. ",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115958706/115958706.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:20:46 pm",
    "courtesy": "TOI Entertainment Desk",
    "datePublished": "2024-12-04T10:19:00+05:30",
    "dateModified": "2024-12-04T10:19:00+05:30"
  },
  {
    "title": "Vikrant Massey announces retirement from acting at 37: ‘It’s time to recalibrate, go back home’",
    "link": "https://worldsnews24.vercel.app/entertainment/vikrant-massey-announces-retirement-from-acting-at-37-it-s-time-to-recalibrate-go-back-home",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/vikrant-massey-announces-retirement-from-acting-at-37-it-s-time-to-recalibrate-go-back-home",
    "description": "12th Fail actor Vikrant Massey has announced that he will be bidding farewell to Indian cinema after appearing in two more films in 2025. He confirmed his retirement in an Instagram note.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Vikrant-Massey-announces-retirement-in-2025.jpg",
    "description1": "Vikrant Massey has been in the industry for around two decades now, with his career spanning across films, TV and OTT. After delivering some brilliant performances including the sleeper blockbuster 12th Fail, the 37-year-old actor has announced his retirement. Vikrant, who was last seen in The Sabarmati Report, has been celebrated for his performances in The Sabarmati Report, 12th Fail, and Sector 36 recently. He has said in his note that he will bid adieu to acting after working in two more films. In the note on Instagram, Vikrant Massey wrote, \"Hello, The last few years and beyond have been phenomenal. I thank each and every one of you for your indelible support. But as I move forward, I realise it's time to recalibrate and go back home. As a Husband, Father &amp; a Son. And also as an Actor. So coming 2025, we would meet each other for one last time.Until time deems right. Last 2 movies and many a years of memories. Thank you again. For everything and everything in between. Forever indebted!\" Also Read: Vikrant Massey recalls selling mobile phone to pay hotel bill during Goa trip: ‘W",
    "description2": "e all exhausted our money’ &nbsp; View this post on Instagram &nbsp; A post shared by Vikrant Massey (@vikrantmassey)  This announcement from Vikrant has left his fans quite shocked. One of the fans wrote, \"I hope it’s not true,\" and another one commented, \"Why would you that.? There are hardly any actors like you. We need some good cinema.\" A third fan expressed, \"Please don’t do this…I relate your Broken but Beautiful so much with my life..now seeing this post I feel.Elina left Samsang will leave and now Veer is also leaving me with those memories.\" One of the users also said, \"You’re my fav actor, you’re so phenomenal your eyes when you act that’s so expressive. we will wait for you to come back soon.\" Many have wished him well and told him to return stronger. On the work front, Vikrant is working on two films - Yaar Jigri and Aankhon Ki Gustaakhiyan. After gaining prominence with his performance in Balika Vadhu, Vikrant's career graph saw another catapult with 12th Fail, and now as he hangs his boots, fans have also stated that they would dearly cherish the amazing work he has done.",
    "image": "https://images.indianexpress.com/2024/12/Vikrant-Massey-announces-retirement-in-2025.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 1:16:50 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T08:36:23+05:30",
    "dateModified": "2024-12-02T08:36:23+05:30"
  },
  {
    "title": "Shahid Kapoor recalls crying on film set due to ‘heartbreak’: ‘It was really bad… I was destroying myself’",
    "link": "https://worldsnews24.vercel.app/entertainment/shahid-kapoor-recalls-crying-on-film-set-due-to-heartbreak-it-was-really-bad-i-was-destroying-myself",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/shahid-kapoor-recalls-crying-on-film-set-due-to-heartbreak-it-was-really-bad-i-was-destroying-myself",
    "description": "Recently in an interview, actor Shahid Kapoor recalled the time when he cried on sets due to heartbreak in his love life.",
    "thumbnail": "https://images.indianexpress.com/2024/12/shahid-kapoor_4decb5.jpg",
    "description1": "It's very rare to see Shahid Kapoor open up about his personal life. However, the actor has had his own fair share of ups and downs in his personal and professional life. In a recent conversation with Faye D'Souza on her Youtube channel, Shahid, who had a long term relationship with actor Kareena Kapoor Khan, got candid about 'crying' on sets, due to a 'heartbreak'. When asked if he has ever wept in a room alone because of his career, Shahid answered, \"That only happened to me when I went through heartbreak. And, sometimes it happens when you are making movies. So, I have had that. It was really bad. My makeup guy was like, 'I just finished your makeup! Can you just not?'\" The actor instantly started explaining his state while talking in a weeping tone, 'I can't help it, I think I am destroying myself'. \"I have been through those but not for work,\" he added. ALSO READ | Mira Rajput on how husband Shahid Kapoor has changed ‘spiritually’ over the years, blames him for spoiling their kids: ‘I am the bad cop’ The actor also talked about the one thing men need to change in their life. \"Indian men especially, have been kind of told from a very young age that you have to be the provider, that yo",
    "description2": "u have to protect and be the man of the family. Its there in men, when you are always worried that whatever I love, I must protect it. Sometimes, it can put a lot of pressure on you. Sometimes, you just want to relax and be like, 'I don't have to keep worrying about everything and everybody all the time and I can just maybe be vulnerable and let somebody else protect me'.\" He further added, \"Why can't we flip roles sometimes? You can feel like that and its fair to feel like that because eventually everybody is human. We feel all kind of emotions. A lot of men find it difficult to express their vulnerable side and I think because I am an actor, maybe I am comfortable because its a part of what I do. I have to be able to get to that place which is vulnerable and expressive. When you are an actor, you also understand that vulnerability is extremely attractive. Aggression cannot attract people the way vulnerability does. Its only human to be vulnerable, so as a man you should be okay with it.\" On the work front, Shahid Kapoor will next be seen in Deva, which will release in theatres on February 14, 2025. He will also be collaborating with Triptii Dimri for an upcoming film by Vishal Bhardwaj.",
    "image": "https://images.indianexpress.com/2024/12/shahid-kapoor_4decb5.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 1:16:50 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T09:31:05+05:30",
    "dateModified": "2024-12-02T09:31:05+05:30"
  },
  {
    "title": "How Indo-Canadian pop sensation Karan Aujla is the new prince of Punjabi pop",
    "link": "https://worldsnews24.vercel.app/entertainment/how-indo-canadian-pop-sensation-karan-aujla-is-the-new-prince-of-punjabi-pop",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/how-indo-canadian-pop-sensation-karan-aujla-is-the-new-prince-of-punjabi-pop",
    "description": "The 27-year-old Karan Aujla on ruling the charts, staying true to his roots, his Bollywood debut with the hit 'Tauba Tauba,' and why his upcoming India tour feels like homecoming.",
    "thumbnail": "https://images.indianexpress.com/2024/12/KARAN-EYE-SCREEN-1600.jpg",
    "description1": "Almost four years ago, when Punjabi powerhouse Diljit Dosanjh wanted a song looking back at his two-decade career, he roped in Indo-Canadian Punjabi popstar and friend Karan Aujla to write for him. Precisely 10 minutes after the phone call, G.O.A.T (Greatest of All Time) came to life in Aujla’s Vancouver home in 2020 and became a banger at breakneck speed. A staple and one of the most-loved pieces at every Dosanjh concert that followed thereafter, including the famed Coachella and his Dil-luminati tour this year, it was also the finale piece at Jimmy Fallon’s The Tonight Show in June. Aujla had dropped a coup d’etat of sorts. The vibe landed and the song came with a power punch — Dekh Bollywood vich jinne Khan ne/Ohna vich behnda sardaar, goriye (Look at all these Khans in Bollywood/This Sardar sits among them, my beautiful girl), was laden with imagery unheard of in the mainstream industry — of a Sikh entertainer being equated with Bollywood royalty, the Khans. Dosanjh was already breaking social and cultural stereotypes by being a global superstar who wore his dastaar (turban) and often a traditional folk outfit during his concerts; Aujla’s lines created a lyrical space where being a sardar, with all its symbols, was actually cool. “Many of us have always had an issue with the portrayal of Sikh characters in films, often caricaturised to suit directorial needs. Diljit has changed that. This line, this song by Karan Aujla succinctly portrays that,” says popular Punjabi singer Jassie Gill. Karan Aujla, in a conversation with SCREEN, says that while working with Diljit Dosanjh pushed him to elevate his own craft, songwriting feels instinctive to him and that he “avoids overthinking”. “When I sit down to write, I let emotions and ideas flow freely. My surroundings, personal experiences and the cultural background I come from all fuel my inspiration…Ultimately, I strive for authenticity in my lyrics. I want listeners to connect with the stories I tell through genuine emotions and relatable experiences. That connection is what makes my music resonate and I believe it’s the cornerstone of my songwriting process,” says Aujla. This year, he followed up G.O.A.T and an album titled Making Memories (2023) with his Bollywood debut – Tauba Tauba — an emphatic combination of breezy rhymes, a cheerful flute and a full piano melody paired with Punjabi lines raving about a stunner in the throaty Malwai dialect. Tauba Tauba, a song he wrote, composed and sang, from an otherwise lost cause of a film (Bad Newz, 2024), turned out to be one of this year’s biggest hits from Bollywood, which has been banking on remixes to survive. Aujla says he intentionally kept the lyrics simple. “Hindi really isn’t me. I wanted to familiarise a lot more people with Punjabi,” says Aujla. Authentic Punjabi lines with a contemporary, rakish energy was just the edge Aujla needed to get the song to ring up the charts. If Tauba Tauba offered Karan Aujla phenomenal success, two Junos (considered the Canadian Grammys) earlier this year from the Canadian Academy of Recording Arts and Sciences for his song Softly, 2023 (which goes by the line Chunni meri rang de lalaariya), announced the arrival of a rare talent. While one was for being the ‘Breakthrough Artist of the Year’, the other was the Audience Choice Award, which has previously gone to the likes of Avril Lavigne, Justin Bieber and Shawn Mendes, among others. It also marked another first — it made Aujla the only Punjabi artiste to land a Juno. The award, he says, was “a reminder of staying true to my roots” and “pushing boundaries”. “This award celebrates the hard work and talent of countless artistes in our scene. It highlights the global appeal of Punjabi music and shows that Indian artistes are making their mark on the international stage… I hope this inspires more Punjabi artistes to pursue their dreams and showcase the richness of our culture to a wider audience,” says Aujla. Several Punjabi hits in a year, a quick turnaround time (from writing a song to its recording), writing for almost 23 Punjabi artistes besides creating his own singing career, and collaborations with rappers Badshah and DIVINE, have put Aujla on a global map. “At this point, I am going to call him the biggest artiste in the Indian subcontinent. Karan is a brilliant performer, who is futuristic in his approach. Punjabi music is now changing every four months. He figures out what will work and executes it very quickly,” says Satvinder Singh Kohli, managing director, Speed Records Private Ltd, the biggest Punjabi music label in India. Gill believes that Aujla has become so free with his art now “that he is experimenting wonderfully and the results are brilliant”. Kohli, who is a Dosanjh acolyte himself, says that while the former is a global superstar and a brilliant performer, he is not writing and composing his songs. “Karan is first a lyricist and composer and then a singer,” says Kohli, who adds that most of Aujla’s audience comes from the Gen Z space. “His is a relatively younger audience. Those born after 1998 are listening to him and how,” says Kohli. &nbsp; View this post on Instagram &nbsp; A post shared by Karan Aujla (@karanaujla) This month, Karan Aujla begins his debut India tour, ‘It’s All A Dream’, tickets for which are selling out fast, and priced as high as Rs 15 lakh. “This tour means a lot more than just performing; it’s about connecting with my fans on a deeper level and sharing my music in the country that shaped me as an artiste. While my recent tours in the UK, Australia, and Canada were amazing, India hits different because it’s a homecoming of sorts,” says Aujla, who will be touring Delhi, Mumbai, Bengaluru and Jaipur, among other cities. Some stories aren’t meant to be. Even Aujla hasn’t been able to fathom how a 14-year-old from an agricultural family in Ghurala, a speck of a village in Punjab — who had lost both his parents as a young boy and had turned to writing as a refuge and worked as a longshoreman — became a pop star only a few years later. “Sometimes I can’t believe I am that same kid who lost his parents in India, made his way out to Canada… If you are dreaming, make sure you dream big,” said Aujla, in his acceptance speech at the Junos, remembering the toughest phase of his life. The youngest of three siblings, Karan grew up as Jaskaran Aujla. He lost his father to a motorcycle accident when he was just nine and his mother to gallbladder cancer five years later. Brought up by the family of his father’s younger brother, writing songs, he says, was the only real expression for him. While some of this poetry was melancholic, so",
    "description2": "me others carried a sense of hope. “Writing was a way for me to process my emotions during that challenging time. I wrote about loss, heartache and longing. It felt like a cathartic experience that laid the foundation for my musical journey, helping me find my voice and connect with others. I didn’t know how to talk about it to anybody, but I slowly realised I could turn songwriting into a hobby and then a profession,” says Aujla, Aujla was in class IX when his first song, Cell Phone, with singer Mac Benipal, whom he met at a wedding, was released on YouTube. The song, which spoke about feeling lost and alone amidst grinding poverty, tanked. “That song happened when I was 15. Looking back, every struggle taught me something valuable. It was those hard times that shaped my identity,” says Aujla. It was on a visit to Chandigarh with Benipal that Aujla discovered luxury SUVs, especially the Range Rover, and became fascinated with it. He eulogised the car and wrote Range, a song based on the rhyme and meter of Cell Phone, but this time describing the feeling of owning the luxury car. Gill, whom Aujla met when he was 14, was then an upcoming singer from the neighbouring village of Jandali. With a few hit songs in tow, he was already doing shows in Punjab. Aujla found out that Gill frequented his friend’s salon in Khanna, met him and offered him the lyrics of Range. “It was surprising that it had come from such a young boy. There were some very intricate things and rhythmically the song landed perfectly,” says Gill. The song became Aujla’s calling card to approach other producers. During those early writing years, he also started looking up online tutorials and interacting with established producers whilst experimenting with different styles. “I draw inspiration from both traditional Punjabi poetry and contemporary music,” says Aujla, who was always drawn to the work of Kuldeep Manak and Gurdas Mann. Range (Replay, Speed Records) came out in 2014 and was an instant hit. But by that time, Aujla had already immigrated to Canada to live with his sisters. “He was really young then and wanted to be featured in the music videos, but the new boys weren’t keen to give him a chance then,” says Kohli. The move to Canada from Ghurala in his early teens was a significant transition. “It was a mix of anxiety and nervousness…with a different culture, lifestyle and way of life,” says Aujla, who also figured that this was the space where he could express himself more freely. He found himself amid a multi-cultural setting that broadened his horizons. “It was inspiring to see how diverse communities came together and celebrated their heritage. This experience fuelled my creativity and encouraged me to explore new sounds and influences in my music. Over time, I began to find my place, build friendships, and embrace the opportunities. It became a pivotal chapter in my life, shaping both my identity and my musical journey,” says Aujla, who after high school took up a part-time job as a longshoreman in Surrey, British Columbia. As he loaded and unloaded cargo on the docks and learned the value of hard work, deep down he knew it was a temporary phase. “During those long hours, I would daydream about my music and the impact I wanted to make. It was a tough environment, but it motivated me to push harder for my dreams. That experience reinforced my belief in pursuing my passion. It reminded me that every struggle can lead to growth, and ultimately, I knew I was meant to share my stories through music. It was all part of the journey to get where I am today,” says Aujla. He soon met Punjabi composers and producers Deep Jandu and Elly Mangat and began writing lyrics for them. This also led him to write for Jazzy B and Bohemia, two big names in the circuit. His song Blessings of Bapu (2015) sung by Gagan Kokri found some attention back home. But Aujla wasn’t still a familiar name because he wasn’t the face of the songs. Also, the concept of credit for the lyricist was a bit muddled. What changed the game for him was a song called Don’t Worry (2018) featuring Punjabi singer Gurlez Akhtar, which captured his personality, helping him connect with the fans. “I was still navigating my way through the music industry. The song captured the essence of facing life’s challenges with a positive outlook, which resonated deeply with many people,” says Aujla. He didn’t look back from here, releasing one song after another, most of them blending hip-hop with a typical Punjabi sound identity. The audience was lapping it up and asking for more. In the last few decades, Punjab’s cultural identity has seen a big transformation. Shrinking agriculture prospects, lack of jobs and industry have led motifs in older songs that spoke of births, weddings and military life and rich Punjabi literature, to be replaced by lyrics dominated by guns, drugs and misogyny, among others. The loss of innocence and its replacement by a certain aggressive culture in Punjabi songs has been a prominent cultural shift, buoyed by the Internet. Aujla’s rivalry with slain singer Siddhu Moosewala was also a consequence of being in the same gun-toting, sabre-rattling space. The two started off as friends, but conversation leaks led to both sides dissing each other through their songs. Aujla blames “the pressures of fame, expectations from fans, and the aggressive nature of the industry” for the conflicts and misunderstandings. “It is a reminder of how fragile relationships can be in this industry and how important it is to communicate openly and respectfully. I hope that artistes can learn from such situations and focus on creating music that brings people together rather than allowing conflicts to divide us. It’s crucial to prioritise our artistry and the message we want to convey, while also remembering the importance of unity within the music community,” says Aujla. A couple of years before Moosewala’s death, Karan Aujla was also asked by Chandigarh police to refrain from songs glorifying violence and drugs. He agreed to make the change. “As an artiste with a large following, I recognise my responsibility. I’ve become more mindful about my lyrical choices and believe in striking a balance between hard and soft tracks. It’s about creating a body of work that is both relatable and responsible. My music will maintain that balance while evolving with the changing industry landscape,” says Aujla, who is all set for a new, big release with Dosanjh besides the upcoming tour. “This tour is not just about performing; it’s about celebrating our culture, Punjabi music and sharing it in the country that shaped me as an artiste,” he says.",
    "image": "https://images.indianexpress.com/2024/12/KARAN-EYE-SCREEN-1600.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": " Updated 1:16:50 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T10:29:56+05:30",
    "dateModified": "2024-12-01T10:29:56+05:30"
  },
  {
    "title": "Pushpa 2 Advance Booking: Allu Arjun film sells almost 7 lakh tickets; trends point to Rs 100 crore box office opening",
    "link": "https://worldsnews24.vercel.app/entertainment/pushpa-2-advance-booking-allu-arjun-film-sells-almost-7-lakh-tickets-trends-point-to-rs-100-crore-box-office-opening",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/pushpa-2-advance-booking-allu-arjun-film-sells-almost-7-lakh-tickets-trends-point-to-rs-100-crore-box-office-opening",
    "description": "Pushpa 2 Advance Booking: As expected, Allu Arjun starrer is getting a massive interest at the Telugu box office, but what has been really interesting is the numbers of the Hindi version not lagging behind.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Pushpa-2-Day-1-Advance-booking-numbers.jpg",
    "description1": "Pushpa 2 Advance Booking: Pushpa 2: The Rule is expected to rewrite records in the Indian box-office and from the trends in booking across the country, it is clear that the Sukumar directorial will definitely meet those expectations. According to trade website Sacnilk, the advance bookings for Pushpa 2: The Rule is growing from strength to strength, and the film has already collected Rs 30.92 crore for Day 1. With three more days left for the release, and Allu Arjun and team Pushpa amping up the promotions, the numbers might just surprise everyone.  ALSO READ: Allu Arjun’s Pushpa 2 The Rule on the way to blockbuster opening, Telangana government clears decks Almost 7 lakh tickets have been sold across all the languages and formats Pushpa 2: The Rule is being released. The film will be out in 2D, 3D, IMAX, and 4DX. As expected, it is the Telugu numbers that have reached dizzying heights, but what has been really interesting is the numbers of the Hindi version not lagging behind by much. For instance, the advance booking numbers for the Telugu versions of Pushpa 2 has amounted to Rs 10.57 crore, and the Hindi numbers amount to Rs 10.14 crore. Even on the number of tickets sold, the Hindi version has 3,40,892 while the Telugu version is at 2,73,519. This is something unprecedented in recent Indian cinema history. While the Telugu 2D version has outperformed every other language, it is all about the Hindi version in the 3D and IMAX formats. Incidentally, the opening weekend collection of the Hindi version of Pushpa 1 was around Rs 13 crore, and Pushpa 2 would comfortably sail past this number on Day 1. The Malayalam version of Pushpa 2 is also doing considerably well, but the Tamil and Kannada versions are picking up slowly. But, it has just been a day since the bookings opened for the Tamil version, and the state is reeli",
    "description2": "ng under incessant rains and a cyclone. With parts of the state recovering back to normalcy, the bookings are expected to pick up. Interestingly, Kalki 2989 AD, the highest-grossing film of the year, made Rs 61 crores in advance booking for Day 1. It went on to make Rs 95.3 on Day 1 of its release, and it would be interesting to see if Pushpa 2: The Rule breaches the Rs 100 crore mark domestically on Day 1. The fact that there are paid premieres on December 4 where the Telangana government has allowed a price hike might just facilitate a massive opening for the film.  Pushpa 2 Cast and Crew With Allu Arjun playing the titular role, Pushpa 2: The Rule will see the return of Rashmika Mandanna, Fahadh Faasil, Rao Ramesh, Sunil, Ajay Ghosh, Dhananjaya, and Prathap Bhandari who would be reprising their roles from the first instalment.  Despite a public tiff with the makers regarding the issue of delay in scoring the background music, Devi Sri Prasad has delivered a chartbuster album once again. The latest song, Peelings, has attained viral popularity within hours of its release. However, the makers have reportedly replaced Devi Sri Prasad with Sam CS and Thaman S for the background score of the film.  ALSO READ: Pushpa 2 song Peelings: Allu Arjun and Rashmika Mandanna face off in an intense dance battle in this high-octane track Pushpa 2 Budget and expectations Mythri Movie Makers, who have backed both instalments of Pushpa, have pumped in almost Rs 400-500 crore for the second film and are confident of doubling it at the box-office. With Kalki 2898 AD being the only Rs 1000 crore film this year, all eyes are on Pushpa 2: The Rule to see if it would cement its brand in the elite club. Pushpa 2 Release Date  The film will hit screens on December 5, and will be released in Telugu, Hindi, Malayalam, Tamil, Kannada, and Bengali.",
    "image": "https://images.indianexpress.com/2024/12/Pushpa-2-Day-1-Advance-booking-numbers.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 1:16:50 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T09:18:42+05:30",
    "dateModified": "2024-12-02T09:18:42+05:30"
  },
  {
    "title": "Priyanka Chopra’s brother Siddharth is ‘struggling everyday’ after becoming ‘collateral damage’ to her success, says mom Madhu",
    "link": "https://worldsnews24.vercel.app/entertainment/priyanka-chopra-s-brother-siddharth-is-struggling-everyday-after-becoming-collateral-damage-to-her-success-says-mom-madhu",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/priyanka-chopra-s-brother-siddharth-is-struggling-everyday-after-becoming-collateral-damage-to-her-success-says-mom-madhu",
    "description": "Priyanka Chopra's mother Dr Madhu Chopra spoke about her son, Siddharth Chopra, and how he had to grow up on his own.",
    "thumbnail": "https://images.indianexpress.com/2024/11/priyanka-chopra-brother.jpg",
    "description1": "When Priyanka Chopra started her career in the entertainment industry, she was just 18. Her mother, Dr Madhu Chopra, paused her own career as a doctor to be with her daughter. In a recent interview, Madhu recalled how her son Siddharth Chopra somehow became the \"collateral damage\" to Priyanka's success. Madhu said that Siddharth was just a teenager when she had to leave to be with Priyanka. She said that her husband, Dr Ashok Chopra, was also occupied with work, which meant that Siddharth grew up without parental influence. Talking on Something Bigger Show's YouTube channel, Madhu shared, \"Siddharth was the collateral damage to all of Priyanka's success, because dad was working, I was with Priyanka, he just grew up on his own and he was a teenager at that time. He, I think, was collateral damage for me.\" Madhu got emotional as she spoke about Siddharth and shared, \"When I think about it, these are certain things that you had to deal with him.\" Madhu was asked to elaborate about this, and she shared that she still witnesses Siddharth \"struggling everyday.\" She shared, \"I see him struggling everyday and I feel that, okay god has ",
    "description2": "blessed you, so just count your blessings, one by one and it will surprise you what the lord has done. I count my blessings everyday.\" Madhu concluded by saying, \"I have two great kids, who love me, care for me.\" ALSO READ | Priyanka Chopra wept as she reluctantly signed her first film, reveals mom Madhu: ‘There were big blobs of tears on the contract’ In an earlier interview with Hindustan Times, Priyanka spoke about their childhood and said, \"We have grown up squabbling and fighting as most siblings do. He is the younger one technically, and so, I did my duty as the older sibling and bullied him mercilessly. But no matter what I did, he would be there for me, with a smile on his face and love in his eyes. I think the strength of the bond that we share is tremendous. A lot is unsaid between us, but we know that no matter what, we’ll always be there for each other.\" Priyanka's brother Siddharth Chopra got married to Neelam Upadhyaya in August. Priyanka attended her brother's wedding in Mumbai. The couple got engaged in April and the engagement ceremony was also attended by Priyanka's husband Nick Jonas and daughter Malti Marie.",
    "image": "https://images.indianexpress.com/2024/11/priyanka-chopra-brother.jpg",
    "image1": "",
    "date": "30/11/2024",
    "time": " Updated 1:16:50 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-30T17:54:22+05:30",
    "dateModified": "2024-11-30T17:54:22+05:30"
  },
  {
    "title": "Dua Lipa concert: Sitara Ghattamaneni leads Telugu star kids brigade at event, shares photos with international pop star",
    "link": "https://worldsnews24.vercel.app/entertainment/dua-lipa-concert-sitara-ghattamaneni-leads-telugu-star-kids-brigade-at-event-shares-photos-with-international-pop-star",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/dua-lipa-concert-sitara-ghattamaneni-leads-telugu-star-kids-brigade-at-event-shares-photos-with-international-pop-star",
    "description": "Sitara Ghattamaneni, daughter of actor Mahesh Babu, shared a photo of Dua Lipa with her group of friends, and it has since gone viral. ",
    "thumbnail": "https://images.indianexpress.com/2024/12/Sitara-Ghattamaneni-shares-selfie-with-Dua-Lipa.jpg",
    "description1": "India is one of the fastest growing destinations for popular international artistes, and Mumbai was witness to one such event last weekend. Popular singer Dua Lipa performed at her second concert in the country, and fans thronged the city to attend the event. This fandom also included the kids of some of the biggest names of Indian cinema. One such group included Sitara Ghattamaneni, daughter of actor Mahesh Babu, Sukriti Veni, the daughter of Pushpa director Sukumar, and Aadhya, the daughter of Varisu director Vamshi Paidipally. Sitara shared a photo of Dua Lipa with her group of friends, and it has since gone viral.  ALSO READ | Dua Lipa concert: Abhijeet Bhattacharya’s son Jay criticises social media for not giving credit to father for Levitating X Woh Ladki Here's the post: &nbsp; View this post on",
    "description2": " Instagram &nbsp; A post shared by sitara (@sitaraghattamaneni) Dua Lipa performed at the Zomato Feeding India Concert, where she also danced to the viral Levitating x Woh Ladki Jo mashup much to the shock and surprise of fans in attendance. The singer had last performed in India at the OnePlus Music Festival in Navi Mumbai in 2019.  ALSO READ | Dua Lipa dances to Levitating-Shah Rukh Khan’s Woh Ladki Jo mashup at Mumbai concert. Watch After her performance in Mumbai, Dua Lipa is set to continue her Asia tour with a concert in Seoul. Taking to social media to make this announcement, the singer wrote, ““Thank you Mumbai!!!!! off to our next and FINAL stop of the Asia run… SEOUL!!!!!” Before the Mumbai leg, she performed at sold-out concerts in Bangkok, Kuala Lampur, Taipei, Tokyo, Manila, and Singapore.",
    "image": "https://images.indianexpress.com/2024/12/Sitara-Ghattamaneni-shares-selfie-with-Dua-Lipa.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 1:16:50 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T14:18:38+05:30",
    "dateModified": "2024-12-02T14:18:38+05:30"
  },
  {
    "title": "Priyanka Chopra’s uncle forbid her from participating in Miss India, put one condition: ‘Girls from our family…’",
    "link": "https://worldsnews24.vercel.app/entertainment/priyanka-chopra-s-uncle-forbid-her-from-participating-in-miss-india-put-one-condition-girls-from-our-family",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/priyanka-chopra-s-uncle-forbid-her-from-participating-in-miss-india-put-one-condition-girls-from-our-family",
    "description": "Actor Priyanka Chopra Jonas' mother Madhu Chopra revealed that she had to initially quit her medical practice for her daughter's career.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Priyanka-Madhu.jpg",
    "description1": "Priyanka Chopra's mother, Dr Madhu Chopra, has never shied away from talking about her daughter, career, and the past challenges that they had to overcome as a family. Priyanka, who won Miss India title in the year 2000 and was later crowned Miss World, had to go through a lot of hardships to achieve her goal. In a recent interview on the Something Bigger Show, Madhu revealed that she had to quit her medical practice for PeeCee's career because of her husband's patriarchal family. Recalling the difficult period of convincing her husband, late Ashok Chopra, to send Priyanka to Mumbai for Miss India, she shared, \"Priyanka was studying in 12th standard and was about to give her board exams, so telling her dad and convincing him to say yes during her gap year was another task. Both the kids came and kept asking him. He said, 'Boards are not easy, let her study, don't bring in all these distractions'. After that, children were disappointed so they went downstairs to their bedroom.\" Madhu continued, \"Then I asked him, 'How many people in this country get this opportunity?' She is in the gap year and this is an opportunity that has come out of nowhere. Its just a matter of a week max. So, he said okay. And then she won, one after the other, then she also got selected for Miss India.\" ALSO READ | Priyanka Chopra wept as she reluctantly signe",
    "description2": "d her first film, reveals mom Madhu: ‘There were big blobs of tears on the contract’ She further revealed that it was an even a bigger task to convince her husband's older brother for the same. \"He was like the patriarch of the family. We went to his place and told him everything, then I told him that she has to go to Bombay for the training. He was absolutely against it. He said, 'You people are putting ideas into your child's head. Girls from our family don't do this'. We heard a lot, Priyanka cried a lot. She thought bade papa would melt but he said no. Then, I spoke to his wife and said, 'Again the same thing. Its an opportunity, its not like she is going away from home. If she makes it, fine, if she doesn't, she goes back to school. There is no pressure on her'.\" \"Next morning, he sat me down and said that she can go but you have to forget your medical practice and you will be there with her every minute. You will go to Bombay with her, I said okay and promised. My husband also said that I will work for the two of us, I will take care of the practice,\" Madhu added. Eventually, her mum became her travelling partner. \"I was with her for 5-6 years after winning. I used to travel with her everywhere, every shoot, even in Bombay or anywhere in India. Then I stopped going to India shoots, I would only travel abroad with her,\" she said.",
    "image": "https://images.indianexpress.com/2024/12/Priyanka-Madhu.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 1:16:50 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T14:10:01+05:30",
    "dateModified": "2024-12-02T14:10:01+05:30"
  },
  {
    "title": "Bandish Bandit Season 2 trailer: Divya Dutta joins Ritwik Bhowmik and Shreya Chaudhary in a high-stake musical showdown. Watch",
    "link": "https://worldsnews24.vercel.app/entertainment/bandish-bandit-season-2-trailer-divya-dutta-joins-ritwik-bhowmik-and-shreya-chaudhary-in-a-high-stake-musical-showdown-watch",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/bandish-bandit-season-2-trailer-divya-dutta-joins-ritwik-bhowmik-and-shreya-chaudhary-in-a-high-stake-musical-showdown-watch",
    "description": "Starring Ritwik Bhowmik and Shreya Chaudhary in lead roles, the trailer for Bandish Bandits Season 2 has been unveiled, promising a mix of drama, music, and rivalry.",
    "thumbnail": "https://images.indianexpress.com/2024/12/banish.jpg",
    "description1": "Bandish Bandits, a series that became a fan favourite upon its release during the Covid-19 pandemic, is all set to return with an all-new season. Starring Ritwik Bhowmik and Shreya Chaudhary in lead roles, the trailer for Season 2 has been unveiled, promising a mix of drama, music, and rivalry. At the conclusion of Season 1, Radhe (Ritwik Bhowmik) achieved the title of Sangeet Samrat, while Tamanna (Shreya Chaudhary) began her journey to refine her artistic skills. The Season 2 trailer reveals a gripping storyline where Radhe and Tamanna cross paths again at the prestigious Euro Band Championship, one of the world’s biggest music competitions. Tamanna joins a renowned music school, where Divya Dutta plays her mentor, guiding her toward her aspirations. Meanwhile, Radhe grapples with preserving his musical heritage following the demise of his grandfather, Pandit Ji (Naseeruddin Shah). Despite their different goals, Radhe and Tamanna decide to compete in the championship. However, their growing ambitions and unresolved conflicts bring new challenges, turning their journey into a tense rivalry. ",
    "description2": "Talking about reprising his role, Ritwik Bhowmik shared, “For me, stepping into the shoes of Radhe is like coming home after a long day. It is a character I am grateful to have played for several reasons, most importantly, how much it has taught me as an actor and a person.\" \"Stepping back into Tamanna’s world for the upcoming season of Bandish Bandits feels like reconnecting with an old friend. She has grown, matured in ways I didn’t anticipate. Tamanna goes through so much in her life, and it’s been thrilling to convey the depth of her emotions—pain, love, anger, resentment—all shaped by the situations she faces.” said Shreya Chaudhry. The series also features Sheeba Chaddha, Atul Kulkarni, Rajesh Tailang, and Kunaal Roy Kapur, alongside new cast members Divya Dutta, Rohan Gurbaxani, Yashaswini Dayama, Aaliyah Qureshi, and Saurabh Nayyar. Directed by Anand Tiwari, Bandish Bandits Season 2 promises to take the story to new heights while delving deeper into its characters' emotional and professional struggles. Mark your calendars, as Bandish Bandits Season 2 is set to premiere on December 13.",
    "image": "https://images.indianexpress.com/2024/12/banish.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 1:16:50 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T13:48:58+05:30",
    "dateModified": "2024-12-02T13:48:58+05:30"
  },
  {
    "title": "Iranian Rapper Toomaj Salehi released after more than 2 years of Imprisonment",
    "link": "https://worldsnews24.vercel.app/entertainment/iranian-rapper-toomaj-salehi-released-after-more-than-2-years-of-imprisonment",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/iranian-rapper-toomaj-salehi-released-after-more-than-2-years-of-imprisonment",
    "description": "Earlier this year, Salehi was sentenced to death by a court in Isfahan on the charges of \"spreading corruption on earth.\"",
    "thumbnail": "https://images.indianexpress.com/2024/12/Untitled.jpg",
    "description1": "Months after his death sentence was overturned, rapper Toomaj Salehi has been released from prison. Salehi was incarcerated in October 2022 after he showed his support for protests that were held due to the mysterious death of 22-year-old Mahsa Amini while in police custody. The 33-year-old is known for his anti-establishment style of writing and has been constantly vocal against the Iranian government. He was released on bail in 2023, but after releasing a video exposing the treatment he endured during his term in prison, he was detained again. The rapper took to his Instagram and informed his followers about his release. &nbsp; View this post on Instagram &nbsp; A post shared by Toomaj Salehi | توماج صالحی (@toomajofficial) &nbsp; Earlier this year, S",
    "description2": "alehi was sentenced to death by a court in Isfahan on the charges of \"spreading corruption on earth.\" This decision was then later overturned by the Iranian Supreme Court in June. Many had risen against the Salehi's incarceration, like journalist Kianoosh Sanjari and activist Hossein Ronaghi. Sanjari had threatened the government that he would take his own life unless the falsely convicted prisoners were released, including Salehi. The journalist then proceeded to take his own life, after which Hossein Ronaghi sewed his lips shut and went on a hunger strike with the same demands. Salehi has finally been released after serving more than 700 days behind bars. Salehi was also accused of \"posting false statements on the internet and disrupting public order.\"",
    "image": "https://images.indianexpress.com/2024/12/Untitled.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 1:16:50 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T13:47:09+05:30",
    "dateModified": "2024-12-02T13:47:09+05:30"
  },
  {
    "title": "When Vikrant Massey revealed why he quit TV despite earning ‘Rs 35 lakh per month’: ‘I didn’t have peace’",
    "link": "https://worldsnews24.vercel.app/entertainment/when-vikrant-massey-revealed-why-he-quit-tv-despite-earning-rs-35-lakh-per-month-i-didn-t-have-peace",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/when-vikrant-massey-revealed-why-he-quit-tv-despite-earning-rs-35-lakh-per-month-i-didn-t-have-peace",
    "description": "In an interview earlier this year, actor Vikrant Massey revealed he turned down a lot of money to quit TV and move to films. \n",
    "thumbnail": "https://images.indianexpress.com/2024/12/Vikrant-Massey.jpg",
    "description1": "Vikrant Massey has stunned fans by announcing his retirement from acting at 37, on social media today. The actor, who made his Bollywood debut with Vikramaditya Motwane's Lootera, had opened up about his career and relationship with money, in an interview earlier this year. In a video on Unfiltered by Samdish, Vikrant revealed he left TV even though he was being paid ₹35 lakh a month, to enter the film industry. The actor had started by narrating the story of how he was treated when his friends saw where he lived. He said, \"I once called some of my closest friends home in college. My mom cooks really well, so I called everyone home to eat. But when they saw my home, the plastic chairs, chipping paint, leaky ceiling, how the kitchen isn’t aesthetically clean, their behaviour changed… They left within an hour of coming to my home. I later saw chats of them badmouthing my home.\" ALSO READ | Vikrant Massey ‘feels scared’ to talk about his live-in relationship with now wife Sheetal Thakur: ‘I believe in live-in, it is important to…’ Vikrant shared that this made him think earning mo",
    "description2": "ney was the answer to gain respect, but he later realised that it didn't give him peace. \"I earned a lot of money when working in TV. I bought my first home at 24, I was earning 35 lakh per month. It was a lot for someone from a family like mine where we struggled to make ends meet. After I bought the home, paid off debts, gave my parents a better life, I still couldn’t sleep peacefully. I quit at that stage because good work felt more important. All my savings were exhausted and Sheetal (his wife) would lend me money to attend auditions,\" he said. Meanwhile, Vikrant Massey announced his retirement from acting at the prime of his professional life, leaving everyone shocked. After being praised for his performances in 12th Fail and Sector 36, he was last seen in The Sabarmati Report, based on the 2002 Godhra train burning incident in Gujarat, which is still running in theatres. Directed by Dheeraj Sarna, the film also stars Raashii Khanna and Riddhi Dogra in pivotal roles. According to Sacnilk, the film has earned ₹28.25 crore at the domestic box office, in its 17-day run so far.",
    "image": "https://images.indianexpress.com/2024/12/Vikrant-Massey.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": " Updated 1:16:50 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T13:25:49+05:30",
    "dateModified": "2024-12-02T13:25:49+05:30"
  },
  {
    "title": "PM Modi to attend screening of 'The Sabarmati Report' in Delhi today",
    "link": "https://worldsnews24.vercel.app/entertainment/pm-modi-to-attend-screening-of-the-sabarmati-report-in-delhi-today",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/pm-modi-to-attend-screening-of-the-sabarmati-report-in-delhi-today",
    "description": "PM Modi to attend screening of 'The Sabarmati Report' in Delhi today",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202075929.jpg",
    "description1": "\n\n\nNew Delhi [India], December 2 (ANI): Prime Minister Narendra Modi will attend the screening of the recently released film 'The Sabarmati Report' today at Balyogi Auditorium in Parliament, New Delhi, at 4 pm.\nThe film, starring Vikrant Massey, is based on the tragic burning of the S-6 coach of the Sabarmati Express near Godhra station in Gujarat on February 27, 2002.\n\nThe movie has already gained significant attention, with Prime Minister Modi publicly praising the film's effort to reveal the truth.\nIn response to a post on X, which shared the trailer of the film, PM Modi commented, \"Well said. It is good that this truth is coming out, and that too in a way common people can see it. A fake narrative can persist only for a limited period of time. Eventually, the facts will always come out!\"\nThe film, which brings attention to the 2002 Godhra incident, has been declared tax-free in several states, including Uttar Pradesh, Chhattisgarh, Madhya Pradesh, Uttarakhand, Odisha, Haryana, Gujarat and Rajasthan.\nThe film has also garnered praise from numerous political figures, including BJP MP and actress Hema Malini.\n\n\nSpeaking with ANI, Malini described the movie as \"very good\" and emphasized how it accurately depicted the real events surrounding the incident. She stated, \"There were some misunderstandings regarding that incident. Some people claimed that it was an accident, but it was done deliberately.\"\nIn Uttar Pradesh, Chief Minister Yogi Adityanath attended a screening of the film in Lucknow, along with other prominent leaders and the film's cast.\nExpressing his admiration for the film, CM Adityanath said, \"Vikrant Massey and his",
    "description2": " team made a commendable effort. I express my heartfelt gratitude on behalf of UP. The people of the country have the right to know the truth of the work that has been done to create animosity in society.\" He also declared the film tax-free in the state.\nSimilarly, Haryana Chief Minister Nayab Singh Saini praised the film for shedding light on the truth behind the Godhra incident. \"This film reveals the truth behind the tragic Godhra train-burning incident. The makers have handled the subject with sensitivity and dignity,\" Saini remarked. He further noted that the film serves as a tribute to the 59 victims who lost their lives in the 2002 tragedy.\nGoa Chief Minister Pramod Sawant also expressed his admiration for the film after attending its screening at the 55th edition of the International Film Festival of India (IFFI). \"I really liked the film...it's extremely good. You have presented the film in a proper manner. Huge congratulations,\" CM Sawant said in a phone call facilitated by producer Mahaveer Jain.\n'The Sabarmati Report', directed by Dheeraj Sarna, features Vikrant Massey, Ridhi Dogra, and Raashii Khanna in pivotal roles. The film is produced by Shobha Kapoor, Ektaa R Kapoor, Amul V Mohan, and Anshul Mohan under the banners of Balaji Motion Pictures and Vikir Films Production.\nEktaa Kapoor, one of the film's producers, recently spoke about the extensive research that went into creating the film. She revealed, \"We spent a year reviewing previous research and fact-checking those findings. Only after that, we did proceed to make the film. That's why I am proud to have made this movie, unveiling the truth behind it.\" (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202075929.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  },
  {
    "title": "\"When should one go then?\" RJD MP expresses disappointment over Cong UP President's scuffle with cops",
    "link": "https://worldsnews24.vercel.app/entertainment/when-should-one-go-then-rjd-mp-expresses-disappointment-over-cong-up-president-s-scuffle-with-cops",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/when-should-one-go-then-rjd-mp-expresses-disappointment-over-cong-up-president-s-scuffle-with-cops",
    "description": "\"When should one go then?\" RJD MP expresses disappointment over Cong UP President's scuffle with cops",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202084543.jpg",
    "description1": "\n\n\nNew Delhi [India], December 2 (ANI): RJD MP Manoj Jha on Monday expressed his disappointment over Congress PCC president of Uttar Pradesh being denied entry to violence-hit Sambhal.\nIn conversation with ANI, Jha sardonically commented if one would visit Sambhal when they (Uttar Pradesh Police) invited them.\n\nJha said, \"When should one go then? When they send an invitation? They are going there to heal...This doesn't give a good idea about the country.\"\nEarlier in the day, a scuffle broke out between Uttar Pradesh Police and Congress leaders on Monday outside the UP Congress Office in Lucknow after the Congress delegation led by State President Ajay Rai was prevented from going to visit violence-hit Sambhal.Meanwhile, Ajay Rai said that the delegation of the Congress party will visit Sambhal after the day when the Police will inform them that restrictions have been lifted in the district.\n\"The DCP and other police officials have said that they inform us when the restrictions are lifted. There are restrictions in Sambhal till 10th December. The day the Police will inform us that restrictions have been lifted, a delegation of the Congress party will visit Sambhal,",
    "description2": "\" Rai said.\n\n\nCongress leader Sachin Chaudhary alleged that the Uttar Pradesh Police is preventing a delegation of the party from going to Sambhal in Uttar Pradesh and demanded a Central Bureau of Investigation inquiry into the matter.\n\"Police are stopping us (from going to Sambhal). Earlier, they gave us the time for December 2. I just want to ask that if we cannot ask about the well-being of the victims, isn't it a matter of shame? We demand a CBI inquiry into the matter. Police have been there at my residence since morning,\" Chaudhary told ANI.\nEarlier today, Uttar Pradesh Police issued a notice to Congress state president Ajay Rai asking them not to visit violence-hit Sambhal.\nIn the notice given to Ajay Rai, he has been informed that \"Keeping in mind the peace and communal sensitivity in Sambhal district, he should cooperate in the public interest and postpone his proposed program so that the order passed by the District Magistrate of Sambhal district, Section 163 BNSS is not violated.\"\nTensions in Sambhal have been high since November 19 when clashes between protestors and police over the court-ordered survey of the Jama Masjid resulted in four deaths. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202084543.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  },
  {
    "title": "\"Travesty of US justice system,\" Suhel Seth on Biden's pardon to son",
    "link": "https://worldsnews24.vercel.app/entertainment/travesty-of-us-justice-system-suhel-seth-on-biden-s-pardon-to-son",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/travesty-of-us-justice-system-suhel-seth-on-biden-s-pardon-to-son",
    "description": "\"Travesty of US justice system,\" Suhel Seth on Biden's pardon to son",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202083352.jpg",
    "description1": "\n\n\nKolkata (West Bengal) [India], December 2 (ANI): Business consultant Suhel Seth, on Monday said that US President Joe Biden's unconditional pardon to his son Hunter Biden was a travesty of the US Justice system. He also called out the US justice system on the way they had handled Adani case.\nSeth, in conversation with ANI said that Biden had himself said that the US justice system was infected with politics and questioned if anyone would believe in the system.\n\n\"Yesterday, Joe Biden's unconditional pardon to his son Hunter Biden, to my mind is a travesty of the American justice system. What's worse is that it's an indictment of the justice system itself. A sitting president of the United States, Joe Biden, in this case, in his statement, has said that while he had faith in the American judiciary, he believes that politics has infected the American judiciary and therefore has led to a miscarriage of justice. These are not my words. These are the words of Joe Biden. If a sitting president of America says this about his justice system, you tell me who and where and why should anyone trust this American justice system?\" Seth said.\nSeth told ANI that the US Department of Justice is messed up and had taken a U-turn with Donald Trump.\n\"The Department of Justice is weaponized in the United States. We saw what happened with Donald Trump. Now you tell me, the same judge who indicted Donald Trump has now withdrawn the case. So it is an unholy mess,\" he said.\n\n\nSeth told ANI that he believed that action of US proescutors linking Gautam Adani to an alleged bribery case was because of the success India has achieved recently.\n\"What have we seen with Adanis? They are a group in India. They're operating again, under Indian regulatory systems, which are, to my mind, the best in the world or on par. What do they first say? They issue a press statement. That one particular Adani, another particular Adani have been named. Then they issue a statement. No, their names are not there. It is clearly a politicization and to my mind it's a politicization because of the success that Indians and Indian businesses have achieved. This is a play of po",
    "description2": "litical purpose. It is not a play of justice. It's not a play of equality. You know, Amartya Sen very famously in a book called The Idea of Justice says, and he says it brilliantly, he says ultimately justice is about fairness,\" he said.\nSeth said that if the outgoing US President felt that the justice department was unfair to his son, how could it be fair with Adani, or several Indians indicted in US?\n\"If the American president thinks it's unfair for his son, how can it be fair on any Indian company? Be it Adani, be it anyone. Several Indians individually have been indicted in the United States. See what happened with the famous Goldman Sachs Rajat Gupta case. So I'm telling you that today, people in India who are also the so-called woke, liberal, pseudo-liberal people should realize that the people they had hope in have actually bolted from the stables. The sitting American president on December 1 not only pardons his son, so let's not even talk about nepotism, but issues the worst indictment of the American justice system. Nothing can be more ironic. Nothing can be more telling and nothing can be more disastrous. So the Americans must recognize that they are actually in a banana republic with a kingdom which is falling apart, especially when they believe that justice is one of their important pillars of hope,\" he said.\nUS President Joe Biden on Sunday signed a pardon for his son, Robert Hunter Biden, who had been convicted on charges related to gun crimes and tax violations. The pardon ensures that Hunter Biden will not face sentencing for these offences and removes the possibility of prison time.\nIn a statement, President Biden addressed the charges against his son, arguing that individuals in similar situations--such as those with tax payment issues due to addiction--typically receive non-criminal resolutions. He contended that Hunter's case was treated differently, leading to felony charges despite the absence of aggravating factors.\nBiden also stressed his commitment to not interfere with the Justice Department's decision-making, despite his belief that his son had been \"selectively and unfairly prosecuted.\" (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202083352.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  },
  {
    "title": "Sonnalli Seygall shares heartwarming post revealing newborn daughter's name",
    "link": "https://worldsnews24.vercel.app/entertainment/sonnalli-seygall-shares-heartwarming-post-revealing-newborn-daughter-s-name",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/sonnalli-seygall-shares-heartwarming-post-revealing-newborn-daughter-s-name",
    "description": "Sonnalli Seygall shares heartwarming post revealing newborn daughter's name",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202073758.jpg",
    "description1": "\n\n\nMumbai (Maharashtra) [India], December 2 (ANI): Bollywood actress Sonnalli Seygall and her husband, Ashesh L Sajnani, have announced the name of their newborn daughter, revealing her to the world as \"Shukar.\"\nThe couple, who tied the knot in 2023, welcomed their first child, a baby girl, on 27 November 2024, Wednesday, and have shared their joy and gratitude through heartfelt posts on social media.\n\nSonnalli, widely recognized for her role in the 2011 hit film 'Pyaar Ka Punchnama', took to Instagram to introduce her daughter.\nIn her post, she expressed her overwhelming emotions and described the name Shukar as a reflection of the gratitude they feel in their lives.\n\n \n \n \n \n \nView this post on Instagram\n \n \n \n \n \n \n \n \n \n \n \n\nA post shared by Sonnalli A Sajnani (@sonnalliseygall)\n\n\nShe wrote, \"Introducing our beautiful daughter, Shukar--a name that embodies the gratitude we've carried in our hearts throughout our lives. She is our little miracle, a living testament to the abundance of love, joy, and blessings that surround us. May she grow to always recognize the beauty in each moment and live a life filled with thankfulness, just as she has been a blessing beyond words to us. Welcome to the world, our Shukar-our miracle of abundance.\"\nEarlier, Ashesh also shared a memorable video on social media, showing him joyfully dancing in the delivery room after the arrival of",
    "description2": " their baby girl. The caption read, \"Our baby is here,\" further sharing their excitement with fans.\nIn August of this year, the couple announced their pregnancy through a series of playful and heartwarming photos.\nSonnalli shared pictures of herself showing off her baby bump, enjoying chips and chocolates, while Ashesh was seen holding a beer bottle in one hand and a baby milk sipper in the other.\nTheir pet dog also made a special appearance in the images. Sonnalli captioned the post, \"From beer bottles to baby bottles... Ashesh's life is about to change! As for me, some things stay the same. Was eating for 1... now eating for 2! Meanwhile, Shamsher is taking notes on how to be a good big brother. Overjoyed & Grateful. Keep us in your prayers. December 2024. Baby coming.\"\n\n \n \n \n \n \nView this post on Instagram\n \n \n \n \n \n \n \n \n \n \n \n\nA post shared by Sonnalli A Sajnani (@sonnalliseygall)\n\n\nThe couple, who celebrated their first wedding anniversary in July, have also shared their wedding moments.\nSonnalli posted pictures from their beautiful ceremony held in June 2023 at a Gurdwara in Santa Cruz, Mumbai.\nSonnalli's career began with 'Pyaar Ka Punchnama', where she rose to fame. She went on to appear in films such as 'High Jack', 'Ishq Da Rog', and 'Jai Mummy Di'. Before entering Bollywood, she was a ramp model and participated in the Miss India Worldwide competition. (ANI)",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202073758.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  },
  {
    "title": "A Giant Leap for Pet Care in Jaipur- DCC Animal Hospital Launches Advanced Facility in the Pink City",
    "link": "https://worldsnews24.vercel.app/entertainment/a-giant-leap-for-pet-care-in-jaipur-dcc-animal-hospital-launches-advanced-facility-in-the-pink-city",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/a-giant-leap-for-pet-care-in-jaipur-dcc-animal-hospital-launches-advanced-facility-in-the-pink-city",
    "description": "A Giant Leap for Pet Care in Jaipur- DCC Animal Hospital Launches Advanced Facility in the Pink City",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202070627.jpg",
    "description1": "\n\n\nPNN\nJaipur (Rajasthan) [India], December 2: DCC Animal Hospital, a globally renowned chain of veterinary facilities, has launched its first cutting-edge veterinary hospital in Jaipur on December 1. Adhering to global Japanese standards, this state-of-the-art facility marks a transformative step in pet care for the Pink City. Strategically located in the basement of the IDB Building, FS-6, Gayatri Nagar, Maharani Farm, Durgapura, the hospital is equipped with the latest advancements in pet healthcare technology. Through this launch, DCC is ushering Jaipur into a new era of premium and advanced veterinary services.\n\nDCC Animal Hospital is a leading global veterinary chain dedicated to enhancing pet healthcare through preventative care, advanced surgical services, and knowledge-driven pet parenting. Committed to making good health accessible to all animals, DCC Animal Hospital goes beyond traditional veterinary care, embracing wellness and lifestyle solutions for a better future.\nChampioning a shift from a problem-solving mindset, DCC Animal Hospital focuses on in-depth diagnosis and professional medical care for pets, mirroring the quality of care humans receive. More than just a pet-friendly chain, DCC Animal Hospital provides a holistic ecosystem for pets, empowering pet parents with education and resources to prioritize knowledge over fear.\nGuided by its transformative vision of \"pet to partner,\" DCC Animal Hospital strives to redefine pet care, raising awareness and fostering compassion for animal well-being in India and beyond.\n\n\nDr. Vinod Sharma, Head Veterinarian, DCC Animal Hospital & Director, highlighted the strategic decision to expand into Jaipur, noting tha",
    "description2": "t while the city has a growing population of pet owners, there is a significant lack of high-quality facilities and educational resources. \"Jaipur has a massive untapped potential, where pet owners are eager for more options but are limited by the quality of services,\" he said. \"We've researched deeply into the market, and what we found was a need for better preventive care, hygiene, and knowledge on pet healthcare. DCC Animal Hospital is here to bridge that gap.\"\nThe DCC Animal Hospital aims to create a compassionate, pet-friendly ecosystem by offering services that include preventive care, vaccination education, surgical awareness, and high hygiene standards. Additionally, it will focus on educating pet owners about essential services and spreading awareness of pet healthcare and their requirements.\nDCC Animal Hospital brings world-class veterinary services to Jaipur and strives to connect with the community by way of workshops, awareness drives, and partnerships with local pet welfare organizations. DCC Animal Hospital hopes to create a more significant bond between pets, their owners, and veterinary experts.\nFor more information, kindly visit the website https://dccpets.in/\nAbout DCC Animal Hospital:\nDCC Animal Hospital, A'alda Group is a Japan-based, leading global veterinary chain of hospitals dedicated to providing high-quality and compassionate medical care to pets. With a team of experienced professionals and a commitment to excellence, the hospital strives to ensure the health and well-being of every animal in its care.\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by PNN. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202070627.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  },
  {
    "title": "Filmfare OTT awards 2024: Full list of winners in web series category",
    "link": "https://worldsnews24.vercel.app/entertainment/filmfare-ott-awards-2024-full-list-of-winners-in-web-series-category",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/filmfare-ott-awards-2024-full-list-of-winners-in-web-series-category",
    "description": "Filmfare OTT awards 2024: Full list of winners in web series category",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202064925.jpg",
    "description1": "\n\n\nMumbai (Maharashtra) [India], December 2 (ANI): The 5th edition of the Filmfare OTT Awards, in Mumbai, celebrated the very best of web series and films across 39 categories.\nThe ceremony held on December 1 was a glittering affair, attended by top celebrities, directors, and technical experts from the world of digital entertainment.\n\nAlongside the evening's nominations, which were revealed earlier in the day, the awards recognized outstanding performances, writing, and direction in the OTT space.\nAmong the big winners in the web series category, Rajkummar Rao stood out, winning the Best Actor, Series (Male) - Comedy for his role in 'Guns and Gulaabs'.\nGagan Dev Riar also received recognition for his stellar performance in 'Scam 2003: The Telgi Story', taking home the Best Actor, Series (Male) - Drama award.\nIn the female acting categories, Best Actress in a Comedy Series went to Geetanjali Kulkarni for 'Gullak' Season 4, while Best Actress in a Drama Series was awarded to Manisha Koirala for her powerful performance in 'Heeramandi: The Diamond Bazaar.'\nOther notable winners included Faisal Malik, who was honoured as Best Supporting Actor, Series (Male) - Comedy for 'Panchayat' Season 3, and R. Madhavan, who won Best Supporting Actor, Series (Male) - Drama for 'The Railway Men'.\nIn the Best Supporting Actress categories, Nidhi Bisht took home the award for her role in 'Maamla Legal Hai' (Comedy), and Mona Singh was recognized for her performance in 'Made in Heaven' Season 2 (Drama).\nThe awards also celebrated excellence behind the camera, with Best Original Story, Series going to Biswapati Sarkar for 'Kaala Paani'.\n\n\nOther notable technical awards included Best Cinematography, Series, which was shared by Sudeep Chatterjee, Mahesh Limaye, Huenstang Mohapatr",
    "description2": "a, and Ragul Herian Dharuman for 'Heeramandi: The Diamond Bazaar,' and Best Editing, Series, which went to Yasha Jaidev Ramchandani for 'The Railway Men'.\nIn the creative categories, Best Dialogue, Series was awarded to Sumit Arora for 'Guns & Gulaabs', while the Best Original Screenplay, Series award went to the talented trio of Aj Nidimoru, Krishna DK, and Suman Kumar for their work on 'Guns & Gulaabs'.\n'Scam 2003: The Telgi Story' also bagged an award for Best Adapted Screenplay, Series, with Kiran Yadnyopavit, Kedar Patankar, and Karan Vyas credited for their exceptional adaptation.\nAs for Best VFX (Series), 'The Railway Men' triumphed, with Filmgate AB and Hive Studios handling the visual effects. The Best Sound Design (Series) award was claimed by Sanjay Maurya and Allwin Rego for 'Kaala Paani', while the Best Soundtrack (Series) was awarded to Sanjay Leela Bhansali, Raja Hasan, and Sharmistha Chatterjee for their work on 'Heeramandi: The Diamond Bazaar.'\nBest Debut Director, Series went to Shiv Rawail for 'The Railway Men', marking an impressive start in his directing career.\nAt the Filmfare OTT Awards, the Critics' category saw notable winners as well. 'Guns and Gulaabs' won Best Series, while 'Mumbai Diaries' Season 2 took Best Director.\nBest Actor (Male) in Series went to Kay Kay Menon for 'Bambai Meri Jaan', and Huma Qureshi won Best Actress for 'Maharani S03'.\nIn films, 'Jaane Jaan' claimed Best Film, with Jaideep Ahlawat and Ananya Panday winning Best Actor and Actress.\nArjun Varain Singh received Special Recognition for 'Kho Gaye Hum Kahan.'\nMeanwhile, the film category saw Kareena Kapoor Khan taking home the Best Actress award for her role in 'Jaane Jaan', while Diljit Dosanjh won Best Actor for his performance in 'Amar Singh Chamkila.' (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202064925.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  },
  {
    "title": "Kayoze Irani wishes father Boman Irani on his 65th birthday, shares unseen pictures",
    "link": "https://worldsnews24.vercel.app/entertainment/kayoze-irani-wishes-father-boman-irani-on-his-65th-birthday-shares-unseen-pictures",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/kayoze-irani-wishes-father-boman-irani-on-his-65th-birthday-shares-unseen-pictures",
    "description": "Kayoze Irani wishes father Boman Irani on his 65th birthday, shares unseen pictures",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202060144.jpg",
    "description1": "\n\n\nMumbai (Maharashtra) [India], December 2 (ANI): Actor Boman Irani celebrates his 65th birthday today. On this special occasion, his son, actor Kayoze Irani, shared a series of throwback photos capturing precious family moments with the celebrated star.\nTaking to Instagram, Kayoze posted a carousel of photos and videos. Among them, one featured Boman playing the guitar, posing with his wife and children, and enjoying quality time with Kayoze.\n\nIn one of the nostalgic images, Boman is seated on a chair while his two sons, Kayoze and Danesh Irani, stand on either side. His wife, Zenobia Irani, stands behind him with one hand resting on his shoulder.\nAlong with these heartwarming photos, Kayoze also shared a video of a small jam session between father and son.\nWishing his father a happy birthday on Instagram, Kayoze wrote, \"Happy Birthday Bob @boman_irani.\"\n\n \n \n \n \n \nView this post on Instagram\n \n \n \n \n \n \n \n \n \n \n \n\nA post shared by Kayoz",
    "description2": "e Irani (@kayozeirani)\n\n\nBoman Irani is one of the most popular actors in Hindi cinema and has featured in several box-office superhits. Some of his notable films include 'Munna Bhai MBBS', 'Don', '3 Idiots', 'Happy New Year', 'Uunchai', 'PK', 'Housefull' franchise and 'Dunki'.\nBoman Irani made his directorial debut with the film 'The Mehta Boys'. He recently shared his journey of creating the film during its screening at the 55th International Film Festival of India (IFFI) in Goa.\n\"This movie was given to me by Sujoy Ghosh 10 years ago. He gave me one line for the picture, which was the beginning of the story. Then I started writing. I said I will direct it. He gave me a one-liner,\" Boman revealed.\n'The Mehta Boys' stars Shreya Chaudhary and Avinash Tiwary in lead roles, and Boman plays a father who navigates the emotional complexities of his relationship with his son.\n'The Mehta Boys' is slated to release on Amazon Prime Video soon. (ANI)",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202060144.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  },
  {
    "title": "Filmfare OTT Awards 2024: Diljit Dosanjh, Kareena Kapoor Khan take home top honours in film category",
    "link": "https://worldsnews24.vercel.app/entertainment/filmfare-ott-awards-2024-diljit-dosanjh-kareena-kapoor-khan-take-home-top-honours-in-film-category",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/filmfare-ott-awards-2024-diljit-dosanjh-kareena-kapoor-khan-take-home-top-honours-in-film-category",
    "description": "Filmfare OTT Awards 2024: Diljit Dosanjh, Kareena Kapoor Khan take home top honours in film category",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202050248.jpg",
    "description1": "\n\n\nMumbai (Maharashtra) [India], December 2 (ANI): The 5th edition of the Filmfare OTT Awards took place on Sunday, December 1, in Mumbai, bringing together a galaxy of stars from the world of digital entertainment.\nThis year's ceremony honoured outstanding web series and films, with winners across 39 categories.\n\nThe event was marked by stellar performances, heartfelt speeches, and a celebration of the rapidly evolving digital entertainment landscape.\nOne of the evening's biggest moments came when actor-singer Diljit Dosanjh clinched the Best Actor award for his portrayal of the legendary singer Amar Singh Chamkila in the web film 'Amar Singh Chamkila'.\nDirected by Imtiaz Ali, 'Amar Singh Chamkila' presented the untold true story of Punjab's original rockstar of the masses, who emerged from the shadows of poverty and rose to the heights of popularity in the eighties due to the sheer power of his music, angering many along the way, which led to his assassination at the young age of 27.\nDiljit portrayed 'Chamkila,' the top-selling artist of his era. Parineeti essayed the role of Amar Singh Chamkila's wife, Amarjot Kaur.\nOn the other hand, Kareena Kapoor Khan bagged the Best Actress award for her performance in 'Jaane Jaan'.\nHelmed by Sujoy Ghosh, the film is based in Kalimpong and is the official adaptation of the bestselling novel 'Devotion of Suspect X' by Keigo Higashino. Maya (Kareena Kapoor Khan), Naren (Jaideep Ahlawat) and Karan (Vijay Varma) navigate through a web of emotions and unforeseen circumstances as they cover up and uncover clues in a bid to outwit each other.\nMeanwhile, the ceremony was att",
    "description2": "ended by several notable figures, including actors, directors, and technical experts from the OTT industry.\nHere's a look at the full list of winners from the 2024 Filmfare OTT Awards Films Category:\nBest Film, Web Original: Amar Singh Chamkila\nBest Director, Web Original Film: Imtiaz Ali (Amar Singh Chamkila)\nBest Actor, Web Original Film (Male): Diljit Dosanjh (Amar Singh Chamkila)\n\n\nBest Actor, Web Original Film (Female): Kareena Kapoor Khan (Jaane Jaan)\nBest Supporting Actor, Web Original Film (Male): Jaideep Ahlawat (Maharaj)\nBest Supporting Actor, Web Original Film (Female): Wamiqa Gabbi (Khufiya)\nBest Dialogue, Web Original Film: Imtiaz Ali and Sajid Ali (Amar Singh Chamkila)\nBest Original Screenplay, Web Original Film: Imtiaz Ali and Sajid Ali (Amar Singh Chamkila)\nBest Cinematographer, Web Original Film: Sylvester Fonseca (Amar Singh Chamkila)\nBest Production Design, Web Original Film: Suzanne Caplan Merwanji (The Archies)\nBest Editing, Web Original Film: Aarti Bajaj (Amar Singh Chamkila)\nBest Background Music, Web Original Film: AR Rahman (Amar Singh Chamkila)\nBest Sound Design, Web Original Film: Dhiman Karmakar (Amar Singh Chamkila)\nBest Story, Web Original Film: Zoya Akhtar, Arjun Varain Singh, and Reema Kagti (Kho Gaye Hum Kahan)\nBest Music Album, Web Original Film: AR Rahman (Amar Singh Chamkila)\nBest Debut Director, Web Film: Arjun Varain Singh (Kho Gaye Hum Kahan)\nBest Debut Male, Web Film: Vedang Raina\nThe ceremony also celebrated the contributions of various technicians, such as Sylvester Fonseca for Best Cinematography and Aarti Bajaj for Best Editing, both for Amar Singh Chamkila. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202050248.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  },
  {
    "title": "Vikrant Massey announces break from acting: \"It's time to recalibrate and go back home\"",
    "link": "https://worldsnews24.vercel.app/entertainment/vikrant-massey-announces-break-from-acting-it-s-time-to-recalibrate-and-go-back-home",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/vikrant-massey-announces-break-from-acting-it-s-time-to-recalibrate-and-go-back-home",
    "description": "Vikrant Massey announces break from acting: \"It's time to recalibrate and go back home\"",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202040705.jpg",
    "description1": "\n\n\nMumbai (Maharashtra) [India], December 2 (ANI): In a shocking revelation that has left his fans and the film industry in disbelief, actor Vikrant Massey has announced that he will retire from acting after 2025.\nThe 37-year-old actor, known for his memorable roles in '12th Fail', 'The Sabarmati Report', and 'Sector 36', shared the unexpected news through an emotional note on his Instagram account on Monday morning.\n\n\"The last few years and beyond have been phenomenal. I thank each and every one of you for your indelible support. But as I move forward, I realize it's time to recalibrate and go back home. As a Husband, Father & a Son. And also as an Actor,\" Vikrant wrote, leaving many wondering about his decision to step away from the limelight.\n\n \n \n \n \n \nView this post on Instagram\n \n \n \n \n \n \n \n \n \n \n \n\nA post shared by Vikrant Massey (@vikrantmassey)\n\n\nThe actor's choice to retire comes at a time when his career is at its peak. His recent film 'The Sabarmati Report' has been basking in praise since its release.\nIn a recent conversation with the media during the closing ceremony of the 55th International Film Festival of India (IFFI), Vikrant shared his approach to his craft.\n\"I always tr",
    "description2": "y to work responsibly. Whether it is 12th Fail, Sector 36, or The Sabarmati Report, there is always an effort to entertain people while also being part of responsible cinema,\" he said.\nHe also expressed his interest in doing both entertaining and inspiring films, emphasizing the power of cinema to influence and inspire.\n\"Cinema remains a highly influential medium. Many in society draw inspiration from it. In India, we produce about 1,800 to 2,000 films annually, encompassing all genres. While all kinds of films should be made, responsible cinema is thriving, and audiences are appreciating it,\" he added.\nVikrant's career began in the television industry with the show 'Dhoom Machao Dhoom', but he rose to prominence with his role in 'Balika Vadhu' in 2009.\nHe also rose to fame with his roles in movies like 'Lootera', followed by his first lead role in 'A Death in the Gunj' (2017). He went on to establish himself as a versatile actor with standout performances in projects like 'Broken But Beautiful', 'Ginny Weds Sunny', 'Haseen Dilruba', 'Love Hostel', and '12th Fail'.\nAlthough he is stepping away from acting, fans can still look forward to Vikrant's final projects, set for release in 2025. (ANI)",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202040705.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  },
  {
    "title": "L2 Empuraan: Mohanlal wraps shooting of 'Lucifer' sequel, calls it a remarkable chapter in his acting journey",
    "link": "https://worldsnews24.vercel.app/entertainment/l2-empuraan-mohanlal-wraps-shooting-of-lucifer-sequel-calls-it-a-remarkable-chapter-in-his-acting-journey",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/l2-empuraan-mohanlal-wraps-shooting-of-lucifer-sequel-calls-it-a-remarkable-chapter-in-his-acting-journey",
    "description": "L2 Empuraan: Mohanlal wraps shooting of 'Lucifer' sequel, calls it a remarkable chapter in his acting journey",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202035345.jpg",
    "description1": "\n\n\nMumbai (Maharashtra) [India], December 2 (ANI): The shoot for superstar Mohanlal's much-awaited sequel to blockbuster 'Lucifer', titled, 'L2: Empuraan,' has finally concluded and it is now slated to release in theatres on March 27, 2025.\n'L2: Empuraan' marks the third directorial of actor Prithviraj Sukumaran starring Mohanlal in the lead role.\n\nTheir first collaboration was the 2019 film 'Lucifer'.\nThrough an Instagram post, Mohanlal shared that 'L2:Empuraan' was shot for 14 months across eight Indian states and four countries, including the UK, USA, and UAE.\nThe 'Lucifer' actor expressed gratitude to the director Prithviraj and writer Murali Gopy for their creativity and visionary storytelling.\nWhile sharing the poster of 'L2:Empuraan' on his Instagram feed, the superstar wrote, \"That's a wrap for L2: Empuraan! What an incredible 14-month journey across 8 states and 4 countries, including the UK, USA, and UAE. This film owes its magic to the brilliant direction of @therealprithvi whose creativity elevates every frame. A big thank you to @muraligopynsta for his visionary storytelling that f",
    "description2": "orms the heart of this film. A heartfelt thank you to @antonyperumbavoor for his unwavering belief in this project and to Mr Subaskaran and Lyca Productions for their invaluable support.\"\nMohanlal also said 'L2:Empuraan' was a 'remarkable chapter' in his acting journey which he will 'always treasure.'\n\"None of this would have been possible without the dedicated cast and crew, who bring this story to life. L2: Empuraan has been a remarkable chapter in my journey as an artist, one I'll always treasure. To our amazing audience, your love and support inspire us every step of the way. Stay tuned--there's so much more to come! Malayalam | Tamil | Telugu | Kannada | Hindi,\" he added.\n\n \n \n \n \n \nView this post on Instagram\n \n \n \n \n \n \n \n \n \n \n \n\nA post shared by Mohanlal (@mohanlal)\n\n\nThe first part of the franchise received a massive response from the fans and witnessed Mohanlal as the charismatic and enigmatic Stephen Nedumpally.\n'L2: Empuraan' will be produced under the banner of Lyca Productions. Apart from Mohanlal, actors Tovino Thomas and Manju Warrier will play prominent roles in the film. (ANI)",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202035345.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  },
  {
    "title": "Olive oil vs mustard oil: Which is healthier for the heart?",
    "link": "https://worldsnews24.vercel.app/entertainment/olive-oil-vs-mustard-oil-which-is-healthier-for-the-heart",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/olive-oil-vs-mustard-oil-which-is-healthier-for-the-heart",
    "description": "Olive oil vs mustard oil: Which is healthier for the heart?",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115881887/115881887.jpg",
    "description1": "Oil plays a central role in maintaining overall health and is mostly linked directly with heart health. When it comes to maintaining a healthy heart, most people think of changing their cooking oil first. The oil that we consume can have a beneficial effect or a detrimental effect on the body depending on its properties.Among the various cooking oils available, olive oil and mustard oil stand out for their potential cardiovascular benefits. Both oils have unique nutritional properties, but their suitability for heart health depends on their composition, the type of cuisine, and how they are used. Olive oil has anti-inflammatory propertiesOlive oil is extracted from olives and is a staple in Mediterranean cuisine. It is renowned for being rich in monounsaturated fatty acids (MUFAs), particularly oleic acid, which is known to lower bad cholesterol (LDL) levels while maintaining or even boosting good cholesterol (HDL). Olive oil also contains powerful antioxidants like polyphenols and vitamin E, which help reduce inflammation, a critical factor in heart disease.Olive oil linked to low amounts of bad cholesterol in bloodResearchers from the University of Florida found that following a extra virgin olive oil (EVOO) diet resulted in lowered amounts of ‘bad’ cholesterol in the bloodstream. The study published in the Journal of the American Heart Association found that dietary changes resulted in lower cardiovascular risk factors compared with baseline levels, with a greater difference in optimal directions following the transition to a l",
    "description2": "ow EVOO diet, suggesting that EVOO may not be the beneficial additive of a Mediterranean Diet. 115215721Mustard oil has fatty acids that can prevent blood clotsMustard oil, derived from mustard seeds, is commonly used in Indian cooking. It has a distinctive pungent flavor and is rich in alpha-linolenic acid (ALA), an omega-3 fatty acid, as well as omega-6 fatty acids. These essential fatty acids are vital for reducing triglycerides and preventing blood clots, which can lower the risk of heart disease. Mustard oil also contains natural antioxidants and exhibits anti-inflammatory properties.Another notable feature of mustard oil is its high smoke point, making it suitable for high-temperature cooking methods like frying, which are prevalent in Indian cuisine. However, mustard oil contains erucic acid, which, in excessive amounts, has been debated for its potential adverse health effects. The presence of erucic acid in mustard oil has raised concerns regarding its cardiovascular safety, prompting regulatory scrutiny and public debate.Which one of these oils is heart-friendly?The best source for those seeking better heart health benefits is olive oil. It is suitable for low heat, cooking as it can be used for dressings and dips or even as a simple addition to a Mediterranean-style diet. Meanwhile, mustard oil holds cultural relevance and practicality for households in India as it has a high smoke point and is suitable for Indian cooking. It affords unique benefits, particularly to those who consume traditional Indian diets.ReplyForward",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115881887/115881887.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-12-02T08:25:00+05:30",
    "dateModified": "2024-12-02T08:25:00+05:30"
  },
  {
    "title": "5 leaves that must feature in saag recipe and why",
    "link": "https://worldsnews24.vercel.app/entertainment/5-leaves-that-must-feature-in-saag-recipe-and-why",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/5-leaves-that-must-feature-in-saag-recipe-and-why",
    "description": "5 leaves that must feature in saag recipe and why",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115881053/115881053.jpg",
    "description1": "Saag is the word for one of the best North Indian delights that go perfectly with winters. Nutritious delight, this green dish generally consists of a mixture of leaves that enhance the flavor while also providing an abundance of healthful benefits. So, these leaves in the right mix are must-have ingredients for any saag recipe. Here are the 5 essential leaves and reasons why.115714310Mustard leaves (sarson) Mustard leaves are the main ingredient of any traditional saag recipe. They have a slightly bitter and peppery flavor, and are rich in vitamins A, C, and K, which give an earthy depth to the dish. Mustard leaves are also full of antioxidants and dietary fiber, which helps boost immunity and improves digestion during winters.ALSO READ: 5 Types of desi Saag (leafy greens) that are a must have in this seasonSpinach (palak) Spinach is a versatile leafy vegetable that goes well with the strong flavor of mustard leaves. The mild taste of spinach balances the bitterness of mustard, giving a perfect flavor profile. Spinach is rich in iron, magnesium, and folate, which helps prevent anemia and strengthens bones. Its high antioxidant content supports overall health, making it a must-have in your saag.115891503106522878Fenugreek leaves (methi) Fenugreek leaves are added to saag, giving it a slight bitterness and a distinct aroma. They are very rich in iron, calcium, and vitamin C and have been known to help with inflammation and regulate blood sugar levels. Fenugreek is also known to help digest food, which makes it a great addition to a hearty saag recipe.115443268Bathua (chenopodium or lamb's quarters)Bathua, a winter-special leafy green, brin",
    "description2": "gs a nutty flavor and creamy texture to saag. This humble green is a powerhouse of vitamins A and C, calcium, and potassium. Bathua helps detoxify the body, supports gut health, and is especially beneficial during the cold months for maintaining energy levels. 106601328Radish leaves (mooli ke patte)Often overlooked, the leaves of the radish plant are very nutritious and lend a mild pungency to saag. They contain vitamins A, C, and B6, and magnesium and potassium. These leaves enhance metabolism, boost immunity, and add a unique flavor to the dish. Including radish leaves ensures your saag is as nutrient-dense as it is delicious. ALSO READ: The right way to cook saag according to Ayurveda to get maximum benefitsWhy these leaves make the perfect blend?The five leaves blended together will make a delicious and balanced saag. The interplay of mustard's spiciness, spinach's blandness, fenugreek's bitterness, bathua's nutty flavor, and the pungency of radish leaves makes for a complex, hearty dish. Each leaf brings its specific health benefits, so saag is not only comfort food but a winter superfood that supports immunity, digestion, and overall well-being. 105564415Pro tip for preparing saagTake that perfect saag to complete perfection by first slow-cooking the green until well-ripened or tender as well as with flavors then blend into puree till coarse, top it by tempering garlick, gingers, or ghee for more pronounced aroma, additional fragrances, but for finish, add this saag with a scoop of melted butter and traditional makki ki roti.115891492Add these five leafy greens to your saag recipe to take it to a whole new height of taste and health!",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115881053/115881053.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-12-02T08:00:00+05:30",
    "dateModified": "2024-12-02T08:00:00+05:30"
  },
  {
    "title": "6 important questions to ask kids everyday",
    "link": "https://worldsnews24.vercel.app/entertainment/6-important-questions-to-ask-kids-everyday",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/6-important-questions-to-ask-kids-everyday",
    "description": "6 important questions to ask kids everyday",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115837830/115837830.jpg",
    "description1": "Caring for a child is only one aspect of parenting; another involves creating deep emotional bonds and guiding them in developing into kind, self-assured adults. Parents may build a stronger relationship with their children, have meaningful conversations, and gain insight into their inner world by asking them meaningful questions every day. Here are six unique and powerful questions every parent should ask their child daily to foster emotional intelligence and mutual understanding. What is one kind thing you did for someone today?Teaching kindness starts with recognizing and celebrating small acts of generosity. By asking this query, parents inspire the kids to consider their behaviour and discover satisfaction in lending a hand to others. Also, it could inspire individuals to practise compassion more consistently. What is something new you discovered or found interesting today?Children spend their days studying and exploring because they are naturally curious. Whether it's an interesting fact they discovered in school, an original thought they had, or something they noticed, this question invites kids to share their experiences. It keeps you active in their intellectual development and develops their love of learning.  115837872Did anything puzzle you or make you feel ",
    "description2": "sad today?Creating a safe space for your child to express their struggles is crucial. This question allows them to open up about things that bothered them during the day, whether it's a tough moment with friends or a challenge they faced. Listening attentively can help them feel supported and teach them how to process difficult emotions. What was the most exciting or happiest moment of your day?Highlighting positive experiences helps your child focus on the good things in life. Whether it’s a fun activity, an achievement, or a moment of laughter, this question reinforces gratitude and gives you an insight into what makes your child happy.  115837847What made you laugh or smile today?Laughter is a window into a child’s heart. By asking this, you not only encourage your child to relive joyful moments but also show interest in what they find amusing. It’s a great way to bring a touch of positivity and lightness to your conversation. If you could change one thing about today, what would it be?The child can use this question to critically evaluate their day and consider areas for growth. It helps them develop their problem-solving abilities and gives them the confidence to face the following day with initiative. It also helps parents understand their goals or disappointments.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115837830/115837830.jpg",
    "image1": "",
    "date": "30/11/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-11-30T15:00:00+05:30",
    "dateModified": "2024-11-30T15:00:00+05:30"
  },
  {
    "title": "7 benefits of chewing curry leaves every morning",
    "link": "https://worldsnews24.vercel.app/entertainment/7-benefits-of-chewing-curry-leaves-every-morning",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/7-benefits-of-chewing-curry-leaves-every-morning",
    "description": "7 benefits of chewing curry leaves every morning",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115819501/115819501.jpg",
    "description1": "Curry leaves, which are frequently termed Murraya Koenigii, is a staple in the Indian menu and also possess a plethora of medicinal benefits that might not be known to many! These curry leaves are more than mere garnishes for dishes but have plenty of nutritional advantages along with being incredibly tasty. Consuming a few curry leaves before you start your day can be a great source of energy. Here are some reasons why you must incorporate curry leaves in your day-to-day life: 1. Improves Digestion: Due to their high fibre content, which helps with bowel movements, it also helps avoid the discomfort of constipation. For those who face gastrointestinal problems, curry leaves are a fantastic option that helps cope with acidity by regulating the gut. 2. Improves Quality of Hair: According to Eshanka Wahi, culinary nutritionist, holistic wellness coach, founder, Eat Clean With Eshanka, “Various components like beta-carotene and antioxidants, which are abundant in curry leaves, help thicken and repair damaged hair, delay grey hair, and significantly minimize the loss of hair. They help with hair growth and maintenance, which is why they are a good addition to hair oils.” 115744983 3. Modulates Blood Sugar Levels: Studies indicate that curry leaves can significantly help enhance insulin sensitivity and re",
    "description2": "duce levels of sugar in the blood, thereby rendering them very beneficial for people who are diabetic or even might be.4. Promotes Weight Loss: Another big advantage of consuming curry leaves on a daily basis is their ability to enhance proper digestion of fat and increase metabolism, thereby helping lose weight. They also help boost the body’s capability to burn calories to maintain a proper weight while promoting the timely disintegration of fats. 115767793 5. Enhances Liver Health: Through the process of detoxification, which curry leaves help enhance, can aid in the purification of the lungs. They help the body remove contaminants, hence enhancing resistance and overall wellness. 115819507 6. Improves the Health of the Skin: With the presence of antioxidants in curry leaves, they help safeguard the skin from harmful free radicals. They also enhance skin complexion by helping to lighten dark patches and pimples. 7. Enhances Immunity: The leaves include a lot of antioxidants along with essential vitamins too, which assist in protecting the body from oxidative stress, thereby preventing cell damage while decreasing the chance of developing chronic illnesses that include cancer and heart disease.Fresh curry leaves can be used whole, or dried leaves can be crushed to make a flavorful powder. 115443349",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115819501/115819501.jpg",
    "image1": "",
    "date": "30/11/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-11-30T09:00:00+05:30",
    "dateModified": "2024-11-30T09:00:00+05:30"
  },
  {
    "title": "What is lighthouse parenting and how it can help raise confident kids",
    "link": "https://worldsnews24.vercel.app/entertainment/what-is-lighthouse-parenting-and-how-it-can-help-raise-confident-kids",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/what-is-lighthouse-parenting-and-how-it-can-help-raise-confident-kids",
    "description": "What is lighthouse parenting and how it can help raise confident kids",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115815283/115815283.jpg",
    "description1": " No matter how stressful your corporate day job is, or how much your business makes you want to scratch your forehead during dire hours – parenting, many believe, is the trickiest of them all! The job that’s somewhat based on instincts, your intuitions, and gut feelings, and is largely about double, sometimes triple checking every single decision you make about your kid – is bound to take a toll on parents sometimes. However, the key to ace parenting, is to keep calm and carry one while you unlearn and learn!What is parenting?Parenting is the process of nurturing, protecting, and guiding a child from infancy to adulthood. It involves supporting a child's physical, cognitive, social, emotional, and educational development. Parenting can also refer to the care of a child by a caregiver or guardian, not just a biological parent.What is lighthouse parenting?Economist and parenting author Emily Oster, on a recent broadcast of ‘CBS Mornings Plus’, described a specific parenting style, called ‘lighthouse parenting’. She said, while urging the parents, “You’re the lighthouse. You’re guiding them, you’re showing them where the rocks are, but you’re giving them some independence. And it’s something between, you’re driving the boat for them, which is too involved, or you’re just letting them crash into the rocks, which is not recommended.”Psychologist Cara Damiano Goodwin explained to HuffPost, that, a parent who is acting like a lighthouse “points out the dangers in their children’s environments but ultimately lets their child steer their own boat.”As per Goodwin, examples of this parenting style include “giving your child strategies for remembering their homework, but not bringing it to school for them if they forget,” and “allowing them to figure out a compromise with their sibling on their own, rather than serving as a referee for sibling fights.” 115815324Dr. Ken Ginsburg, the founder and program director of the Center for Parent and Teen Communication and a professor of pediatrics at the Children’s Hospital of Philadelphia, told HuffPost, “The term ‘lighthouse parenting’ is a metaphor to explain what we know works. What young people need, is both to be guided and for us to have appropriate boundaries to keep them safe.” Talking more the “reliable” style of parenting, he added, “We should trust that kids are going to learn to navigate the world on their own, but at the same time, we have to protect them.”Does li",
    "description2": "ghthouse parenting help raise confident kids?While all kids need both guidance and autonomy, teens in particular are eager to navigate the world on their own. Lighthouse parenting describes a way for parents to remain an influential presence in teens’ lives without hindering the independence we want them to achieve.As per Goodwin, “We need to show them that we have confidence and trust in them so that they can develop self-confidence. They also need to be allowed the chance to fail and make mistakes while they are still somewhat supported by their parents. Otherwise, they may fall apart when they fail for the first time as an adult out on their own.”For example, If your kid doesn’t finish their homework, instead of doing it for them (or hounding them endlessly about it), you, as a parent, might stand back, allowing them to experience the consequences of missing an assignment — which could motivate them to behave differently next time.As per Ginsburg, teens want to know that they are loved. At the same time, “they don’t want people to demand or to dictate,” he said. “They want guides.”Key points of lighthouse parenting: While lighthouse parenting is not a \"one size fits all\" approach, many children benefit from the parenting style depending on their needs and environment. The key points about the lighthouse parenting are:Balancing guidance and boundaries: Lighthouse parents provide guidance and set boundaries, while also allowing children to learn from their mistakes and navigate their own experiences. 115815381Encouraging independence: Lighthouse parents trust their children to make good decisions and follow the rules, which encourages independence.Providing emotional support: Lighthouse parents offer consistent emotional support while encouraging children to face challenges and solve their own problems.Celebrating successes: Lighthouse parents acknowledge and celebrate their children's achievements, which can boost their self-esteem and motivation.Helping children learn from failures: Lighthouse parents help children learn from their mistakes, which can help them develop a growth mindset.Building a relationship: Lighthouse parenting can help build a relationship between parent and child.Some benefits of lighthouse parenting include: Healthy boundaries, Developing coping skills, Learning essential life skills like confidence and independence, and Gaining the courage to confront obstacles head-on. 102164741",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115815283/115815283.jpg",
    "image1": "",
    "date": "29/11/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-11-29T21:33:00+05:30",
    "dateModified": "2024-11-29T21:33:00+05:30"
  },
  {
    "title": "How to quickly learn anything, neuroscientist reveals",
    "link": "https://worldsnews24.vercel.app/entertainment/how-to-quickly-learn-anything-neuroscientist-reveals",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/how-to-quickly-learn-anything-neuroscientist-reveals",
    "description": "How to quickly learn anything, neuroscientist reveals",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115810200/115810200.jpg",
    "description1": "When we think about mastering a new skill— whether it’s playing a musical instrument, learning a language, or perfecting a dance move—most of us focus on repetition. Practice makes one perfect, right? Neuroscientist Andrew Huberman sheds light on something even more fascinating: the power of pauses in supercharging our learning process.  The secret in the pause Recent research highlights that brief pauses during practice are far more than just breaks— they’re integral to the learning process. Gap effects research has identified that resting for just 10 seconds while practising a skill allows your brain to replay and reinforce what you’ve just learned  Here’s the astonishing part: During these short pauses, your brain doesn’t just sit idle. Instead, it replays the skill you’ve been practising at lightning speed— 20 to 30 times faster than normal— and often in reverse. It’s like your brain is rewinding and reviewing your actions to strengthen the connections needed to perform them better.  Practicing without practising Imagine you’re learning a new piano piece or perfecting your tennis serve. After a few repetitions, you stop for a quick break. During this pause, your brain's neurons fire rapidly, mimicking the action you were practising. This neural replay reinforces the skill, essentially letting you practice without actively moving. Neural recordings show that during these rest periods, your brain becomes highly active, refining your skills and improving your ",
    "description2": "learning, so your next attempt is even stronger.  Why does this work? The replay and consolidation of the information by the brain during rest is the basic concept through which we learn. When we repeat a skill without pausing, our neurons may not have enough time to process and solidify the information but once breaks are introduced, there is a chance for the rearrangement and strengthening of those neural pathways related to a particular skill.  It’s like building a strong foundation: practising creates the bricks, but pausing allows your brain to cement them into place.  How to use this insight - If you’re working on mastering something new, here’s how to apply this brain hack: - Practice in small chunks: Focus on the skill for a few minutes. - Take short breaks: Pause for 10 to 15 seconds of complete rest. Let your brain do its work. - Repeat: Alternate between practice and rest. This works for anything, from studying to actual sports, helping you progress faster while reducing fatigue. The big picture The insight of how the brain learns changes our approach to the skill-building process and practice. The discovery reveals that sometimes the most important work is to do nothing. By allowing your brain to optimize its processes during short breaks, you’re not only learning smarter but also paving the way for long-term mastery.  So, the next time you’re practising, remember: pausing isn’t slacking— it’s part of the strategy.13700391115593148104441185115427749 ",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115810200/115810200.jpg",
    "image1": "",
    "date": "29/11/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-11-29T18:21:00+05:30",
    "dateModified": "2024-11-29T18:21:00+05:30"
  },
  {
    "title": "Amidst separation rumours from Aishwarya Rai, throwback to the time Abhishek Bachchan gave Shweta Bachchan a haircut after an argument!",
    "link": "https://worldsnews24.vercel.app/entertainment/amidst-separation-rumours-from-aishwarya-rai-throwback-to-the-time-abhishek-bachchan-gave-shweta-bachchan-a-haircut-after-an-argument",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/amidst-separation-rumours-from-aishwarya-rai-throwback-to-the-time-abhishek-bachchan-gave-shweta-bachchan-a-haircut-after-an-argument",
    "description": "Amidst separation rumours from Aishwarya Rai, throwback to the time Abhishek Bachchan gave Shweta Bachchan a haircut after an argument!",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115894298/115894298.jpg",
    "description1": "Abhishek Bachchan and Aishwarya Rai are currently in the eye of a storm, as rumours of their separation refuse to die down, and the duo haven't been seen papped since months now, with Aishwarya being seen with daughter Aaradhya at most public events.115761288In an old episode of Navya Nanda Naveli's podcast, \"What The Hell Navya,\" the Bachchan family shared some fond memories from their childhood, reminiscing about playful and mischievous moments. The podcast episode highlighted the fun and sometimes bumpy bond between Abhishek Bachchan and his sister, Shweta Bachchan. Shweta openly spoke about a hilarious incident from their childhood.Like many siblings, Abhishek and Shweta Bachchan enjoyed teasing each other. Shweta shared a funny story from their childhood when their parents were away for the night. They had a little argument, and Abhishek, holding scissors, decided to resolve it by giving Shweta an unexpected impromptu haircut then and there.As Shweta recalled,\"We had a fight. Parents were out at night and we had some kind of argument. I don’",
    "description2": "t know how he found a pair of scissors, and he just caught my hair, and he just... I had to go to school with that. Nani would put pins on my hair.\"The fun teasing between siblings went on as Shweta Bachchan talked about what happened after the surprising haircut. With her hair all uneven, she had to deal with school the next day. Thankfully, their grandmother came up with a clever solution, using pins to style her hair. Even though it all started with a disagreement, this incident became a fond memory in their sibling bond.Shweta's mom, Jaya Bachchan, joined the talk, bringing some humor to the memory. She laughed as she told everyone that Abhishek cut Shweta's hair right down the middle of her head.115847756Apart from the haircut story, Shweta Bachchan also talked about some fun times from her childhood. She mentioned how her mom used to carefully braid her hair every morning before school. The podcast gave a nice look into the tight-knit Bachchan family, showing how their sibling bond has been filled with love, fun, and laughter over the years.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115894298/115894298.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "TOI Entertainment Desk",
    "datePublished": "2024-12-02T14:11:00+05:30",
    "dateModified": "2024-12-02T14:11:00+05:30"
  },
  {
    "title": "Pics: Suhana and Gauri Khan turn heads in chic, casual outfits as they jet off from Mumbai",
    "link": "https://worldsnews24.vercel.app/entertainment/pics-suhana-and-gauri-khan-turn-heads-in-chic-casual-outfits-as-they-jet-off-from-mumbai",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/pics-suhana-and-gauri-khan-turn-heads-in-chic-casual-outfits-as-they-jet-off-from-mumbai",
    "description": "Pics: Suhana and Gauri Khan turn heads in chic, casual outfits as they jet off from Mumbai",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892154/115892154.jpg",
    "description1": "Suhana Khan and Gauri Khan have once again showcased their status as one of Bollywood's most stylish mother-daughter duos. On Monday, the pair was spotted jetting off from Mumbai, turning heads with their effortlessly chic casual outfits.In a viral video, Suhana showcased her emerging fashion sense by completing her classy look with a crop top, an unbuttoned jacket, blue denim jeans, and stylish shades. Known for her chic style, Suhana continues to capture attention with her trendy outfits.115892154115892163115892173Meanwhile, Gauri was spotted wearing a stylish denim outfit, complemented by a cap, a yellow handbag, and trendy sneakers. Her casual yet fashionable ensemble perfectly matched the chic vibe of her daughter, Suhana.115892185115892191Recently, Suhana expressed her excitement over Dua Lipa's performance of the viral mashup of \"Lev",
    "description2": "itating\" and Shah Rukh Khan's \"Woh Ladki Jo\" during a concert in Mumbai. Sharing a video of the performance on her Instagram Stories, she added heart eyes, zany face, and dancing emojis to convey her spirit. Fans also reacted positively on social media, celebrating the unexpected collaboration and praising Dua for embracing Indian pop culture.Reportedly, Suhana is set to make her much-anticipated big-screen debut alongside her father, Shah Rukh Khan, in the upcoming film 'King'. The movie, directed by Sujoy Ghosh, will explore the life of a complex don, played by Shah Rukh, who acts as a mentor to Suhana's character. The narrative promises to delve into themes of survival and mentorship as they navigate a dangerous world together. Abhishek Bachchan is reportedly cast as the antagonist, adding an intriguing dynamic to the storyline. 115851298",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892154/115892154.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "TOI Entertainment Desk",
    "datePublished": "2024-12-02T13:04:00+05:30",
    "dateModified": "2024-12-02T13:04:00+05:30"
  },
  {
    "title": "Kate Middleton and Prince William to make joint appearance with kids at upcoming Christmas carol service; survivors from Taylor Swift dance class attack invited",
    "link": "https://worldsnews24.vercel.app/entertainment/kate-middleton-and-prince-william-to-make-joint-appearance-with-kids-at-upcoming-christmas-carol-service-survivors-from-taylor-swift-dance-class-attack-invited",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/kate-middleton-and-prince-william-to-make-joint-appearance-with-kids-at-upcoming-christmas-carol-service-survivors-from-taylor-swift-dance-class-attack-invited",
    "description": "Kate Middleton and Prince William to make joint appearance with kids at upcoming Christmas carol service; survivors from Taylor Swift dance class attack invited",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892026/115892026.jpg",
    "description1": "Prince William and Kate Middleton, are set to make a joint appearance with their three children - Prince George, Princess Charlotte and Prince Loius, at the Princess of Wales's upcoming Christmas carol service. This will be among the few rare appearances that the two will make together following sensational rumours about their married life. The couple, who battled nasty cheating and divorce allegations early this year, will step up and put on a united front amidst the persistent rumours. According to The Independent, the Princess of Wales will deliver a heartfelt Christmas message about the importance of love, which she describes as “the greatest gift we can receive.”Prince William and Kate Middleton, alongside their three children, will attend the Princess of Wales's Christmas carol service at Westminster Abbey. Amidst persistent rumours about their relationship, Kate will deliver a heartfelt message emphasizing love and unity. The service will highlight charitable causes and honor survivors of recent attacks, embodying the festive spirit.The message that was posted via the Prince and Princess' official Instagram handle with a caption, \"A special letter, reflecting on the importance of love, empathy and how much we need one another in the most difficult times. This will be given to each of the guests at the Together at Christmas Carol Service at Westminster Abbey and the fifteen Community Carol Services across the country, thanking those attending for all they do for others.\"According to Vanity Fair, Kate has ",
    "description2": "written a letter for the 1,600 Westminster Abbey carol goers, including members of the royal family, telling them “Love is the light that can shine bright, even in our darkest times.\"\"This Carol Service is a heartfelt celebration of every one of you, and a reminder that at Christmas, and throughout the year, we must all shine for each other. Because in times of joy and sadness, we are all each other’s light,” the message readThe public appearance comes at a time when speculation about their relationship has dominated headlines, with rumours of tension reportedly straining the royal couple. Despite multiple denials of a rift in the family, the royal couple has often found themselves in the midst of excessive media scrutiny. The special guests expected to attend the service include the survivors of the Southport attack on children attending a Taylor Swift dance class.This year’s service will also highlight an emotional moment of solidarity, as survivors of the recent attack that left three children killed and several others injured. While there is currently no confirmation about the children and their families attending the event, reports have confirmed that the families have been invited to be a part of the festive celebrations. Kate has been hosting the Christmas carol service since 2021, using the occasion to spotlight charitable causes, honour unsung heroes, and bring attention to social issues. The event combines musical performances among other tributes, symbolising the spirit of the holiday season.115792208",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892026/115892026.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "TOI Entertainment Desk",
    "datePublished": "2024-12-02T12:57:00+05:30",
    "dateModified": "2024-12-02T12:57:00+05:30"
  },
  {
    "title": "IU and Byeon Woo Seok join hands for new romance drama set in a Modern Monarchy",
    "link": "https://worldsnews24.vercel.app/entertainment/iu-and-byeon-woo-seok-join-hands-for-new-romance-drama-set-in-a-modern-monarchy",
    "siteurl": "https://worldsnews24.vercel.app/entertainment/iu-and-byeon-woo-seok-join-hands-for-new-romance-drama-set-in-a-modern-monarchy",
    "description": "IU and Byeon Woo Seok join hands for new romance drama set in a Modern Monarchy",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115891177/115891177.jpg",
    "description1": "IU and Byeon Woo Seok are set to take on lead roles in an intriguing new drama that blends romance with the charm of a constitutional monarchy. On December 2, Kakao Entertainment revealed that the two actors would headline MBC’s upcoming drama tentatively titled Wife of a 21st Century Prince.This unique love story takes place in an alternate Korea where the country is governed by a constitutional monarchy. The plot follows Sung Hee Joo, a chaebol heiress with everything she could ever want except noble status, and Lee Ahn, a prince with royal blood but little else to his name.IU will portray Sung Hee Joo, the beautiful and intelligent second daughter of Korea’s wealthiest conglomerate family. Although she has always led a privileged life, her commoner status unexpectedly becomes a stumbling bloc",
    "description2": "k, throwing her otherwise perfect existence into turmoil. This twist leads her into an unexpected connection with Prince Lee Ahn.Meanwhile, Byeon Woo Seok will play Lee Ahn, the king’s second son who has spent his life concealing his royal lineage. Despite his royal title, he lacks power, wealth, or influence. However, his life takes a dramatic turn after crossing paths with Sung Hee Joo, sparking a journey of transformation and self-discovery.The drama promises to delve into themes of love, identity, and societal expectations in a world where tradition clashes with modernity.Scheduled to air in the second half of 2025, Wife of a 21st Century Prince is already generating excitement among fans, as it marks a fresh collaboration between IU and Byeon Woo Seok in a story full of charm and complexity.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115891177/115891177.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 1:16:50 pm",
    "courtesy": "TOI Entertainment Desk",
    "datePublished": "2024-12-02T12:31:00+05:30",
    "dateModified": "2024-12-02T12:31:00+05:30"
  }
]