[
  {
    "title": "Aisles that tell stories: Understanding the rise of grocery store tourism",
    "link": "http://localhost:3000/fitness/aisles-that-tell-stories-understanding-the-rise-of-grocery-store-tourism",
    "siteurl": "http://localhost:3000/fitness/aisles-that-tell-stories-understanding-the-rise-of-grocery-store-tourism",
    "description": "Beyond local foods, this travel trend helps people form a deeper connection to a destination’s daily life and traditions.",
    "thumbnail": "https://images.indianexpress.com/2024/11/grocery_1600_getty_378306.jpg",
    "description1": "Travellers often flock to museums, forts, parks, and restaurants to explore a country’s essence. But many enthusiasts are now discovering a destination’s soul through its grocery stores and supermarkets. This unique travel trend, aptly \"Grocery Store Tourism,\" allows visitors to engage with a region’s food culture by experiencing local flavours, ingredients, and consumer habits. Simply put, it's a way of experiencing a culture through its food systems and native consumer habits rather than traditional tourist attractions. “Grocery store tourism shows what makes a destination unique. Unlike restaurants or traditional food markets, supermarkets offer insights into the daily life of the residents. From deciphering Japanese miso paste labels and seaweed snacks to browsing French artisanal cheese aisles, these spaces reflect a region’s culinary identity,” said Jatinder Paul Singh, CEO and co-founder of Viacation. In a New York magazine write-up, writer Richard Morgan once called grocery stores “the secret museum in every city”, and said he learned more while in a grocery store in Bogotá, Colombia, than he did at the city's Museum of Gold. This tourism trend offers affordable, fun, authentic experiences. “From small-town farmer markets to gourmet boutiques, grocery stores have tourists showing up to discover local ingredients in small towns and sampling condiments unique to the destination, at the tap of a card and a reasonable price point for experimentation,\" said Sridhar Keppurengan, head of Cross Border Payments, India and South Asia, Visa. A peak into local life For some, grocery store tourism means more than just sampling local snacks. It’s about feeling like a local. Janani Gopalakrishnan, 30, a fintech product manager, recalled relishing a \"delicious local dessert\" Mitarashi Dango in a supermarket outside Mt Fuji in Japan while observing locals pick bento-box lunches. \"It was nice to see a slice of everyday Japanese culture. It felt like the true meaning of finding joy in the ordinary,\" said Gopalakrishnan, who also said she has loved grocery tourism since childhood. \"It provides local ingredients and products as souvenirs that extend the journey after the trip. If visited with curiosity, one may discover some hidden culinary gems while gaining a greater appreciation for everyday life in one's destination,\" said Singh. In countries like Italy or France, you might find regional olive oils, vinegar, or chocolates. In Southeast Asia, people often search for specialty spices or noodles. \"The focus is on learning how food is grown, processed, and consumed, and sometimes even discovering new recipes based on the items found,\" mentioned Chef Nitten Chughh, culinary director, Caravela Beach Resort, South Goa. A global phenomenon Agoda's upcoming 2025 travel trend survey showed that experiencing local cultures continues to be one of the top reasons for travel. \"Large supermarkets serve as cultural mirrors, showing local preferences in how they present products and fresh foods. These ",
    "description2": "aisles tell stories of a region's agricultural bounty and culinary heritage,\" said Krishna Rathi, senior country director, India Subcontinent and MEA at Agoda. \"For instance, the famous ham and cheese toasties from 7/11 in Thailand, a simple yet delightful treat that has become a must-try for visitors. In Japan, the variety of exclusive convenience store snacks, from matcha-flavoured KitKats to unique onigiri, provides a taste of the country's innovative approach to food,\" she said. Indian tourists have embraced this trend, seeking deeper connections with foreign cultures. Keppurengan noted that Visa data showed Indian travellers spending more on groceries in countries like Sweden, Spain, and Australia. \"Over the past three years, Indians have been spending proportionately more on food and grocery in European countries such as Sweden, Switzerland, and Spain – regions known for their exotic spices, fresh organic produce, and quintessential delicacies. Lately, we’ve seen a similar trend among Indian tourists to spend on groceries when travelling across Australia, Indonesia, and Malaysia as well,\" said Keppurengan. In a country like India, grocery tourism provides opportunities for hands-on learning about food cultivation, preparation, and cooking techniques. \"Some regions of India host food festivals and culinary tours that include visits to local grocery stores and markets, where participants can learn about traditional food preparation, regional ingredients, and even participate in cooking demonstrations,\" said Chughh. A sustainable, \"Instagrammable\" experience Grocery tourism also caters to eco-conscious travelers. Many destinations promote organic, locally grown products or sustainable practices, drawing those who value ethical consumption. Social media has amplified the trend, with influencers sharing unique grocery hauls, talking about exotic snacks and local specialties. Travellers today are keen to learn about the origins of their meals and to take a piece of the destination home with them, whether it's crispy seaweed or pizza dry yeast recommended by the chef at a restaurant. “Food content has become a dominant travel theme. Grocery stores are now Instagrammable destinations—authentic, experiential, and surprisingly affordable,\" said Keppurengan. Popular destinations for grocery tourism, as per Chughh Tokyo, Japan: Known for its well-organised supermarkets, bustling fish markets like Tsukiji (or Toyosu now), and specialty food items. Barcelona, Spain: Markets like La Boqueria offer a colourful experience of Spanish food culture, from fresh seafood to cured meats and artisan cheeses. Paris, France: Visiting small neighbourhood shops and larger stores like La Grande Epicerie offers a great experience of French food products, from pastries to gourmet chocolates. Mexico City, Mexico: The city's bustling mercados are filled with exotic fruits, spices, and indigenous foods. A visit to these markets offers insights into Mexican cuisine that go beyond the typical tourist spots.",
    "image": "https://images.indianexpress.com/2024/11/grocery_1600_getty_378306.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T14:00:09+05:30",
    "dateModified": "2024-12-02T14:00:09+05:30"
  },
  {
    "title": "‘I had a paralysed face for over a year’: Chhavi Hussein opens up about a Botox mishap",
    "link": "http://localhost:3000/fitness/i-had-a-paralysed-face-for-over-a-year-chhavi-hussein-opens-up-about-a-botox-mishap",
    "siteurl": "http://localhost:3000/fitness/i-had-a-paralysed-face-for-over-a-year-chhavi-hussein-opens-up-about-a-botox-mishap",
    "description": "\"Main thodi hili, aur unka haath thoda hila… and the Botox went in the wrong place,\" Chhavi Hussein added",
    "thumbnail": "https://images.indianexpress.com/2024/11/chhavi-3.jpg",
    "description1": "Chhavi Hussein recently shared her experience with botox, highlighting the risks that come with the procedure. In a conversation with venereologist Dr Agni Kumar Bose on her podcast, she revealed, “This was the first time I ever got a needle done to the face… I’m not scared of pain, I’m not scared of needles. My pain threshold, I believe, is very high. But it was something I was not anticipating.” She revealed that a slight movement during the procedure caused the botox to be injected in the wrong spot. “Main thodi hili, aur unka haath thoda hila (So I moved a little, and their hand moved a little)… and the Botox went in the wrong place. And I had a paralysed face for over a year. As an actor, it was a very, very tough phase for me,” she said. &nbsp; View this post on Instagram &nbsp; A post shared by Chhavi Mittal (@chhavihussein) Botox, often seen as a quick fix for wrinkles and fine lines, is generally considered safe when performed by trained professionals. However, as Mittal’s experience shows, even small mistakes can have lasting consequences.  Dr Gunasekar Vuppalapati, senior aesthetic, reconstructive, plastic surgeon at GVG Invivo Hospital, tells indianexpress.com, “Botox (botulinum toxin type A) is a neurotoxin that temporarily blocks nerve signals to the muscles where it is injected. By inhibiting the release of acetylcholine, it prevents muscle contractions, reducing the appearance of wrinkles and fine lines. Botox is also used therapeutically for conditions like migraines, hyperhidrosis, and muscle spasms.” Why movement during injection can cause issues, according to the plastic surgeon Misplacement of Botox: Movement during the procedure can cause the needle to target the wrong muscle or allow the Botox to spread to unintended areas. For instance, if Botox, meant for the forehead muscles, migrates to the eyelid muscles, it can cause ptosis (droopy eyelid). Inaccurate Dosing: Slight move",
    "description2": "ments can lead to uneven distribution of the toxin, resulting in asymmetry or incomplete results. Increased Risk of Migration: Movement immediately after the procedure can displace the toxin, potentially affecting nearby muscles and causing complications like facial paralysis. But, what are the risks? Dr Vuppalapati lists the common side effects and risks of getting Botox: Bruising and Swelling: Minor bruising or swelling at the injection site is the most common side effect and usually resolves within a few days. Asymmetry: If Botox is not injected evenly or in the correct muscles, it can result in uneven facial expressions, such as a droopy eyelid or a lopsided smile. Facial Paralysis: In rare cases, Botox can spread to unintended muscles, causing temporary paralysis, as seen in Chhavi’s case. Headaches or Flu-like Symptoms: Some individuals experience mild headaches or flu-like symptoms after the procedure. Allergic Reactions: Though rare, Botox can cause itching, rashes, or other allergic reactions. Difficulty Swallowing or Speaking: When Botox migrates near the throat or vocal cords, it can temporarily interfere with these functions. How to avoid these risks Dr Vuppalapati shares the following tips: Choose a Qualified Practitioner: Ensure the injector is a certified dermatologist or plastic surgeon with extensive experience in facial anatomy. Communicate Clearly: Discuss your medical history, allergies, and expectations with your practitioner. Stay Still During the Procedure: Movement during injection can lead to misplacement of the Botox. Follow Aftercare Instructions: To prevent Botox migration, avoid rubbing the treated area, lying down for several hours, or engaging in strenuous activities immediately after the procedure. DISCLAIMER: This article is based on information from the public domain and/or the experts we spoke to. Always consult your health practitioner before starting any routine.",
    "image": "https://images.indianexpress.com/2024/11/chhavi-3.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T08:00:21+05:30",
    "dateModified": "2024-12-02T08:00:21+05:30"
  },
  {
    "title": "Here’s what happens to the body when you commit to no sweets, 10K steps daily, and home cooked meals for 30 days",
    "link": "http://localhost:3000/fitness/here-s-what-happens-to-the-body-when-you-commit-to-no-sweets-10k-steps-daily-and-home-cooked-meals-for-30-days",
    "siteurl": "http://localhost:3000/fitness/here-s-what-happens-to-the-body-when-you-commit-to-no-sweets-10k-steps-daily-and-home-cooked-meals-for-30-days",
    "description": "Lack of essential nutrients in daily meals can lead to nutrient deficiency, which can negatively affect overall health.",
    "thumbnail": "https://images.indianexpress.com/2024/11/healthy-habits_1600_getty.jpg",
    "description1": "Under our What Happens to Your Body series, we have covered many stories highlighting the pros and cons of various everyday things and how they affect well-being. Continuing with the same, today—ahead of the New Year 2025—we find out what happens to the body if you commit to no sweets, 10,000 steps daily, and home-cooked meals for the next 30 days. Committing to no sweets, 10k steps, and eating home-cooked meals for 30 days can lead to significant physical changes, experts suggest. \"This can be a part of healthy habits that can be rewarding and lead to a range of health benefits,\" said Dr Manjusha Agarwal, senior consultant, internal medicine, Gleneagles Hospital Parel Mumbai. What are the changes you can notice? If you want to lose weight, cutting out your sugar intake can be beneficial. However, in the first few days, you might start craving sugar, which can make you fussy, cranky, and moody. This can be referred to as sugar withdrawal, as your body needs some time to adjust and lower blood sugar levels. \"One may notice that their ene",
    "description2": "rgy levels may become stable and consistent as one progresses in this journey,\" said Dr Agarwal. Cutting out sugar, and being regular with physical activities like walking and eating home-cooked food can lead to weight loss and also improve digestion. \"However, one should ensure that their meals contain plenty of vegetables, fruits, legumes, and whole grains enriched with the goodness of essential nutrients like vitamins, fibre, omega-3 fatty acids, protein, and carbohydrates,\" said Dr Agarwal. Lack of essential nutrients in daily meals can lead to nutrient deficiency, which can negatively affect overall health. \"One should consider consulting a doctor before beginning with this new regime, especially those with health conditions like diabetes, high blood pressure, or blood sugar levels. Your doctor may assess your condition and suggest accordingly,\" said Dr Agarwal. DISCLAIMER: This article is based on information from the public domain and/or the experts we spoke to. Always consult your health practitioner before starting any routine.",
    "image": "https://images.indianexpress.com/2024/11/healthy-habits_1600_getty.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T06:00:23+05:30",
    "dateModified": "2024-12-02T06:00:23+05:30"
  },
  {
    "title": "Did you know? Masaba Gupta loves homemade chyawanprash — here’s how to make it at home",
    "link": "http://localhost:3000/fitness/did-you-know-masaba-gupta-loves-homemade-chyawanprash-here-s-how-to-make-it-at-home",
    "siteurl": "http://localhost:3000/fitness/did-you-know-masaba-gupta-loves-homemade-chyawanprash-here-s-how-to-make-it-at-home",
    "description": "Chyawanprash’s formulation is derived from classical Ayurvedic texts such as the Charaka Samhita, Bhavaprakasha, and Rasa Ratna Samuchaya.",
    "thumbnail": "https://images.indianexpress.com/2024/11/masaba-gupta_600_insta-1_20240724060957_20241113060322_20241129111831.jpg",
    "description1": "Chyawanprash isn’t just an ancient tonic - it's an all-in-one immune and energy booster for the cold months. With its powerful blend of meticulously chosen herbs, it nourishes not just our body but also our mind and spirit. Health and wellness coach Isha Lall shared that the name \"Chyawanprash\" or “Chyavanprash” traces back to Sage Chyavan, a revered ancient sage who is believed to have regained his eyesight, youth, and vitality with this very tonic. \"According to Ayurvedic texts, particularly the Bhavaprakasha and Charaka Samhita, Chyavan had become old and frail but was rejuvenated after taking a mixture of medicinal herbs guided by Ashvins. This formula, later known as Chyawanprash or Chyavanprash, is believed to restore strength, enhance longevity, and increase immunity,\" she said. Fashion designer Masaba Gupta took to her Instagram story to thank her friend for sharing homemade chyawanprash. But how can you make this winter staple at home? Indianexpress.com got an easy recipe from celebrity chef Ananya Banerjee. Ingredients: Amla (Indian Gooseberry) – 500g (fresh or dried) Jaggery or honey – 300g (natural sweetener) Ghee – 100g Sesame oil – 1 tablespoon Spices: Cardamom powder – 1 teaspoon Cinnamon powder – 1 teaspoon Clove powder – ½ teaspoon Nutmeg powder – ½ teaspoon Herbs (optional but beneficial): Ashwagandha powder – 1 teaspoon Shatavari powder – 1 teaspoon Guduchi powder – 1 teaspoon Dried fruits (optional): Raisins, dates, or figs – 50g (chopped) Honey – Optional for extra sweetness (add only when the mixture cools to prevent losing nutrie",
    "description2": "nts) Method: If using fresh amla, steam or boil them until soft. Remove seeds and mash into a pulp. If using dried amla, soak them overnight and blend into a paste. Heat a heavy-bottomed pan with ghee and sesame oil. Add the amla pulp and sauté for 10–15 minutes until the mixture reduces and thickens. Gradually add jaggery or honey and cook on low heat until it melts and blends well with the amla mixture. Add the powdered spices and herbs, mixing thoroughly. If using dried fruits, stir them in at this stage. Continue to cook on low heat until the mixture thickens further and begins to leave the sides of the pan. Stir constantly to avoid burning. Let the Chyawanprash cool completely before transferring it into an airtight jar. Store in a cool, dry place. It stays fresh for months if refrigerated. What are its health benefits? Lall said that chyawanprash’s formulation is derived from classical Ayurvedic texts such as the Charaka Samhita, Bhavaprakasha, and Rasa Ratna Samuchaya. \"The ingredients, such as amla (for immunity) and ashwagandha (for stress management), and ghee and spices (to enhance digestive fire/agni and promote better nutrient absorption) are precisely chosen for their rejuvenating and balancing properties,\" she explained. What is the ideal amount to have in a day? Lall said that chyawanprash is best taken daily in moderate amounts. For adults, 1 tablespoon (15-20g) in the morning and for children, 1 teaspoon (5-10g) once or twice a day should suffice. If you have excess kapha, she suggested reducing the dosage or diluting with warm water.",
    "image": "https://images.indianexpress.com/2024/11/masaba-gupta_600_insta-1_20240724060957_20241113060322_20241129111831.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T20:00:41+05:30",
    "dateModified": "2024-12-01T20:00:41+05:30"
  },
  {
    "title": "Can washing hands too frequently be unhealthy?",
    "link": "http://localhost:3000/fitness/can-washing-hands-too-frequently-be-unhealthy",
    "siteurl": "http://localhost:3000/fitness/can-washing-hands-too-frequently-be-unhealthy",
    "description": "Excessive handwashing can potentially lead to skin problems",
    "thumbnail": "https://images.indianexpress.com/2024/08/1_ed493e.jpg",
    "description1": "Maintaining a good hygiene is important for your health. It is especially important to make a habit of washing your hands frequently,  but overindulgence in this habit could prove to be very unhealthy for your skin! Dr S M Fayaz, Consultant - Internal Medicine at Aster Whitefield Hospital, Bangalore tells indianexpress.com how it is necessary to maintain your hygiene habits as well as take care of your skin. Excessive handwashing is often linked to psychological disorders, such as obsessive-compulsive disorder (OCD), where the urge to wash hands over and over again comes from repetitive rituals that are meant to ease worries about germs or contamination. Moreover, people with general health anxiety might also wash their hands excessively to get rid of fears of illness, finding temporary relief in the act. How can excessive handwashing affect your skin? \"Frequent handwashing or even excessive usage of hand sanitizers can lead to skin irritation and other problems. It can strip the skin of its natural oils, causing dryness, redness, and irritation.\" said Dr Fayaz. It can remove the skin's natural oils, leading to dryness, redness, and irritation. Rashes from hand washing",
    "description2": " usually appear on the backs of the hands and between the fingers, making the skin more prone to conditions like eczema or dermatitis, which cause inflammation, itching, and cracking. How often is it recommended to wash your hands daily? \"For most people, washing hands 5 to 10 times a day is sufficient in order to maintain hygiene and be protected from germs and bacteria.\" said Dr Fayaz. The necessary times for hand washing are before and after meals, after using the restroom, and following coughing, sneezing, or blowing your nose. It’s also important to wash them after touching shared surfaces or objects, such as public transportation or doorknobs, and whenever your hands are visibly dirty. However, if handwashing is causing skin problems, it may be beneficial to review handwashing practices and keep your hands moisturized. For this, you can apply a rich hand cream or lotion containing ingredients like glycerin, shea butter, or ceramides. You can also go for hand lotions with hydrating ingredients such as hyaluronic acid. Additionally, wash your hands with lukewarm water rather than hot water, and gently pat them dry with a soft towel instead of rubbing them together.",
    "image": "https://images.indianexpress.com/2024/08/1_ed493e.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T20:30:34+05:30",
    "dateModified": "2024-12-01T20:30:34+05:30"
  },
  {
    "title": "‘You are constantly comparing yourself with someone…’: Ananya Panday on how social media fuels comparison and wrecks self esteem",
    "link": "http://localhost:3000/fitness/you-are-constantly-comparing-yourself-with-someone-ananya-panday-on-how-social-media-fuels-comparison-and-wrecks-self-esteem",
    "siteurl": "http://localhost:3000/fitness/you-are-constantly-comparing-yourself-with-someone-ananya-panday-on-how-social-media-fuels-comparison-and-wrecks-self-esteem",
    "description": "Social media can inspire some people, but it’s important to recognise when it starts having a negative impact.",
    "thumbnail": "https://images.indianexpress.com/2024/11/ananya-panday-rohit-bal_20241127080958.jpg",
    "description1": "Ananya Panday has been in the spotlight this year owing to back-to-back performances. From Call Me Bae to CTRL, her acting has been garnering praises from critics and masses alike. In a recent conversation with Mojo Story, she shared her experience with body image issues and how social media played an active role in it. \"Instagram does that to you. Nobody posts their failures on Instagram. You are constantly comparing yourself with someone who you think has a better life or is constantly travelling or looking happy. I also obviously had that.\" She also added that self love is something that doesn’t happen overnight. \"I have days when I don’t feel confident and beautiful. But, you have to just go through that phase. You need to go with it and not be hard on yourself. As an actor, the most I can do is talk and let people know that I too have such days,\" revealed the Kho Gaye Hum Kahan actor. Indianexpress.com spoke to counselling psychologist Srishti Vatsa and understood how social media fuels comparison and what can you do to navigate such situations. \"Comparison, in general, can lead to feelings of unhappiness and dissatisfaction. It’s important to understand the difference between healthy competition and unhealthy comparison. The constant showcasing of lives on social media is often driven by a need for validation. Social media makes it easy to see what others are doing, which can lead to constant comparisons - especially in relationships,\" explained Vatsa. According to her, what people show online is often far from reality, but many end up feeling inadeq",
    "description2": "uate in their own lives or relationships while chasing the \"perfect\" images they see. This can lead to frustration, sadness, or resentment. Piyali Maity, Clinical Director, Counselling Operations, 1to1help, added that social media fuels comparison in several ways especially with “selective sharing”. \"The reel v/s reality is the most common, where people share only the best portions of their lives which are far from day-to-day reality. The widespread use of filters and editing tools further increases the gap between reality and what is portrayed, making others’ lives appear more glamorous or perfect.\" She added that the validation that one gets from increased followers, likes and comments on the posts unconsciously leads to comparing one's popularity or success with others. \"What makes it worse is the constant exposure to updates and fulfilling experiences of others which can trigger one to compare oneself and feel like they are missing out on something better in life,\" she said. Social media can inspire some people, but it’s important to recognize when it starts having a negative impact. If you find yourself constantly comparing, overspending to match trends, or feeling unhappy with your own life, it’s time to take a step back and reflect. To avoid these pitfalls, Vatsa suggested setting limits on your social media usage and focus on spending time with people in real life. Mindless scrolling, especially when it’s used to escape from reality, can be harmful. It creates a cycle of seeking quick dopamine hits, which can hurt productivity and mental well-being.",
    "image": "https://images.indianexpress.com/2024/11/ananya-panday-rohit-bal_20241127080958.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T18:00:22+05:30",
    "dateModified": "2024-12-01T18:00:22+05:30"
  },
  {
    "title": "The fine line between healthy breaks and excessive zoning out",
    "link": "http://localhost:3000/fitness/the-fine-line-between-healthy-breaks-and-excessive-zoning-out",
    "siteurl": "http://localhost:3000/fitness/the-fine-line-between-healthy-breaks-and-excessive-zoning-out",
    "description": "In today’s fast-paced, digitally saturated world, zoning out has become increasingly common. ",
    "thumbnail": "https://images.indianexpress.com/2024/07/sleep.jpg",
    "description1": "Is excessive zoning out a bad sign? Mehezabin Dordi, clinical psychologist at Sir HN Reliance Foundation Hospital, notes that while zoning out occasionally is not serious, it can evolve into a problem when it starts to significantly impact daily life, productivity, and relationships. \"If you do find yourself frequently disengaged during important tasks or conversations, it might indicate some underlying issues such as attention deficit disorders, anxiety, or depression.\" But zoning out isn’t all bad. In fact, it can serve as a mental break from the constant focus your brain endures. Your brain needs time to recharge, and when napping isn’t an option, zoning out can be helpful, Dordi explains. It could also boost creativity and improve problem-solving skills. Taking moments to zone out can aid in \"processing your emotions\" or allow for brief, reflective thinking. When does it become serious? \"If someone finds themselves frequently disengaged during important tasks or conversations, it might indicate underlying issues such as attention deficit disorders, anxiety, or depression,\" says Mehezabin. While social media has popularised the term ‘dissociation,’ it is important to note that it is distinct from zoning ",
    "description2": "out. Dissociation refers to a more severe form of mental disconnection, often linked to trauma or extreme stress. This deeper detachment can make individuals feel disconnected from their thoughts, feelings, or surroundings, to an extent that it impairs their functioning. How to recognise if it’s a problem If you find yourself zoning out more often than you'd like but aren't sure whether it’s serious, consider incorporating these practices: Practice Mindfulness Engage in meditation or deep breathing exercises to heighten awareness and control over your thoughts, which can help reduce the tendency to zone out. Structure Your Breaks Taking regular, intentional breaks during work or study sessions can help combat mental fatigue and reduce the urge for the mind to wander. Prioritise Tasks Creating a clear to-do list with organised tasks and goals can help maintain focus and minimize the chances of zoning out. Seek Professional Help If zoning out is having a significant impact on your daily life, consulting with a mental health professional can be beneficial. Striking the right balance between productive mind-wandering and problematic zoning out is essential for maintaining cognitive health and overall well-being.",
    "image": "https://images.indianexpress.com/2024/07/sleep.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T17:00:00+05:30",
    "dateModified": "2024-12-01T17:00:00+05:30"
  },
  {
    "title": "Meet Indian designer behind Vir Das’s lungi-inspired Emmy look, which fused an ‘undivided India’ with ‘modern English tailoring’",
    "link": "http://localhost:3000/fitness/meet-indian-designer-behind-vir-das-s-lungi-inspired-emmy-look-which-fused-an-undivided-india-with-modern-english-tailoring",
    "siteurl": "http://localhost:3000/fitness/meet-indian-designer-behind-vir-das-s-lungi-inspired-emmy-look-which-fused-an-undivided-india-with-modern-english-tailoring",
    "description": "Vir Das had extended an invitation on social media inviting young designers across India to create the perfect ensemble for his Emmy outing.",
    "thumbnail": "https://images.indianexpress.com/2024/12/collage.png",
    "description1": "By Mannat Saini Vir Das, a celebrated Indian comedian, actor, and singer, made history as the first Indian to host the International Emmy Awards 2024, in New York. As soon as Das was named the Emmy host, he had extended an invitation on social media inviting young designers across India to create the perfect ensemble for his Emmy outing. &nbsp; View this post on Instagram &nbsp; A post shared by Vir Das (@virdas) After receiving an overwhelming response, Das chose the Delhi-based label Salooka by fashion designer Shubhangi Bajpai. The name of her label comes from stories of undivided Hindustan she grew up hearing, while the word itself is the name for the post-colonial vests worn by men in the northern belt of India. Creating Vir Das's Emmy look Bajpai recalled the initial phase of her creation process for the standup comic's outfit with excitement, \"It honestly started when one of my friends shared his post, claiming he is inviting designers to make his Emmy's outfit. Now, this is something that Vir has done before but for something like the Emmy's? Unbelievable.\" The NIFT Delhi (National Institute of Fashion Technology) graduate perfectly emulated the Call Me Bae actor's brief by borrowing elements from the undivided India, with hints of English tailoring. According to Vir's post on Instagram, Bajpai was selected from a vast list of 4000 applicants. Explaining the ensemble, Bajpai expressed how the attire was woven together from across India, \"the fabric for the shirt came from Hyderabad, while the chikankari embroidered on it was done in Lucknow. The suit fabric came in from Bombay while the lining was sourced from Gujarat. The process sp",
    "description2": "anned four states, with countless hands contributing to its creation.\" When asked about the challenges of creating such an ensemble in just a week, the designer recalled how she thought Das may have selected someone else for the role. \"When I was sketching the design, it was a very relaxed atmosphere, there was music playing in the background. It was already November and I knew the Emmy Awards were on the 25th of November. Naturally, I thought I had not been shortlisted. So when I heard from the team, I thought, 'How am I going to do this?' Because the silhouette was experimental, the sourcing was tricky and there was embroidery also. I was really anxious but so excited. It made me feel alive,\" Bajpai revealed. &nbsp; View this post on Instagram &nbsp; A post shared by Salooka (@salookalife) For the final outfit, Bajpai suggested a sophisticated look: a crisp single-button tailored jacket and a pleated lungi-inspired pair of pants (made in fine wool suiting), along with a new take on the cummerbund, which included a button closure. In the contemporary era, \"the modern man is on the go. So I wanted to create something that was not as tedious as tying a traditional lungi and that is how the cummerband was made. It was for the ease of putting on the outfit, with one button.\" she added. Describing the process, Bajpai told indianexpress.com, \"I think it was destined to happen this way, all over India, like Vir wanted. From the chikankari done in Lucknow to the fabrics from Hyderabad, Delhi, Gujarat, and Jaipur. I truly believe that Vir did carry a little bit of India to the Emmy's; he truly manifested it.\" Mannat is an intern at indianexpress.com",
    "image": "https://images.indianexpress.com/2024/12/collage.png",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T13:57:42+05:30",
    "dateModified": "2024-12-01T13:57:42+05:30"
  },
  {
    "title": "Why do we add hing and jeera to tadka? Health experts share their two cents",
    "link": "http://localhost:3000/fitness/why-do-we-add-hing-and-jeera-to-tadka-health-experts-share-their-two-cents",
    "siteurl": "http://localhost:3000/fitness/why-do-we-add-hing-and-jeera-to-tadka-health-experts-share-their-two-cents",
    "description": "According to the traditional holistic medicine system of Ayurveda, the benefits of Jeera (cumin) and Hing (asafoetida) are myriad and essential to one's wellbeing. ",
    "thumbnail": "https://images.indianexpress.com/2024/07/tadka-1.jpg",
    "description1": "Tadka with hing and jeera is one of those special touches that elevate even the simplest of Indian dishes. Popular for adding a burst of tang and flavour to our regular old dal, tadka- or the practice of tempering dates back centuries, with our mothers and grandmothers figuring out this master stroke of bringing out some extra taste along with some added nutrition. But what exactly makes hing and jeera the popular choices for tempering? Indianexpress.com spoke to health experts and found out. What does Ayurveda say? According to the traditional holistic medicine system of Ayurveda, the benefits of Jeera (cumin) and Hing (asafoetida) are myriad and essential to one's well-being. \"The word jeera itself comes from jeernam which means digestion, and jeera is thus used heavily for promoting gut health. Hing, which came to India from its native Afghanistan, is even more renowned for its action in promoting gut health,\" said Dr Biju KS, Senior Medical Officer, Vieroots. He shared that both spices are renowned for their anti-diabetic, weight loss, calming, anti-worm and microbiome-enhancing effects. \"Cooking them in ghee brings out their best effects and taste, as ghee is the perfect carrier in Ayurveda,\" he said. And what does science sa",
    "description2": "y? According to G Sushma, Clinical Dietician, CARE Hospitals, Banjara Hills, Hyderabad, both the spices are well versed for their flavour enhancement properties when added as tadka. \"While hing is often used to mimic the taste of garlic and onions, making it a valuable spice in vegetarian dishes or for those who avoid these ingredients, jeera adds a warm, earthy flavor with a hint of bitterness,\" she said. Sushma said that hing is known for its ability to reduce bloating, gas, and other digestive issues. It helps stimulate the production of digestive enzymes and reduces inflammation in the body. \"Hing is used in traditional medicine to relieve respiratory conditions like asthma and bronchitis. Some studies suggest that cumin may help in controlling blood sugar levels, making it beneficial for people with diabetes,\" she said. According to her, jeera stimulates the secretion of digestive enzymes, which helps in better digestion and absorption of nutrients. It also helps in relieving bloating and gas. \"Cumin seeds are packed with antioxidants, which help fight free radicals in the body and reduce oxidative stress. These seeds also contain iron and other nutrients that are essential for maintaining a healthy immune system,\" she added.",
    "image": "https://images.indianexpress.com/2024/07/tadka-1.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T22:00:05+05:30",
    "dateModified": "2024-12-01T22:00:05+05:30"
  },
  {
    "title": "Kaley Cuoco opens up about rehoming her aggressive dog: Expert weighs in on dealing with dog aggression",
    "link": "http://localhost:3000/fitness/kaley-cuoco-opens-up-about-rehoming-her-aggressive-dog-expert-weighs-in-on-dealing-with-dog-aggression",
    "siteurl": "http://localhost:3000/fitness/kaley-cuoco-opens-up-about-rehoming-her-aggressive-dog-expert-weighs-in-on-dealing-with-dog-aggression",
    "description": "If aggression persists despite behaviour modification efforts, consulting a certified animal behaviourist can help uncover triggers and develop tailored training plans for the dog(s).",
    "thumbnail": "https://images.indianexpress.com/2024/11/kaley.png",
    "description1": "Dogs don’t always warm up to new furry companions. This reality became all too familiar to actor Kaley Cuoco, who recently opened up about having to rehome her beloved dog, Shirley, due to aggression issues with Blue, her fiancé Tom Pelphrey's dog. &nbsp; View this post on Instagram &nbsp; A post shared by Kaley Cuoco (@kaleycuoco) &nbsp; In an emotional homage to Shirley, Cuoco shared the \"difficult decision\" she had to make for the well-being of both pets. Talking about Shirley in an Instagram reel, Cuoco said the dog was eventually placed in a loving home where she thrived until she passed away at the age of 14 due to aggressive bone cancer. Reminiscing their bond, Cuoco described Shirley as a very “special” dog. Cuoco's experience sheds light on the complexity of canine aggression and the tough choices it may necessitate. To better understand this issue and explore solutions, we spoke with J S Rama Krishna, business head at Carniwel. Understanding aggression in dogs Krishna told indianexpress.com that aggression is often a dog’s way of expressing unmet emotional needs, unless it stems from a medical issue requiring veterinary intervention. “The more important question for me is, ‘What is my dog communicating, and how can I help?’ My first instinct is to ensure I’m not brushing aside an issue that my dog needs me to pay attention to,\" he said.Dogs, unlike humans, may prefer a more solitary lifestyle and might guard their space against perceived intruders, like mailmen, gardeners, and in some cases, other dogs. \"Dogs can be more selective towards their canine companions, and may not be eager to meet a canine crowd,\" he said. However, according to Krishna, dogs can be trained to coexist peacefully. “Socialising d",
    "description2": "ogs requires a structured and compassionate approach,” Krishna said, stressing the importance of proper introductions, especially in multi-dog households. He advised against punitive training methods. \"Maintaining and enforcing clear rules, with kindness, in your training regime will help. Some of these rules may look like no jumping, no begging, etc. Stay confident in your communication with the dogs, but also make sure that each canine gets separate time for attention from you. Also ensure that each dog in the household has access to resources like food, water, and toys,\" Krishna said. He also said, \"Introduce your dog to guests slowly in a controlled environment. Positive reinforcement, such as rewarding calm behavior with high-value treats, can help the dog associate guests with positive experiences. Keep treats at the door and let visitors offer them, helping to build trust.\" If aggression persists, consulting a certified animal behaviourist can help uncover triggers and develop tailored training plans. A dog's aggression, whether it is towards humans or other canines, can be rooted in a variety of causes. But the good news is that with the right training and socialisation, the behaviour can be improved. When rehoming becomes necessary Rehoming should be the last resort, implemented only after all other interventions fail. “In rare cases where a dog’s aggression remains uncontrollable despite consistent training and behaviour modification efforts, rehoming to a suitable environment where their needs and limitations can be managed responsibly may be the best solution,” he said. It’s essential to make such decisions under expert guidance to ensure the safety and well-being of both the dog and those around them.",
    "image": "https://images.indianexpress.com/2024/11/kaley.png",
    "image1": "",
    "date": "30/11/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-30T22:30:50+05:30",
    "dateModified": "2024-11-30T22:30:50+05:30"
  },
  {
    "title": "Brain stimulation effectiveness tied to learning ability, not age: Study",
    "link": "http://localhost:3000/fitness/brain-stimulation-effectiveness-tied-to-learning-ability-not-age-study",
    "siteurl": "http://localhost:3000/fitness/brain-stimulation-effectiveness-tied-to-learning-ability-not-age-study",
    "description": "Brain stimulation effectiveness tied to learning ability, not age: Study",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241127113434.jpg",
    "description1": "\n\n\nLausanne [Switzerland], November 27 (ANI): As we age, our cognitive and motor functions degrade, reducing our independence and overall quality of life. Research efforts to mitigate or perhaps eliminate this have resulted in technologies that hold a lot of promise.\nNow, scientists led by Friedhelm Hummel at EPFL have identified an important factor affecting an individual's responsiveness to atDCS. The team looked at how native learning abilities determine the effect of brain stimulation applied while learning a motor task. Their findings suggest that individuals with less efficient learning mechanisms benefit more from stimulation, while those with optimal learning strategies might experience negative effects.\n\nAmong these is non-invasive brain stimulation: a term encompassing a set of techniques that can affect brain functions externally and noninvasively, without the need for surgery or implants. One such promising technique, in particular, is anodal transcranial direct current stimulation (atDCS), which uses a constant, low electrical current delivered via electrodes on the scalp to modulate neuronal activity.\nHowever, studies exploring atDCS have produced inconsistent results, which has prompted researchers to explore why some people benefit from atDCS while others don't. The problem seems to lie in our understanding of factors that may influence responsiveness to brain stimulation, leading to responders and non-responders; among these, age has been suggested as one important factor.\nSome studies suggest further factors such as baseline behavioural abilities and previous training might be important considerations, but an interplay of these factors with behaviour has not been determined in detail, pointing to the need of refined predictive models of the effects of atDCS.\nThe researchers recruited 40 participants: 20 middle-aged adults (50-65 years old) and 20 older adults (over 65). Each group was further divided into those receiving active atDCS and those receiving placebo stimulation.\n\n\nOver ten days, participants practised a finger-tapping task designed to study motor sequence learning at home while receiving atDCS. The task involved replicating a numerical sequence using a keypad, trying to",
    "description2": " be as fast and as accurate as possible.\nThe team then used a machine-learning model trained on a public dataset to classify participants as either \"optimal\" or \"suboptimal\" learners, based on their initial performance. This model aimed to predict who would benefit from atDCS, based on their ability to integrate information about the task efficiently early during training\nThe study found that suboptimal learners, who were seemingly less efficient at internalizing the task at the early stages of learning, experienced an accelerated accuracy improvement while performing the task when receiving atDCS. This effect was not limited to people of a certain age (e.g., older adults), with suboptimal learners being found among younger individuals as well.\nIn contrast, participants with optimal learning strategies, regardless of age, even showed a negative trend in performance when receiving atDCS. This difference suggests that brain stimulation is more beneficial for individuals who initially struggle with motor tasks. As such, atDCS seems to possess a restorative rather than an enhancing quality, with important implications for rehabilitation.\n\"By leveraging different methods in Machine learning, we were able to untangle the influence of different factors on the individual effects of brain stimulation,\" said Pablo Maceira, the study's first author. \"This will pave the way to maximize the effects of brain stimulation in individual subjects and patients.\"\nThe study implies that, in the long run, personalized brain stimulation protocols will be developed to maximize benefits based on an individual's specific needs, rather than a common trait such as age. This approach could lead to more effective brain stimulation-based interventions, targeting specific mechanisms supporting learning, especially in the view of neurorehabilitation, for which the main basis is the re-learning of lost skills due to a brain lesion (e.g., after a stroke or a traumatic brain injury).\n\"In the future, clinicians could apply a more advanced version of our algorithm to determine whether a patient will benefit from a brain stimulation-based therapy, to enhance the effects of neurorehabilitation and personalize treatment,\" said Hummel.(ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241127113434.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "Graeme Smith credits SA20 for South Africa's recent cricketing success",
    "link": "http://localhost:3000/fitness/graeme-smith-credits-sa20-for-south-africa-s-recent-cricketing-success",
    "siteurl": "http://localhost:3000/fitness/graeme-smith-credits-sa20-for-south-africa-s-recent-cricketing-success",
    "description": "Graeme Smith credits SA20 for South Africa's recent cricketing success",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202081530.jpg",
    "description1": "\n\n\nJohannesburg [South Africa], December 2 (ANI): Graeme Smith, the League Commissioner of SA20, firmly believes that the tournament has played a crucial role in the recent success of South Africa's cricket teams. Reflecting on the national team's achievements, Smith highlighted the positive impact of the SA20 on both the men's and women's teams.\n\"I definitely, I mean, I've been saying that from the start. You know, I think our domestic cricket had kind of levelled off in South Africa. We now have a tournament that puts 70 South Africans up against the best international talent. They're working with franchises that bring real expertise back into the game. They're playing in front of big crowds, which brings pressure. The TV production is of international standards,\" Smith explained as per a release by SA20.\n\nThe SA20 league has provided a platform for South African players to compete at a high level, exposing them to the pressures and standards of international cricket. Smith noted, \"All this, you know, is putting a group of players that were never exposed to at a leve",
    "description2": "l where hopefully we start to see more and more talent competing like the IPL has done, competing to play for South Africa.\"\n\n\nSmith also praised the overall performance of South African cricket, particularly in the white-ball format.\n\"South African cricket in general, particularly in the white ball stuff, has had a really successful, women and men period. If it wasn't for India, we would have had our first trophy,\" he remarked at SA20 India Day, acknowledging the tough competition from the Indian teams.\nLooking ahead, Smith emphasized the importance of SA20 in strengthening South African cricket and maintaining its competitive edge on the global stage.\n\"For us, we want to be a real catalyst for the strength of South African cricket that keeps it strong and competing with the likes of India, Australia, and England,\" he concluded, as quoted by a release from SA20.\nSmith's insights underscore the significant role of the SA20 league in fostering talent and elevating the standards of South African cricket, aiming to build a robust future for the sport in the country. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202081530.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "Lahore's air quality hits 303, ranked world's most polluted city",
    "link": "http://localhost:3000/fitness/lahore-s-air-quality-hits-303-ranked-world-s-most-polluted-city",
    "siteurl": "http://localhost:3000/fitness/lahore-s-air-quality-hits-303-ranked-world-s-most-polluted-city",
    "description": "Lahore's air quality hits 303, ranked world's most polluted city",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202072728.jpg",
    "description1": "\n\n\nLahore [Pakistan], December 2 (ANI): Lahore has retained its position as the world's most polluted city, with hazardous air quality readings posing a significant threat to public health. According to recent data, the city's air quality reading stands at 303 points, indicating extremely poor air quality, ARY News reported.\nThe air quality in other major cities in Pakistan is also a cause for concern. Multan's air quality reading is 268 points, while Peshawar and Karachi have readings of 230 and 215 points, respectively. These readings indicate hazardous air quality, which can have serious health implications for residents.\n\nThe onset of winter has led to a significant increase in air pollutant levels in Punjab, with the province struggling to contain severe air pollution. The levels of pollutants in the air have reached alarming levels, exceeding the limits deemed safe by the World Health Organization, as per ARY News.\n\n\nLahore, the provincial capital, has been particularly affected, with a thick smog enveloping ",
    "description2": "the city for days. The pollution is caused by a combination of factors, including vehicle emissions, smoke from burning crops, and cold weather, making it difficult for people to breathe.\nNotably, health experts have raised alarms over the long-term effects of such unprecedented pollution levels, particularly on vulnerable populations. Before this crisis, air pollution was responsible for 12 per cent of deaths in children under five in Pakistan, The Express Tribune reported\nWith the current smog emergency, these numbers are likely to rise sharply.\nChildren, pregnant women, and individuals with pre-existing health conditions are expected to bear the brunt of the health consequences, which could have devastating impacts in the coming years if corrective measures are not urgently implemented.\nThe government has taken measures to mitigate its impact. Schools have been closed, and the timing of eateries, businesses, and markets has been restricted to minimise the exposure of the general public to toxic pollution. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202072728.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "A Giant Leap for Pet Care in Jaipur- DCC Animal Hospital Launches Advanced Facility in the Pink City",
    "link": "http://localhost:3000/fitness/a-giant-leap-for-pet-care-in-jaipur-dcc-animal-hospital-launches-advanced-facility-in-the-pink-city",
    "siteurl": "http://localhost:3000/fitness/a-giant-leap-for-pet-care-in-jaipur-dcc-animal-hospital-launches-advanced-facility-in-the-pink-city",
    "description": "A Giant Leap for Pet Care in Jaipur- DCC Animal Hospital Launches Advanced Facility in the Pink City",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202070627.jpg",
    "description1": "\n\n\nPNN\nJaipur (Rajasthan) [India], December 2: DCC Animal Hospital, a globally renowned chain of veterinary facilities, has launched its first cutting-edge veterinary hospital in Jaipur on December 1. Adhering to global Japanese standards, this state-of-the-art facility marks a transformative step in pet care for the Pink City. Strategically located in the basement of the IDB Building, FS-6, Gayatri Nagar, Maharani Farm, Durgapura, the hospital is equipped with the latest advancements in pet healthcare technology. Through this launch, DCC is ushering Jaipur into a new era of premium and advanced veterinary services.\n\nDCC Animal Hospital is a leading global veterinary chain dedicated to enhancing pet healthcare through preventative care, advanced surgical services, and knowledge-driven pet parenting. Committed to making good health accessible to all animals, DCC Animal Hospital goes beyond traditional veterinary care, embracing wellness and lifestyle solutions for a better future.\nChampioning a shift from a problem-solving mindset, DCC Animal Hospital focuses on in-depth diagnosis and professional medical care for pets, mirroring the quality of care humans receive. More than just a pet-friendly chain, DCC Animal Hospital provides a holistic ecosystem for pets, empowering pet parents with education and resources to prioritize knowledge over fear.\nGuided by its transformative vision of \"pet to partner,\" DCC Animal Hospital strives to redefine pet care, raising awareness and fostering compassion for animal well-being in India and beyond.\n\n\nDr. Vinod Sharma, Head Veterinarian, DCC Animal Hospital & Director, highlighted the strategic decision to expand into Jaipur, noting tha",
    "description2": "t while the city has a growing population of pet owners, there is a significant lack of high-quality facilities and educational resources. \"Jaipur has a massive untapped potential, where pet owners are eager for more options but are limited by the quality of services,\" he said. \"We've researched deeply into the market, and what we found was a need for better preventive care, hygiene, and knowledge on pet healthcare. DCC Animal Hospital is here to bridge that gap.\"\nThe DCC Animal Hospital aims to create a compassionate, pet-friendly ecosystem by offering services that include preventive care, vaccination education, surgical awareness, and high hygiene standards. Additionally, it will focus on educating pet owners about essential services and spreading awareness of pet healthcare and their requirements.\nDCC Animal Hospital brings world-class veterinary services to Jaipur and strives to connect with the community by way of workshops, awareness drives, and partnerships with local pet welfare organizations. DCC Animal Hospital hopes to create a more significant bond between pets, their owners, and veterinary experts.\nFor more information, kindly visit the website https://dccpets.in/\nAbout DCC Animal Hospital:\nDCC Animal Hospital, A'alda Group is a Japan-based, leading global veterinary chain of hospitals dedicated to providing high-quality and compassionate medical care to pets. With a team of experienced professionals and a commitment to excellence, the hospital strives to ensure the health and well-being of every animal in its care.\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by PNN. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202070627.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "HEJJE, India's First Luxury Transition Care Centre, opens in Bangalore",
    "link": "http://localhost:3000/fitness/hejje-india-s-first-luxury-transition-care-centre-opens-in-bangalore",
    "siteurl": "http://localhost:3000/fitness/hejje-india-s-first-luxury-transition-care-centre-opens-in-bangalore",
    "description": "HEJJE, India's First Luxury Transition Care Centre, opens in Bangalore",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202062957.jpg",
    "description1": "\n\n\nVMPL\nBangalore (Karnataka) [India], December 2: HEJJE, India's first luxury transition care centre, opened their doors today, ahead of the International Day of Persons with Disabilities with an aim of revolutionizing recovery and rehabilitation, thereby setting new standards in healthcare. Dr M.R.Seetharam - Vice Chairman of Ramaiah Group of Institutions, ex-Minister and current MLA did the honours of lighting the lamp to inaugurate HEJJE. The Launch of HEJJE saw the much-anticipated panel discussion featuring luminaries such as Dr. Nandini Mundkur, Prof. Shekar Sheshadri, Dr Saraswathy Viswanathan, Dr. Arjun Srivatsa, and B.S.Badrinath Rao. The guests were later taken on a guided tour of the facility and to experience the innovative facilities in person.\n\nHEJJE is an offshoot of the very prestigious M.S. Ramaiah Family Conglomerate. The Ramaiah Group of Institutions has been a leader in medical education, healthcare, and research for over 40 years. HEJJE, a vital part of this group, plays a significant role in fostering excellence. Ramaiah Memorial Hospital delivers world-class care to patients from over 30 countries, specializing in neurology, orthopaedics, urology, and more. Ramaiah Medical College trains future doctors through programs like MBBS and MD, supported by expert faculty and modern facilities. The Advanced Learning Centre (ALC) offers hands-on training in advanced surgical techniques. With cutting-edge research labs and global partnerships, the Ramaiah Group continues to drive healthcare innovation.\nCo-Founders - Sunder Ram and Dr Varun Devdass shared their vision for the centre, \"HEJJE is the first of its kind in the country, combining a transition care facility with luxury hospitality, an enabling garden, a multisensory environment, an integrative art and music therapy and virtual gaming rehab. This groundbreaking approach will provide a healing environment and effective interventions. It will be particularly beneficial for conditions such as autism, ADHD, cerebral palsy, deformity correction, paralysis, Parkinson's, Alzheimer's, stroke, traumatic brain injury, and spinal cord injury. This centre of excellence will put Bangalore on the global map as home to such a unique facility.\"\nHEJJE is created to fill the vital space between hospital care and home recovery, providing an easy transition for patients and families. HEJJE implements an evidence-based, protocol-driven approach with a multidisciplinary team of experts to facilitate care with a focus on optimizing recovery. Their services are specifically designed to ease the emotional stress and time that inevitably accompany the rehabilitation journey, to ensu",
    "description2": "re that families come home ready and happy.\nThe centre is mainly involved in paediatrics with developmental disabilities and deformity correction cases and will also provide services to adults and the elderly, caring for patients recovering from serious trauma, post-surgical procedures, neurological disorders, and geriatric issues. HEJJE, has 20 premium rooms for IP, along with OP and Daycare facilities.\nHEJJE's is situated in a residential estate at MSR North City, Hebbal that is very peaceful. State-of-the-art medical technologies - including an unweighing system developed to facilitate mobility training, robotic rehab equipment for motor recovery, Oculus virtual reality therapy to enhance cognitive outcomes, and robotic laser therapy for proactive pain management and tissue repair - are all integrated into the facility. HEJJE's leading-edge technologies also includes administrating Repetitive Transcranial Magnetic Stimulation (RTMS), a treatment known to be effective on neurological and psychological conditions such as depression and anxiety.\n\n\nHEJJE has a 10,000-square-foot enabling garden, a space designed to promote recovery through a stimulating sensory experience. The garden is the only such facility in India that is accessible to differently-abled people. It has sensory plants, an amphitheatre, and a coffee shop and is designed to be a calming and therapeutic space for patients and their families.\nIts multi-sensory rooms are designed specifically for children, providing children with a rich and diverse experience of senses, nurturing relaxation, and focused engagement. The centre's holistic approach aims at patients and families recovering in a nurturing, joyful environment that tends to both physical and mental health.\nHEJJE's mission is to become a global centre of excellence in transition care. Combining clinical excellence, comfort, and mental wellness, the centre aims to revolutionize the way recovery is approached -- and the standards for care across the industry.\nAbout HEJJE\nHEJJE is India's first luxury transition care centre delivering evidence-based, protocol-driven rehabilitation services. The Bangalore-based centre combines advanced technology, rare multidisciplinary expertise, and a focus on mental health to provide holistic care solutions for patients and their families. HEJJE strives to establish a global standard for transition care, allowing the healing process to take place in an enjoyable and nurturing atmosphere.\nFor more details visit - https://hejje.health/\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by VMPL. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202062957.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "Here is how cancer cells fend off starvation, death from chemotherapy, finds study",
    "link": "http://localhost:3000/fitness/here-is-how-cancer-cells-fend-off-starvation-death-from-chemotherapy-finds-study",
    "siteurl": "http://localhost:3000/fitness/here-is-how-cancer-cells-fend-off-starvation-death-from-chemotherapy-finds-study",
    "description": "Here is how cancer cells fend off starvation, death from chemotherapy, finds study",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241126111247.jpg",
    "description1": "\n\n\nNew York [US], November 26 (ANI): Laboratory experiments with cancer cells reveal two ways in which tumors evade drugs designed to starve and kill them, a new study shows. While chemotherapy successfully treats tumours and extends patients' lives, it is known that they do not work for everyone for long, since cancer cells rewire the mechanism by which they transform fuel into energy (metabolism) in order to avoid the treatments' effects. Many of these medications are so-called antimetabolics, which disrupt cell processes necessary for tumour growth and survival.\nLed by researchers at NYU Langone Health and its Perlmutter Cancer Center, the new study shows how cancer cells survive in an environment made hostile by the persistent shortage of the energy from glucose (the chemical term for blood sugar) needed to drive tumor growth. This better understanding of how cancer cells evade the drugs' attempts to kill them in a low-glucose environment, the researchers say, could lead to the design of better or more effective combination therapies.\n\nThree such drugs used in the study -- raltitrexed, N-(phosphonacetyl)-l-aspartate (PALA), and brequinar -- work to prevent cancer cells from making pyrimidines, molecules that are an essential component to genetic letter codes, or nucleotides, that make up RNA and DNA. Cancer cells must have access to pyrimidine supplies to produce more cancer cells and to produce uridine nucleotides, a primary fuel source for cancer cells as they rapidly reproduce, grow, and die. Disrupting the fast-paced but fragile pyrimidine synthesis pathways, as some chemotherapies are designed to do, can rapidly starve cancer cells and spontaneously lead to them dying (apoptosis).\nStudy results showed that the low-glucose environment inhabited by cancer cells, or tumor microenvironment, stalls cancer cell consumption of existing uridine nucleotide stores, making the chemotherapies less effective.\nNormally, uridine nucleotides would be made and consumed to help make the genetic letter codes and fuel cell metabolism. But when DNA and RNA construction is blocked by these chemotherapies, so too is the consumption of uridine nucleotide pools, the researchers found, as glucose is needed to change one form of uridine, UTP, into another usable form, UDP-glucose. The irony, researchers say, is that a low-glucose tumor microenvironment is in turn slowing down cellular consumption of uridine nucleotides and presumably slowing down rates of cell death. Researchers say cancer cells need to run out of pyrimidine building blocks, including uridine nucleotides, before the cells will self-destruct.\n\n\nIn other experiments, low-glucose tumor microenvironments were al",
    "description2": "so unable to activate two proteins, BAX and BAK, sitting on the surface of mitochondria, a cell's fuel generator. Activation of these trigger proteins disintegrates the mitochondria, and instantly sets off a series of caspase enzymes that help initiate apoptosis (cell death).\n\"Our study shows how cancer cells manage to offset the impact of low-glucose tumor microenvironments, and how these changes in cancer cell metabolism minimize chemotherapy's effectiveness,\" said study lead investigator Minwoo Nam, PhD, a postdoctoral fellow in the Department of Pathology at NYU Grossman School of Medicine and Perlmutter Cancer Center.\n\"Our results explain what has until now been unclear about how the altered metabolism of the tumor microenvironment impacts chemotherapy: low glucose slows down the consumption and exhaustion of uridine nucleotides needed to fuel cancer cell growth and hinders resulting apoptosis, or death, in cancer cells,\" said senior study investigator Richard Possemato, PhD. Possemato is an associate professor in the Department of Pathology at NYU Grossman School of Medicine and also a member of Perlmutter Cancer Center.\nPossemato, who is also coleader of the Cancer Cell Biology Program at Perlmutter, says his team's study results could one day be used to develop chemotherapies or combination therapies that would change or trick cancer cells into responding the same way in a low-glucose microenvironment as they would in an otherwise stable glucose microenvironment.\nHe also says that diagnostic tests could be developed to measure how a patient's cancer cells would most likely respond to low-glucose microenvironments and to predict how well a patient might respond to a particular chemotherapy.\nPossemato says his team has plans to investigate how blocking other cancer cell pathways might trigger apoptosis in response to these chemotherapies. Some experimental drugs, such as Chk-1 and ATR inhibitors, already exist that might accomplish this, he notes, but more need to be investigated because Chk-1 and ATR inhibitors are not well tolerated by patients.\nFor the study, researchers performed a scan of 3,000 cancer cell genes known to be involved in cell metabolism to determine, by deletion, which were necessary for cancer cell survival after chemotherapy. Most of the genes they found that were essential to cell survival in low-glucose tumor environments were also involved in pyrimidine synthesis, a precise biological pathway targeted by many chemotherapies. This focused their experiments on how different lab-grown clones of cancer cells responded to low-glucose after chemotherapy and what other chemical processes were impacted by depressed sugar levels. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241126111247.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "How stress is fundamentally changing our memories, finds study",
    "link": "http://localhost:3000/fitness/how-stress-is-fundamentally-changing-our-memories-finds-study",
    "siteurl": "http://localhost:3000/fitness/how-stress-is-fundamentally-changing-our-memories-finds-study",
    "description": "How stress is fundamentally changing our memories, finds study",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241115170806.jpg",
    "description1": "\n\n\nToronto [Canada], November 15 (ANI): Researchers at The Hospital for Sick Children (SickKids) revealed that stress alters how our brain encodes and retrieves aversive memories, and they developed a potential new method for restoring adequate memory specificity in persons suffering from post-traumatic stress disorder (PTSD).\nIf you stumble during a presentation, you might feel stressed the next time you have to present because your brain associates your next presentation with that one poor and aversive experience. This type of stress is tied to one memory. But stress from traumatic events like violence or generalized anxiety disorder can spread far beyond the original event, known as stress-induced aversive memory generalization, where fireworks or car backfires can trigger seemingly unrelated fearful memories and derail your entire day. In the case of PTSD, it can cause much greater negative consequences.\n\nIn a study published in Cell, Drs. Sheena Josselyn and Paul Frankland, Senior Scientists in the Neurosciences & Mental Health program, identify the biological processes behind stress-induced aversive memory generalization and highlight an intervention which could help restore appropriate memory specificity for people with PTSD.\n\"A little bit of stress is good, it's what gets you up in the morning when your alarm goes off, but too much stress can be debilitating,\" says Josselyn, who holds a Canada Research Chair in Circuit Basis of Memory. \"We know that people with PTSD show fearful responses to safe situations or environments, and have found a way to limit this fearful response to specific situations and potentially reduce the harmful effects of PTSD.\"\nTogether with their colleague Dr. Matthew Hill at the University of Calgary Hotchkiss Brain Institute, the research team was able to block endocannabinoid receptors on interneurons, and limit stress-induced aversive memory generalization to the specific, appropriate memory.\n\n\nIn a preclinical model, the research team exposed subjects to an acute, but safe, stress before an aversive event to create a non-specific fearful memory that could be triggered by unrelated safe situations, similar to how PTSD presents in humans.\nThe team then examined the subject's ",
    "description2": "memory engrams, which are physical representations of a memory in the brain pioneered by the Josselyn and Frankland labs at SickKids. Usually, engrams are made up of a sparse number of neurons, but the stress-induced memory engrams involved significantly more neurons. These larger engrams produced generalized fearful memories that were retrieved even in safe situations.\nWhen they looked closer at these large engrams, the study found that stress caused an increase in the release of endocannabinoids (endogenous cannabinoids) which disrupted the function of interneurons, whose role is it to constrain the size of the engram.\nThe endocannabinoid system enhances memory formation and helps link lived experiences with specific behavioural outcomes. In the amygdala, the emotional processing centre of the brain, certain 'gate keeper' interneurons have special receptors for endocannabinoids, and help constrain the size of the engram and the specificity of the memory. But, when too many endocannabinoids are released, the function of the gatekeeping interneurons is disrupted, causing an increase in the size of the engram.\n\"Endocannabinoid receptors function like a velvet rope at an exclusive club. When stress induces the release of too many endocannabinoids, the velvet rope falls, causing more generalized aversive fearful memories to form,\" explains Josselyn. \"By blocking these endocannabinoid receptors just on these specific interneurons, we could essentially prevent one of the most debilitating symptoms of PTSD.\"\nIn 2023, previous research in Science identified larger, more generalized memory engrams in the developing brain than in the adult brain, just like stress-induced memory engrams. As they continue to explore this unexpected link between engram size, stress and age, the teams are also delving into how daily stressors may impact happy memories.\n\"The many biological functions and processes that make up the complexity of human memory are still being uncovered,\" says Frankland, who holds a Canada Research Chair in Cognitive Neurobiology. \"We hope that as we better understand human memory, we can inform real-world therapies for those with various psychiatric and other brain disorders throughout their lifespan.\" (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241115170806.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "New antibody could be promising cancer treatment: Study",
    "link": "http://localhost:3000/fitness/new-antibody-could-be-promising-cancer-treatment-study",
    "siteurl": "http://localhost:3000/fitness/new-antibody-could-be-promising-cancer-treatment-study",
    "description": "New antibody could be promising cancer treatment: Study",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241111181154.jpg",
    "description1": "\n\n\nUppsala [Sweden], November 11 (ANI): Researchers at Uppsala University and KTH Royal Institute of Technology have created an antibody that has the potential to treat a variety of cancers. Researchers were able to integrate three different functionalities in the antibody, which combined significantly increased the action of T cells on the cancer tumour.\nResearchers have developed a unique type of antibody that both targets and delivers a drug package via the antibody itself, while simultaneously activating the immune system (\"3-in-1 design\") for personalised immunotherapy treatments.\n\n\"We have been researching precision medicine for close to 15 years now, as well as how we can use antibodies to influence an important key protein (CD40) in the immune system. We can now show that our new antibody method works as precision medicine for cancer,\" explains Sara Mangsbo, professor at the Department of Pharmacy at Uppsala University, who together with Johan Rockberg, professor at KTH Royal Institute of Technology, is the study's lead author.\n\n\nThe drug redirects the immune system to find and target specific mutations and gene changes that are only found in cancer cells, known as neoantigens. This is achieved by the new antibody both delivering the unique tumour-specific material directly to a particular type of immune cell and by stimulating this cell simultaneously, which then has the capacity to greatly enhance the T-cell response to the tumour.\nThe results show that the method works in several ways",
    "description2": ". Not only does it activate the right type of immune cells in human blood samples, but animal models show that mice receiving the treatment had prolonged survival and, at higher doses, also save the mice from cancer, and that the method is safer than previous cancer treatments the researchers have studied.\nCustomised precision medicines can be both costly and time-consuming to develop.\n\"The advantage of our drug is that it is easy to produce on a larger scale , yet can be easily tailored to the patient's disease or specific tumour. The medicine consists of two parts that are combined, a targeting bispecific antibody - which can be produced in large quantities in advance - and a custom peptide part, which is produced rapidly synthetically on a small scale for a desired type of cancer. Both in terms of production cost and the short time it takes to tailor a peptide to a new tumour, this increases availability and should make it quicker for patients to go from diagnosis to treatment,\" explains Johan Rockberg, Professor at KTH Royal Institute of Technology.\nThe aim of the study was to establish a more flexible, faster and safer treatment for cancer than those currently available. The study has already shown that the method has the potential to be customised for each patient, thereby strengthening the immune system against cancer. The next step is to use the fully optimised production process to manufacture the drug candidate for further safety studies and then start clinical trials in humans. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241111181154.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "Researchers reveal how a mother's health issues pose risk to her children",
    "link": "http://localhost:3000/fitness/researchers-reveal-how-a-mother-s-health-issues-pose-risk-to-her-children",
    "siteurl": "http://localhost:3000/fitness/researchers-reveal-how-a-mother-s-health-issues-pose-risk-to-her-children",
    "description": "Researchers reveal how a mother's health issues pose risk to her children",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241105164711.jpg",
    "description1": "\n\n\nTrondheim [Norway], November 5 (ANI): Women with polycystic ovary syndrome, also known as PCOS and obesity are more likely to have smaller babies in terms of birth weight, length, and head circumference, according to a recent study from the Norwegian University of Science and Technology (NTNU).\nPCOS is a hormonal illness that affects one out of every eight women. Male sex hormone levels are often increased, menstrual periods are inconsistent or rare, and tiny cysts grow on the ovaries.\n\nIn the study, 390 children born to women with PCOS were compared with about 70,000 children from the Norwegian Mother, Father, and Child Cohort Study (MoBa).\nThe researchers discovered that, on average, kids born to moms with PCOS weighed less, were shorter, and had a smaller head circumference. This was especially true for obese moms, who had a BMI of 30 or above.\n\"In women of normal weight who have PCOS, we only find that their children have a lower birth weight compared to women who do not have PCOS. It is the group of children born to mothers with obesity that stands out the most. These babies have lower weight, shorter stature and a smaller head circumference. Obesity places an additional burden on mothers who have PCOS and their children,\" said Professor Eszter Vanky at NTNU's Department of Clinical and Molecular Medicine.\nPCOS is a disease that follows women throughout their lives and can trigger various metabolic diseases and challenges such as diabetes, high blood pressure, and obesity. Women with PCOS are generally more likely to develop overweight and obesity.\n\"What is unusual is that women who are generally overweight and gain a lot of weight during pregnancy usually have an increased risk of giving birth to large babies. This also applies to women who develop gestational diabetes. On average, women with PCOS have higher BMIs, gain more weight during pregnancy, and 25 per cent of them develop gestational diabetes. However, the outcome is the opposite: these women give birth to babies who are smaller than average. We still don't know why, but we see that the placenta is affected in these women,\" said Vanky.\nThe newly qualified doctors Maren Talmo and Ingvild Floysand have carried out the study as their master's thesis, with Eszter Vanky and Melanie Rae Simpson as their supervisors. Talmo explains that even though the placenta in these women is smaller in size, it seems to deliver more nutrients relative to the baby's body we",
    "description2": "ight compared to a normal placenta. Vanky describes it as a placenta in overdrive.\n\"The placenta delivers nutrients to the baby through the umbilical cord. In women with PCOS, we see that the placenta is generally smaller in size. At the same time, it must provide everything the baby needs, so it has to work very hard to meet these demands. Sometimes, however, the placenta can't keep up, which can lead to placental insufficiency and, in rare cases, foetal death.\"\n\n\nThe researchers do not know why this is the case.\n\"There are many hypotheses, but I don't think anyone has a definitive answer yet. Previously, we thought the cause was linked to the high levels of male sex hormones, but we have not been able to fully connect the two. We also know that women with PCOS have a slightly different immune profile during pregnancy.\"\nThe researchers believe this is important knowledge both for the women affected and for healthcare professionals.\n\"A newborn baby is not a blank slate. Much of our long-term health is established in the womb. Genes play a role, but also what we are exposed to during the foetal stage and early in life,\" said Vanky.\nThe NTNU researchers now want to learn more about what happens to the children's health.\n\"What are the consequences of the mother's PCOS diagnosis for the child? Is there anything that can be done before or during pregnancy so that expectant mothers with PCOS do not gain too much weight? Can follow up and good glucose regulation be provided so that the child gets the best outcome possible? All this depends on knowing more about the mother's situation,\" said Vanky.\nThe NTNU researchers have also followed up on some of the children when they reached the age of 7 years.\n\"We saw that the children born to mothers with PCOS generally had more central obesity, meaning they were larger around the waist,\" said Vanky.\nOther studies have shown that children born to mothers with PCOS are at higher risk of developing overweight and obesity at a young age. Research has also shown that low birth weight is linked to the development of type 2 diabetes and cardiovascular disease later in life.\n\"We see differences in children as early as 7 or 8 years old, where children born to mothers with PCOS have a larger waist circumference and higher BMI. They bear small signs that their mother has PCOS. It may therefore be an advantage to know about this so we can provide guidance on lifestyle and diet,\" said Vanky. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241105164711.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "Study finds techniques to protect neurons from harmful impact of high-fat diet on multiple sclerosis progression",
    "link": "http://localhost:3000/fitness/study-finds-techniques-to-protect-neurons-from-harmful-impact-of-high-fat-diet-on-multiple-sclerosis-progression",
    "siteurl": "http://localhost:3000/fitness/study-finds-techniques-to-protect-neurons-from-harmful-impact-of-high-fat-diet-on-multiple-sclerosis-progression",
    "description": "Study finds techniques to protect neurons from harmful impact of high-fat diet on multiple sclerosis progression",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241101093557.jpg",
    "description1": "\n\n\nNew York [US], November 1 (ANI): The study, led by Patrizia Casaccia, founding director of the Advanced Science Research Centre at the CUNY Graduate Center's (CUNY ASRC) Neuroscience Initiative and Einstein Professor of Biology and Biochemistry at the CUNY Graduate Centre, investigated how enzymes known as ceramide synthase 5 and 6 are responsible for the toxic effect of a palm oil-rich diet on neurones in the central nervous system, which leads to an increase in the severity of MS symptoms.\nMS is an inflammatory autoimmune disease marked by extensive damage to the insulating myelin sheath that protects nerves throughout the body. Current treatments focus on controlling the immune system's response, but the precise mechanisms contributing to neurodegeneration in MS remain poorly understood. Previous work from the Casaccia lab and others had reported on the toxic effect of a high-fat diet on the severity of MS symptoms. In their study, researchers explored potential mechanisms by which a diet rich in palm oil may hijack neuronal health.\n\nUsing the experimental autoimmune encephalomyelitis (EAE) model of inflammatory demyelination, the research team found that diets high in palm oil led to a more severe disease course in mice.\n\n\n\"We reasoned that inside neuronal cells, palm oil is converted into a toxic substance called C16 ceramide by specific enzymes called CerS5 and CerS6,\" said principal investigator Casaccia. \"This ceramide is responsible for inflicting mitochondrial damage, which d",
    "description2": "eprives neurons of the energy they need to counteract inflammation in the brain. We therefore asked whether inactivation of these enzymes would confer neuroprotection.\"\nThe researchers found that when they genetically deleted the enzymes CerS6 and CerS5 in neurons they could prevent neurodegeneration in the experimental model of MS.\n\"This held true even when mice were fed a diet rich in palmitic acid,\" said the paper's co-first author Damien Marechal, a research associate with the Casaccia Lab. \"This new information points to a specific metabolic pathway through which dietary fats can worsen MS symptoms.\"\nThe paper's findings have significant implications for individuals diagnosed with MS as well as for clinicians treating patients and neuroscientists researching the disease. The work reinforces that lifestyle choices, such as diet, can have a profound impact on the course of the disease. The study's results build on previous concepts about careful dietary choices in managing the symptoms of MS. The findings also identify potential molecules that could help slow diet-induced symptom severity.\n\"Our research provides a molecular explanation for how to protect neurons from the palm-oil-dependent creation of molecules that harm them,\" said Casaccia. \"We hope this information can empower patients to make informed dietary decisions that could positively impact the course of the disease, while identifying strategies to counteract the effect of cerS5 and CerS6 in a neuron-specific fashion.\" (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241101093557.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "5 women share how they dealt with their difficult in-laws",
    "link": "http://localhost:3000/fitness/5-women-share-how-they-dealt-with-their-difficult-in-laws",
    "siteurl": "http://localhost:3000/fitness/5-women-share-how-they-dealt-with-their-difficult-in-laws",
    "description": "5 women share how they dealt with their difficult in-laws",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115864947/115864947.jpg",
    "description1": "When a woman marries, she doesn’t just form a relationship with her husband but also builds new connections with his entire family. These bonds can range from beautiful, with open arms and acceptance, to challenging and complex. However, no matter the situation, her husband's family becomes a significant part of her life, right? So, the question arises: how can she maintain these relationships while being respectful and also achieving her goals- - be it their love, respect, or a special place in their hearts?Here, five women share their real-life experiences of facing challenges with their in-laws. They reveal how they refused to give up, tackled the issues with smart strategies, and eventually transformed these relationships into beautiful bonds over time. 115864961Priya and her sister-in-law Priya from Bengaluru was often judged by her sister-in-law, Neha, for focusing on her job. How she dealt with it: Priya politely explained to Neha how she balanced work and family, and not just solely focused on her job. Priya explained to her how she understands the importance of a good work-life balance. Neha started to understand her better and became supportive when she saw her working hard in both her personal and professional life. Priya also made an effort to involve Neha in family activities, which helped their relationship improve. Eventually, they grew closer and started respecting each other’s choices more.Aditi and her mother-in-law 115864974 Aditi from Delhi had a controlling mother-in-law who always criticized her. How she dealt with it: Aditi spoke to her husband, Arjun, who slowly and politely helped set boundaries with his mom. Aditi also learned to stay calm and choose which issues to address. Over time, things got better, and her mother-in-law st",
    "description2": "arted respecting her more. Aditi also found ways to build a better relationship by spending time together, which helped ease the tension. She understood that consistent efforts would make her relationship better, and it did. Sanya and her father-in-lawSanya from Mumbai felt immense hurt because her father-in-law, Mr. Rao, compared her to his previous daughter-in-law. How she dealt with it: Sanya calmly spoke to Mr. Rao and explained how his words made her feel. While not immediately, he slowly understood and became more respectful. Over time, their relationship became less tense, and Mr. Rao stopped comparing her to others. Sanya also worked on building a more comfortable atmosphere by staying patient and understanding. She understood and gave her father-in-law proper time and space while also working towards making their relationship better. 115864979Neha and her mother-in-lawNeha from Kolkata was often criticized by her traditional and somewhat orthodox mother-in-law for not doing all the household work. How she dealt with it: Neha spoke to her husband, Raghav, and they divided the work fairly. She also gently set boundaries with her mother-in-law. Over time, her mother-in-law understood and respected her decisions more. Neha made sure to express gratitude for her mother-in-law’s help, which softened the relationship.Simran and her in-lawsSimran from Chandigarh felt immensely overwhelmed by her in-laws who kept interfering in her life personal life.How she dealt with it: Simran spoke openly to her in-laws and told them she needed space. With her husband’s help, they set clear boundaries. Simran was firm but polite, and her in-laws started respecting her more. She also made time for family activities to maintain good relationships despite the boundaries.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115864947/115864947.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-12-02T10:42:00+05:30",
    "dateModified": "2024-12-02T10:42:00+05:30"
  },
  {
    "title": "Study reveals surprising factors that shape the future of relationships",
    "link": "http://localhost:3000/fitness/study-reveals-surprising-factors-that-shape-the-future-of-relationships",
    "siteurl": "http://localhost:3000/fitness/study-reveals-surprising-factors-that-shape-the-future-of-relationships",
    "description": "Study reveals surprising factors that shape the future of relationships",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115706961/115706961.jpg",
    "description1": "Relationship dynamics have long interested experts and the public at large. There have been many debates and studies on the subject. Quite often people are left questioning if there is a difference between women and men predicting a better relationship outcome. A new research appearing in the Journal of Social and Personal Relationships has given this topic a brand new perspective. Done by Matthew D. Johnson, professor of family science at the University of Alberta, this research predicts just how well men and women make up romantic relationships. With 314 unmarried mixed-gender couples participating in his four-year study, he provides insight that clashes with, but further refines, our long-standing assumptions.  115706962 Traditionally, it has been believed that women have a sort of \"sixth sense\" in regard to relationships: they notice problems sooner and take steps toward resolution or separation when necessary. Social psychological theories would argue that societal norms force women to take greater responsibility for maintaining a relationship, which makes them more sensitive to their perception that a relationship is failing. Evolutionary theorists further argue that the greater biological investment of women in producing offspring makes them more eager to see that their relationships perform with l",
    "description2": "ong-run goals.However, this new study contradicts this concept. The research highlights that women are better at predicting breakups only in the area of commitment. If a woman's commitment decreases, then it strongly predicts a break up within two, three, and four years. However, this predictive power does not extend to other aspects of the relationship such as satisfaction and love. 115706967The study revealed that men's and women's judgments of love and marital satisfaction were equal, in determining relationship outcomes. This appears to break a stereotype that women are better predictors of relationship success just because of their gender. Instead, it is noticed that though women can easily sense and react to changing commitments levels in their relationships, perceptions of love and satisfaction on the part of both partners plays an equally important role for the longevity of their relationship.The study highlights the complexity of dynamics in relationships and suggests that the hypothesis that the women are \"relationship experts\", is overstated. Instead, both men and women play significant roles in predicting and affecting the direction of the future of their relationships, and their perceptions are of equal importance to understanding relationship outcomes. 115728981 115846006 115779903 115706108",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115706961/115706961.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "TOI Trending Desk",
    "datePublished": "2024-12-01T17:00:00+05:30",
    "dateModified": "2024-12-01T17:00:00+05:30"
  },
  {
    "title": "Kash Patel's personal life: Is Trump's FBI director-pick married? All about his early days",
    "link": "http://localhost:3000/fitness/kash-patel-s-personal-life-is-trump-s-fbi-director-pick-married-all-about-his-early-days",
    "siteurl": "http://localhost:3000/fitness/kash-patel-s-personal-life-is-trump-s-fbi-director-pick-married-all-about-his-early-days",
    "description": "Kash Patel's personal life: Is Trump's FBI director-pick married? All about his early days",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115869207/115869207.jpg",
    "description1": "US President-elect Donald Trump has announced his intention to nominate Kash Patel, a lawyer, investigator, his former aide and a devoted ally to serve as FBI director.“I am proud to announce that Kashyap ‘Kash’ Patel will serve as the next Director of the Federal Bureau of Investigation. Kash is a brilliant lawyer, investigator, and ‘America First’ fighter who has spent his career exposing corruption, defending Justice, and protecting the American People,” Trump posted on Truth Social on November 30.The 44-year-old served as a county and federal public defender in Florida between 2005 and 2013 and in 2014, he joined the Department of Justice as a trial attorney, and also served as a legal liaison to the Joint Special Operations Command.Patel is fond of playing ice hockey and has been a player, coach and a fan as described by his Department of Defense biography. During Trump’s first term, Patel advised both the director of national intelligence and the secretary of defense. 115666199Is Kash Patel married?While the searches about the Patel's personal life and marriage have been growing, there is no verified information about him being married, however, there are unconfirmed reports about his secret wedding.At the age of 37, Patel entered and then dropped out of a charity bachelor auction featuring some colleagues after a blogger pointed out that his license to practice in Florida appeared out of date as reported by New York Times.Kash Patel early daysBorn as Kashyap Pramod Patel in New York’s Long Island, he is a G",
    "description2": "ujarati and was raised a Hindu. Despite being away from his roots, he says he has a “very deep connection” with India.Patel, the authorPatel has penned a book called Government Gangsters. According to news agency AP, Patel teamed with Bannon to release a film version. Patel has also authored children’s books that lionize Trump — “The Plot Against the King” features a thinly veiled Hillary Clinton as the villain going after “King Donald” while Kash plays a wizard who thwarts her plans. 115569511Known for his roles as a counterterrorism prosecutor, a senior advisor, and a staffer on the House Intelligence Committee, Patel has built a reputation for being both influential and controversial. A graduate of Pace University Law School, he has held various positions in public service, including as a public defender in Florida and later at the Department of Justice.Patel gained significant attention during his time as a senior aide to Representative Devin Nunes, where he was reportedly involved in drafting the contentious memo alleging FBI misconduct in the Russia investigation. His career has not been without controversy; he has been criticized for alleged breaches of protocol, including a trip to London to meet with former British intelligence officer Christopher Steele outside standard diplomatic channels. Despite these challenges, Patel has cultivated connections in Washington, including at the White House, where he has participated in advisory roles under the Trump administration.(Picture courtesy: AP images) 79349726",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115869207/115869207.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-12-01T18:31:00+05:30",
    "dateModified": "2024-12-01T18:31:00+05:30"
  },
  {
    "title": "How letting go of ego can lead to lasting happiness",
    "link": "http://localhost:3000/fitness/how-letting-go-of-ego-can-lead-to-lasting-happiness",
    "siteurl": "http://localhost:3000/fitness/how-letting-go-of-ego-can-lead-to-lasting-happiness",
    "description": "How letting go of ego can lead to lasting happiness",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115862970/115862970.jpg",
    "description1": "So often, we are told to annihilate our ego, kill our ego or destroy your ego but can one do these? Can one destroy their ego, which is their identity? Ego is the one that identifies as ‘I’, ‘my’ and ‘mine’. From the time we are born, till the time we are gone, it is the ego that identifies us with our body. We say, ‘I am Ravi,’ ‘This is my car,’ and ‘These properties are mine.’ What gives rise to such feelings of possession and thereby, such statements? It is our ego. Unfortunately, because of the ego, we become unhappy. It is the ego that creates the seven monsters of our life - anger, hate revenge, jealousy, pride, greed and selfishness. It is because of the ego that our Happiness dissolves and disappears. Therefore, if we want to be happy, we must eliminate our ego but we can't. We must let go of the ego but we can't. We can’t because ego is our basic identity from the birth to the death of our body and that stays with us until the death of our body. So, there is only one solution to solve the arrogance of the ego and do away with the seven monsters associated with it – We must work towards Enlightening of our Ego. What is Enlightening of Ego? Enlightening is Awakening of the Ego, realizing that I am not ‘I’. Of course, I am but ‘Who am I?’ It is realizing that I am not the body that will die. This body came much later but I was conceived and alive 9 months before the body came into being in the form of a zygote. Then, this zygote formed into an embryo and was delivered on this earth. One day, this body will grow old and die and people will either cremate or bury it. All this happens because I am not the body. I am the one that was alive in the body. People will say that I passed away because I would have left the body. I am that Spark Of Unique Life, the Soul. When I realize that I am the Soul, I will achieve my goal. I can live a life of Eternal Bliss living in the Truth Consciousness of who I am, in reality. Th",
    "description2": "erefore, we must remember that we cannot completely let go of our ego. We will retain some parts of it but we can for sure, Awaken the Ego and Enlighten the Ego. When there is a true Realization of, ‘Who am I?’ In that very moment, there is Liberation from the misery, sorrow and the seven monsters of the ego. Then, we experience a state of Eternal Bliss. Everlasting Happiness has a numerator as there are many ways to be happy. True Happiness has 3Ps representing the three ascending peaks of Happiness namely-- pleasure, peace and purpose. Most of us are caught in pleasure because the Mind and the Ego, ME, wants to feel or rather become happy. Because we are trying to become happy, we are not happy. Happiness is a state of ‘being’. We must ‘be happy’. How can we be happy? We can be happpy by realizing our true self, our true energy, our Divine self that is within. The moment we create a duality of ‘I’ and ‘you’, problems start. The Realization of non-duality is the way to Awaken and Enlighten our Ego, which is the way to Eternal Bliss and Everlasting Happiness. So, the next time we hear somebody saying, ‘Let go of the ego,’ remember that one can completely let go of the ego only in the moment of death. Only in the moment of death, the ego will go because we won't exist anymore but as long as we exist, the ego or the identity with the body will remain. A word of caution! One shouldn’t try to annihilate or kill the ego because one can't. And one shouldn’t even try to let go of the ego too. One must just realize the simple yet profound and life-transforming Truth of ‘Who am I, in reality.’ One must Awaken and Enlighten the Ego and in that light of the Truth, one will experience Eternal Peace, Divine Love and Everlasting Bliss. One will never cry because they have discovered the Truth of, ‘Who am I?’Authored by: AiR- Atman in Ravi, author, singer, philanthropist and happiness ambassador 115706960 115728981 115817558 71221211",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115862970/115862970.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-12-01T14:00:00+05:30",
    "dateModified": "2024-12-01T14:00:00+05:30"
  },
  {
    "title": "5 most common walking mistakes and how to fix them",
    "link": "http://localhost:3000/fitness/5-most-common-walking-mistakes-and-how-to-fix-them",
    "siteurl": "http://localhost:3000/fitness/5-most-common-walking-mistakes-and-how-to-fix-them",
    "description": "5 most common walking mistakes and how to fix them",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115893186/115893186.jpg",
    "description1": "One of the easiest ways to maintain the shape of our body is to walk; it doesn't require any special equipment or a gym membership. The US Centre for Disease Control and Prevention says that adults should participate in at least 150 minutes of moderate-intensity aerobic activity per week for optimal health. This may be 30 minutes of walking per day for 5 days a week, or whatever works best for a person's schedule. However, keep in mind that if done improperly, even this simple exercise may be less beneficial or even dangerous. These are some of the most frequent errors people make when walking, along with simple fixes.Walking while distracted Using your phone or watching videos while walking can compromise your posture, reduce awareness of your surroundings, and increase the risk of accidents. A study done in 2018 highlights how multitasking while walking impacts coordination and reduces the overall benefits of the activity. It suggests that smartphone use while walking can significantly decrease balance and changes a person's manner of walking which ultimately has negative effects on the body. Fix: Commit to a distraction-free walk. Keep the phone tucked away and focus on the posture and environment to ensure safety and maximize benefits. 115893195Wearing improper footwearBlisters, foot soreness, and even chronic problems can result from wearing the incorrect shoes. Your joints may be strained if your shoes don't have enough arch support or cushioning to absorb impact. It is always recommended and various studies also say that investing in comfortable, supportive footwear tail",
    "description2": "ored to your walking needs will eventually be fruitful to your health. Fix: Choose shoes that fit well, provide adequate support, and suit your walking style. Neglecting hydrationWalking, especially in warmer weather or for long durations, can lead to dehydration, which will of course in all cases impact the person's stamina and recovery. As per a study published, when the body lacks enough water, it struggles to maintain balance during challenges like illness, exercise, or exposure to extreme environments, which can negatively impact health and bodily functions. A lack of hydration diminishes blood flow and can make the walks feel more like a job that you definitely don't want to do any longer.Fix: Drink water before and after your walks. You can always carry a reusable water bottle to stay hydrated. 115893210Improper walking formDragging the feet or slouching while walking reduces efficiency and can lead to muscle strain or fatigue. Walking with poor form—such as leaning forward, not engaging your core, or failing to roll your feet properly—can also strain your back and knees.Fix: Maintain an upright posture with shoulders relaxed and back. Keep your gaze forward, engage your core, and ensure a smooth heel-to-toe motion.Ignoring postureYour walking posture directly affects your joints and muscles. A fumbled pattern of walking can cause discomfort and limit the efficacy of your walk. Incorrect posture also raises the chance of developing persistent neck or lower back discomfort.Fix: Maintain proper posture by standing tall, chest open, and arms naturally swinging at your sides.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115893186/115893186.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-12-02T14:00:00+05:30",
    "dateModified": "2024-12-02T14:00:00+05:30"
  },
  {
    "title": "Vikrant Massey takes a break from career: A lesson for men in prioritizing mental and physical health",
    "link": "http://localhost:3000/fitness/vikrant-massey-takes-a-break-from-career-a-lesson-for-men-in-prioritizing-mental-and-physical-health",
    "siteurl": "http://localhost:3000/fitness/vikrant-massey-takes-a-break-from-career-a-lesson-for-men-in-prioritizing-mental-and-physical-health",
    "description": "Vikrant Massey takes a break from career: A lesson for men in prioritizing mental and physical health",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892951/115892951.jpg",
    "description1": "Actor Vikrant Massey, known for movies like '12th Fail', 'The Sabarmati Report' has announced taking a break from acting and this has stirred a wave of concern among his fans and followers who loved his movies especially the recent ones. The 'Sector 36' actor has always been loved both on screen and off screen and is not just an excellent actor but also a fitness icon. Men, who are in their 30s have a great deal to learn from the actor.What men don't prioritize is paying equal attention to mental health and physical health. Men in their 30s should prioritize physical fitness by incorporating regular exercise, such as strength training and cardio, to maintain muscle mass and support heart health. Nutrition is crucial—focus on a balanced diet rich in protein, whole grains, healthy fats, and essential vitamins like vitamin D and omega-3s.Mental health deserves equal attention; managing stress through mindfulness, hobbies, or therapy can prevent burnout. Regular check-ups are vital to monitor blood pressure, cholesterol, and other markers for early detection of issues. Adequate sleep and limiting harmful habits like smoking or excessive alcohol consumption further enhance long-term well-being.Prioritise your needs and what you likeIn their 30s, men often juggle careers, relationships, and personal goals, leaving little room for self-care. Prioritizing personal needs and preferences is crucial for maintaining mental and emotional well-being. Focusing on what you truly enjoy prevents burnout, fosters happiness, and strengthens your sense of identity amidst life’s demands.Vikrant’s decision to stop acting and focus on family is a learning lesson for those who deep inside crave to spend quality time with family and friends but are unable to do so.This practic",
    "description2": "e also enhances decision-making, as aligning actions with personal values leads to more fulfilling outcomes. Ignoring one’s needs can result in resentment, stress, and a lack of balance in life. By prioritizing yourself, you cultivate better relationships and improve overall productivity, making life richer and more meaningful.It is okay to be vulnerableThe '12th fail' actor who won hearts by playing IPS Officer Manoj Sharma in the movie had recently spoken about vulnerability and the concept of masculinity. In an interview with GQ magazine he opened up on how men are becoming more attuned to their emotions and, with time, are learning to extend greater kindness to themselves and those around them.Vikrant recently became father to a son. On his plans on raising his son, Vikrant told the media portal: I’m going to take each day as it comes. I want to be nimble and think on my feet, so I can adapt. The pace at which the world is changing is faster than most of us can comprehend, so there’s no point in planning ahead. The priority is to ensure my baby is healthy, and apart from that, I’m just soaking it all in.\"I realise it's time to recalibrate and go back home\"\"The last few years and beyond have been phenomenal. I thank each and every one of you for your indelible support. But as I move forward, I realise its time to recalibrate and go back home. As a Husband, Father & a Son. And also as an Actor,\" he wrote.\"So coming 2025, we would meet each other for one last time. Until time deems right. Last 2 movies and many a years of memories. Thank you again. For everything and everything in between,” Vikrant has penned an emotional note on Instagram announcing his break from acting.https://www.instagram.com/p/DDDPEs0zd9s/https://www.instagram.com/p/DDDPEs0zd9s/",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892951/115892951.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-12-02T13:27:00+05:30",
    "dateModified": "2024-12-02T13:27:00+05:30"
  },
  {
    "title": "Eating almonds after morning walk can have profound benefits",
    "link": "http://localhost:3000/fitness/eating-almonds-after-morning-walk-can-have-profound-benefits",
    "siteurl": "http://localhost:3000/fitness/eating-almonds-after-morning-walk-can-have-profound-benefits",
    "description": "Eating almonds after morning walk can have profound benefits",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115886263/115886263.jpg",
    "description1": "Walking, despite being a low impact workout, is an effective way to begin the day. Take short bouts, strides of walk in the morning nourishes the cognitive health in the right way. But what many people overlook is the diet following a long walk. You need to eat nutritious food right after finishing walk and there is no food better than a handful of almonds.A new study found regularly eating almonds may aid recovery after exercise by reducing pain and muscle damage, while improving muscle performance. Eating foods that help people recover from exercise by reducing muscle fatigue and soreness may help them better stick to their exercise routines. These new findings add to the growing body of scientific evidence exploring how almonds affect recovery after exercise. Prior studies investigated almonds’ effect on feelings of fatigue and exercise metabolism and explored the impact of eating almonds on feelings of soreness and muscle performance.In this new randomized, crossover study, published in Current Developments in Nutrition and funded by the Almond Board of California, 26 middle-aged adults who exercised one to four hours per week and were at a healthy weight or mildly overweight (body mass index (BMI) of 23-30) ate either two ounces (57g) of whole raw almonds or a calorie-matched (three ounces / 86g) of unsalted pretzels daily for eight weeks. After eight weeks of eating almonds or the control food with a four-week washout period between the two interventions, participants performed a 30-minute downhill treadmill run to induce muscle damage, then were immediately given their daily two-ounce (57g) serving of almonds or calorie-matched pretzels. Participants continued to eat daily servings of almonds or pretzels for three days after the treadmill run. Researchers measured participants’ perceived muscle soreness, muscle performance (assessed via a muscle contraction test and a vertical jump) and blood markers of muscle damage/inflammation (creatine kinase, C-reactive protein, myoglobin and antioxidant capacity) before the treadmill run and at 24, 48 and 72 hours after the run.The Results:During exercise recovery (up to 72 hours after the treadmill run), the almond group compared to control had: Lower creatine kinase (CK) levels - a marker of muscle damage.A quicker decline in CK levels after 72 hours, which may indicate a faster recovery rate.Better muscle performance at 24 and 72 hours. Modestly reduced pain ratings following maximal contraction at 24 (37% lower) and 48 hours (33% lower)There were no differences in other biochemical markers of muscle damage and inflammation (like C-reactive protein, myoglobin concentrations and total antioxidant capacity). This study tested non-smoking adults who exercised one to four hours per week and were at a healthy weight or were mildly overweight, so the results may not apply to people with other demographic and health characteristics. Future studies should also consider taking measurements over a longer recovery period. 115886323“Our study provides more insight into the role almonds may play in supporting fitness recovery,” said Dr. Mark Kern, PhD, RD, CSSD, professor of exercise and nutritional sciences at San Diego State University. \"Almonds contain a wide range of nutrients that we know supp",
    "description2": "ort exercise recovery including protein, antioxidants and phytonutrients. These nutrients are supplied in a whole food package versus isolated vitamin supplements which may contribute to the almond benefits observed in this study.\" One ounce (28 g) of almonds provides 6g of protein, 4g of fiber, 13g of unsaturated fat, only 1g of saturated fat, and 15 essential nutrients, including 77mg magnesium (18.3% DV), 210mg potassium (4% DV), and 7.27mg vitamin E (50% DV), making them a great snack for healthy active lifestyles. 112190969 115255436 “More research is needed to understand the mechanisms behind how almonds improve exercise recovery. Strategies to improve exercise recovery are important because if you are recovering better, you are likely to be able to train sooner—or harder—for subsequent workouts,” Dr. Kern said. Study Conclusion: Snacking on two ounces (57g) of almonds for eight weeks modestly reduced pain ratings, helped maintain muscle strength, and reduced muscle damage after exercise. Commenting of the newly published study, Nutrition and Wellness Consultant Sheela Krishnaswamy, said, “Almonds are a nutrient powerhouse, and the recent research highlights their role in possibly aiding muscle recovery in occasionally active healthy or mildly overweight adults. It shows that consuming two ounces of almonds daily for two months modestly reduced muscle soreness and damage in individuals who exercise occasionally. Participants experienced lower creatine kinase levels (a muscle damage marker), a quicker decline in creatine kinase levels which may indicate faster recovery, improved muscle performance, and less soreness even 72 hours post-exercise. This shows that almonds can may effectively reduce muscle pain, enhance strength, and support faster recovery, making them a valuable addition to the diet of occasionally active individuals.\" 104895442Rohini Patil, MBBS and Nutritionist, said, “The recent research highlights that consuming two ounces of almonds daily can significantly reduce muscle soreness, enhance recovery, and improve exercise performance. This small yet powerful nut is packed with essential nutrients such as protein, healthy fats, fiber, and important vitamins and minerals, making it an ideal addition to any fitness regimen. Regular almond intake helps minimize muscle pain, boost muscle strength, and promote quicker post-workout recovery, allowing you to come back stronger. By fueling your body and aiding faster recovery, almonds make an excellent companion for achieving your fitness goals.”Ritika Samaddar, Regional head, Department of Clinical Nutrition and Dietetics, Max Healthcare - New Delhi, said, “Almonds are a nutrient powerhouse, and the recent research highlights their role in aiding muscle recovery. It shows that consuming two ounces of almonds daily for two months significantly reduced muscle soreness and damage in individuals who exercise regularly. Participants experienced lower creatine kinase levels (a muscle damage marker), faster recovery, improved muscle performance, and less soreness even 72 hours post-exercise. This clearly shows that almonds can effectively reduce muscle pain, enhance strength, and support faster recovery, making them a valuable addition to the diet of active individuals.\" 115886339",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115886263/115886263.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-12-02T13:00:00+05:30",
    "dateModified": "2024-12-02T13:00:00+05:30"
  },
  {
    "title": "How Brain Rot, the Oxford Word of the Year, needs to be understood for a better mental health",
    "link": "http://localhost:3000/fitness/how-brain-rot-the-oxford-word-of-the-year-needs-to-be-understood-for-a-better-mental-health",
    "siteurl": "http://localhost:3000/fitness/how-brain-rot-the-oxford-word-of-the-year-needs-to-be-understood-for-a-better-mental-health",
    "description": "How Brain Rot, the Oxford Word of the Year, needs to be understood for a better mental health",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115885094/115885094.jpg",
    "description1": "The Oxford University Press has named 'brain rot' as its Word of the Year. The selection of the Word of the Year is done on the basis of public voting, in which more than 37,000 people had participated this year. \"Our language experts created a shortlist of six words to reflect the moods and conversations that have helped shape the past year. After two weeks of public voting and widespread conversation, our experts came together to consider the public’s input, voting results, and our language data, before declaring ‘brain rot’ as the definitive Word of the Year for 2024,\" the official statement said. 115885139It defines brain rot as the supposed deterioration of a person’s mental or intellectual state, especially viewed as the result of overconsumption of material (now particularly online content) considered to be trivial or unchallenging. Also: something characterized as likely to lead to such deterioration.But what is it, exactly? \"Brain rot\" isn't an actual medical condition, -it's a colloquial term used to describe mental stagnation or cognitive decline resulting from too much consumption of nonproductive or overstimulating content, such as scrolling endlessly on social media or binge-watching shows.This term \"brain rot\" describes the actual sensation of mental exhaustion or numbing as a consequence of reading and watching pointless material. Try to imagine wasting several hours browsing randomly through YouTube videos or checking out Instagram Reels without any sense of purpose. This appears innocuous enough, but all such wasted time adds up over time and can gradually contribute to cognitive fatigue and decline in one's ability to concentrate, think, and meaningfully interact with the world. 115885143This \"rotting\" isn't literal, of course—there’s no actual decay in the brain. Instead, it’s about how overexposure to low-quality or repetitive stimuli can limit your intellectual growth and emotional well-being. When the brain isn’t challenged with constructive activities, it can lose its sharpness, much like how a muscle weakens if not exercised. 115485932\"Our experts noticed that ‘brain rot’ gained new prominence this year as a term used to capture concerns about the impact of consuming excessive amounts of low-quality online content, especially on social media. The term increased in usage frequency by 230% between 2023 and 2024,\" the Oxford University Press said.Why brain rot needs to be assessed properl",
    "description2": "yMental health thrives on balance—balancing productivity and rest, stimulation and calm, consumption and creation. Brain rot disrupts this balance, and its effects can be far-reaching. Constant exposure to fast media can overstimulate your brain, which might lead to a feeling of stress. Social media platforms, particularly, thrive on endless feeds, which may create anxiety from comparisons, FOMO, or negativity exposure. The constant change of content often conditions the brain to crave instant gratification, making it challenging to hold one's attention for a longer period of time.10 effective brain exercises to start the day withOver time, this contributes to a lack of productivity, further fueling feelings of frustration or inadequacy. Too much low-quality content can desensitize you emotionally. The overabundance of memes or trivial content can leave you feeling unfulfilled, even though you’ve spent hours consuming it. Late-night scrolling sessions can wreak havoc on your sleep hygiene. Poor sleep directly impacts mental health, leading to issues such as depression, irritability, and fatigue.How to address the concept of brain rotThe concept of \"brain rot\" serves as a wake-up call in a world overflowing with distractions. By addressing this phenomenon, you can improve your cognitive function but also nurture your overall mental health. First of all, track your digital habits. Most smartphones contain built-in tools that measure how much time you spend in different applications. Identify what occupies most of your time and evaluate if it adds value to your life. For instance, do you get inspired by scrolling through Instagram, or does it drain you?Creative activities would combat the passive nature of mere mindless consumption. In addition to scrolling through social media, one can attempt to write, draw, cook, or learn something new. Creative pursuits are good for the brain and self-esteem. 115353281Be choosy about what you consume. Instead of consuming garbage, make sure to consume stuff that nourishes your mind: watch documentaries, listen to podcasts, or read books. If you like social media, follow inspiring or educational accounts rather than comparison-oriented ones.Mindfulness techniques help train the brain to stay present, countering the overstimulation caused by excessive media consumption. Simple practices like deep breathing, journaling, or yoga can make a big difference in re-centering your mind.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115885094/115885094.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 9:27:26 am",
    "courtesy": "TOI Lifestyle Desk",
    "datePublished": "2024-12-02T10:00:00+05:30",
    "dateModified": "2024-12-02T10:00:00+05:30"
  }
]