[
  {
    "id": "SRM",
    "title": "SPORTS LIVE - 2023",
    "link": "https://www.imdb.com/title/tt0111161/",
    "movie.watch": "../../Sports-2023/Sports"
  },
  {
    "id": "INDEX45",
    "title": "TAKKAR  ",
    "name": " Takkar (2023)",
    "poster": "https://i.postimg.cc/nVyQpn1S/57-Seconds-2023.webp",
    "banner": "https://i.postimg.cc/nVyQpn1S/57-Seconds-2023.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,"," ROMANCE,", " DRAMA."],
    "rating": 6.2,
    "synopsis": "Takkar (2023) is a compelling coming-of-age account that revolves around the life of Arjun (played by Siddharth), a young and ambitious somebody motivated by the want to amass wealth. In Arjun's worldview, money holds the nam to success and prosperity. However, his position takes an intriguing turn when he encounters Meera (portrayed by Divyansha Kaushik), a spirited young woman who believes that money is the source of all life's troubles. For Meera, true happiness lies beyond stuff possessions. Although Arjun and Meera have contrastive ideologies, a magnetised force draws them together. They embark on a transformative journey, gradually discovering how to submit their divergent views on money. through and through their shared experiences, they undefined to realize that money tin wield both positive and negative influences, and it is at last the choices individuals make that determine its impact on their lives. Takkar delves into the complex themes of love, loss, and the profound influence of wealth. It provides an introverted exploration of personal growth and the quest for undefined in a world driven by materialism. As Arjun and Meera navigate their intertwined destinies, they undergo significant transformations, evolving into individuals who appreciate the nuanced relationship between money and fulfillment. The film showcases Siddharth's remarkable portrait of Arjun, capturing the character's drive and ambition. Divyansha Kaushik breathes living into Meera, depicting her as a free-spirited soul who challenges societal norms and conventional notions of wealth. Directed by a illusionist filmmaker, Takkar weaves put together an engrossing tale that captures the essence of self-discovery. With its poignant storytelling and perceptive exploration of homo emotions, the film captivates audiences, leaving them pondering the complex dynamics 'tween love, ambition, and the determine of money. In summary, Takkar (2023) is a thought-provoking cinematic experience that offers a ne perspective on the interplay between personal growth and wealth. It's a tale of two individuals discovering the delicate balance 'tween material aspirations and the true essence of happiness.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/TAKKAR-_2023.mp4?updatedAt=1689195675042",
    "starring": [
      "Yogi Babu",
      "Divyansha Kaushik",
      "Munishkanth",
      "E. Ramdoss",
      "Siddharth."
    ],
    "director": " Karthik G. Krish.",
    "country": " India.",
    "date": "2023-06-09",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt9872558/",
    "link2": "https://en.wikipedia.org/wiki/Takkar_(2023_film)",

    "movie.watch": "../../Bollywood/Takkar-2023/Takkar",

    "movie.watchP1": "https://sblona.com/e/6krwez53wavx.html",
    "movie.watchSR1": "https://dooood.com/e/2l52plql15p5",

    "down1link1": "https://sblona.com/d/6krwez53wavx.html",
    "down2link1": "https://dooood.com/d/2l52plql15p5",
       
    "movie.trailer": "hhttps://ik.imagekit.io/gmcl6xvq6/TAKKAR-_2023.mp4?updatedAt=1689195675042",
    "contentRating": "India: UA  ",
    "Originalnetwork": "Passion Studios.",
    "language": " Hindi."
  },
  {
    "id": "INDEX44",
    "title": "ANARI PART 1 ",
    "name": " Anari Part 1 (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1689195704/Anari-Part1-2023_ayysyc.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1689195704/Anari-Part1-2023_ayysyc.webp",
    "yearRelease": 2023,
    "genre": [" ADULT, ", " EROTIC, ", " HOT +18."],
    "rating": 4.4,
    "synopsis": "The movie Anari Part 1 (2023) is a captivating romantic comedy-drama typeset in India. It revolves around the news report of Anjali (played by Riya Sen), a youth fair sex who finds herself trapped in an arranged marriage to a affluent man of affairs onymous Rakesh (portrayed by Karan Singh Grover). Unhappy with her situation, Anjali becomes unregenerate to escape from her controlling and possessive husband. During her journey, Anjali crosses paths with Rahul (played by Siddharth Gupta), a young humans also grappling with the realities of an staged marriage. As they form a friendship, a forbidden have it off blossoms between them. undefined their trench connection, Anjali and Rahul empathize the constraints placed upon them and the impossibility of being together. Rakesh, in his possessiveness, restricts Anjali's interactions with unusual work force and even resorts to surveillance, installation cameras in their home to monitor her every move. Undeterred, Anjali remains resolute in her call for for exemption and plans to elope with Rahul. However, their plans are discovered by Rakesh, who will stop over at nothing to frustrate their escape. Rakesh kidnaps Rahul, keeping him captive in a remote location. He demands that Anjali accompany him, threatening Rahul's life otherwise. unscheduled into a difficult choice, Anjali reluctantly goes with Rakesh but vows to find a way to save Rahul and reunify with him. Through her determination and resourcefulness, Anjali manages to escape from Rakesh's grip and reunites with Rahul. Realizing their love can ne'er thrive in India, they work the decision to start a newly living together in a foreign land. The movie concludes with Anjali and Rahul getting married in an suggest ceremony. at last free from their oppressive circumstances, they embrace their new freedom and embrace the chance to go gayly ever after.Anari disunite 1 is a delightful romantic comedy-drama that skillfully balances suspense, drama, and romance. The film showcases outstanding performances, with Riya Sen portraying the trapped and courageous Anjali, Karan Singh Grover embodying the controlling Rakesh, and Siddharth Gupta charmingly delivery Rahul to life. Directed by Mohit Suri and produced by Ekta Kapoor, Anari Part 1 delivers a compelling narrative that wish captivate viewers. Released on ULLU on March 10, 2023, the film boasts a runtime of 2 hours, providing audiences with an immersive cinematic experience. Overall, Anari Part 1 is a must-watch for fans of romantic comedy-dramas, offering a perfect blend of suspense, drama, and romance.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Anari___Part_-_1___Official_Trailer.mp4?updatedAt=1689195675308",
    "starring": [
      "Smita Paul",
      "Suhana Khan",
      "Rajsi Verma."
      
    ],
    "director": " Punit Goyal.",
    "country": " Indian.",
    "date": "2023-07-11",
    "status": "New Movie",
    "link": "#",
    "link2": "#",

    "movie.watch": "../../Adult/Anari-Part1-2023/Anari-Part1",
    
    "movie.watchP1": "https://likessb.com/e/q7cwsl16safy.html",
    "movie.watchSR1": "https://dooood.com/e/w4s4eboqfgdu",

    "down1link1": "https://likessb.com/d/q7cwsl16safy.html",
   "down2link1": "https://dooood.com/d/w4s4eboqfgdu",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Anari___Part_-_1___Official_Trailer.mp4?updatedAt=1689195675308",
    "contentRating": " India: 18+ ",
    "Originalnetwork": " Ullu Originals.",
    "language": " Hindi."
  },
  {
    "id": "INDEX43",
    "title": "MISSION IMPOSSIBLE  ",
    "name": " Mission Impossible Dead Reckoning Part One (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1689195744/Mission_Impossible_Dead_Reckoning_Part_One_2023_r0pnam.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1689195744/Mission_Impossible_Dead_Reckoning_Part_One_2023_r0pnam.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,"," THRILLER,", " ADVENTURE."],
    "rating": 8.2,
    "synopsis": "The movie Mission: Impossible - Dead Reckoning Part One is set several years after the events of Mission: Impossible - Fallout (2018). Ethan Hunt and his team are now rogue agents, branded as wanted men by the IMF. They must face the consequences of their actions and come to terms with the possibility of losing the trust of their former organization. The story takes Ethan and his team on a global journey, traveling from London to Norway to Berlin. They utilize their skills and resources to stop a mysterious new enemy who possesses advanced technology that surpasses anything the IMF has ever encountered. Complicating matters further, Ethan's former mentor, Eugene Kittridge, now the head of the CIA, resurfaces and becomes determined to bring Ethan down. Mission: Impossible - Dead Reckoning Part One is a thrilling and visually stunning film. It features breathtaking action sequences that are sure to impress audiences. Directed by Christopher McQuarrie, known for his expertise in crafting high-octane films, this installment maintains the franchise's reputation for delivering impressive action sequences. The movie introduces new characters, including Hayley Atwell as Grace, a British MI6 agent working alongside Ethan; Pom Klementieff as the White Widow, a formidable assassin; and Shea Whigham as the Head of the CIA, relentless in his pursuit of Ethan. With its captivating cinematography and exciting action, Mission: Impossible - Dead Reckoning Part One is a must-see for fans of the franchise. It promises a thrilling and suspenseful experience, keeping audiences on the edge of their seats. The movie is scheduled to be released on July 14, 2023, with a runtime of 147 minutes. It is rated PG-13 for intense sequences of action and violence, some disturbing images, and brief strong language.  Filming took place in various locations, including London, Norway, Berlin, and the United States.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Mission__Impossible___Dead_Reckoning_Part_One___2023_Official__Trailer.mp4?updatedAt=1689195674644",
    "starring": [
      "Tom Cruise",
      "Hayley Atwell",
      "Ving Rhames",
      "Simon Pegg",
      "Rebecca Ferguson."
    ],
    "director": " Christopher McQuarrie.",
    "country": " United States.",
    "date": "2023-07-12",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt9603212/",
    "link2": "https://en.wikipedia.org/wiki/Mission:_Impossible_%E2%80%93_Dead_Reckoning_Part_One",

    "movie.watch": "../../Hollywood/Mission-Impossible-2023/Mission-Impossible",

    "movie.watchP1": "https://sblona.com/e/kum30ldrrqz0.html",
    "movie.watchSR1": "https://dooood.com/e/ll6jvix88zyi",

    "down1link1": "https://sblona.com/d/kum30ldrrqz0.html",
    "down2link1": "https://dooood.com/d/ll6jvix88zyi",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Mission__Impossible___Dead_Reckoning_Part_One___2023_Official__Trailer.mp4?updatedAt=1689195674644",
    "contentRating": "United States:PG-13  ",
    "Originalnetwork": "Paramount Pictures.",
    "language": " English."
  },
  {
    "id": "INDEX42",
    "title": "SUPER VOLCANO ",
    "name": " Super Volcano (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1689195765/Super_Volcano_2023_lgdyau.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1689195765/Super_Volcano_2023_lgdyau.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,"," SCI-FI,", " THRILLER."],
    "rating": 4.6,
    "synopsis": "The movie Super Volcano (2023) is a playful satire of undefined movies, taking exaggerated elements from the writing style and injecting humor for comedic effect. It specifically focuses on the consequences that would unfold if the Super Volcano in Yellowstone subject Park were to erupt. The account revolves around a group of scientists who diligently contemplate the Super Volcano and express their concerns about its long-overdue eruption. However, the government dismisses their warnings as exaggerated, refusing to undergo immediate action. When the Super Volcano at long last erupts, a series of cataclysmal events unfold. The eruption triggers powerful earthquakes, devastating tsunamis, and blankets the entire United States in a solid cloud of ash. Amid the chaos, a group of survivors must navigate the destruction and essay safety. Super Volcano features over-the-top action sequences and mind-boggling special effects. Audiences will witness stimulating scenes where characters narrowly escape streams of lava, find buildings crumbling under the unstable forces, and entire cities being decimated. The film cleverly parodies the familiar tropes and conventions of disaster movies, using humor to lighten the intensity of the situations. While Super Volcano maintains a humorous tone throughout, it does not counteract the genuine danger associated with volcanic eruptions. Instead, it provides an entertaining experience for fans of the undefined genre, blending exhilarating action, comedic moments, and salient special effects.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Super_Volcano___2023..mp4?updatedAt=1689195673722",
    "starring": [
      "Ashley Ahlquist",
      "Grant Bowler",
      "Ace Christensen",
      "Tyler Christopher",
      "Kyle Connors."
    ],
    "director": " Jared Cohn.",
    "country": " United States.",
    "date": "2022-11-28",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt23902190/",
    "link2": "#",

    "movie.watch": "../../Hollywood/Super-Volcano-2023/Super-Volcano",

    "movie.watchP1": "https://sblona.com/e/3s34hi6bs4zy.html",
    "movie.watchSR1": "https://dooood.com/e/1bvgq8imkj0s",

    "down1link1": "https://sblona.com/d/3s34hi6bs4zy.html",
    "down2link1": "https://dooood.com/d/1bvgq8imkj0s",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Super_Volcano___2023..mp4?updatedAt=1689195673722",
    "contentRating": "United States:TV-MA  ",
    "Originalnetwork": "The Global Asylum.",
    "language": " English."
  },
  {
    "id": "INDEX41",
    "title": "SCREAM VI ",
    "name": " Scream VI (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1689195754/Scream_VI_2023_ehfqly.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1689195754/Scream_VI_2023_ehfqly.webp",
    "yearRelease": 2023,
    "genre": [" HORROR,"," THRILLER,", " MYSTERY."],
    "rating": 6.6,
    "synopsis": "The survivors of the Ghostface killings from Woodsboro have left their traumatic past times behind and started a new chapter in New York City. However, their lives are about to be disrupted once over again when Ghostface resurfaces, targeting and hunt them down. Directed by Matt Bettinelli-Olpin and Tyler Gillett, known for their work on on Ready or Not and V/H/S, the film maintains the signature formula of the previous yell films. A group of teenagers becomes the raven of a masked killer, while the film at the same time satirizes and pays homage to repulsion genre conventions. The screenplay, written by James Vanderbilt, Guy Busick, and Kevin Williamson, promises a well-crafted story with its team up of experienced horror writers. With a recently setting in New House of York City, the take introduces newly characters and cultural references, adding a unique flavor to the yell universe. Expect stylish visuals and intensified violence from the skilled directing duo. The movie's climax, penned by the talented writing team, is likely to cater a satisfying resolution to the narrative. Overall, yell American Virgin Islands (2023) is self-possessed to be an exciting addition to the beloved Scream franchise. Fans tin anticipate a suspenseful, thrilling, and visually captivating horror experience that stays true to the series' legacy.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Scream_VI___Official_Trailer-2023.mp4?updatedAt=1689195673147",
    "starring": [
      "Courteney Cox",
      "Melissa Barrera",
      "Jenna Ortega",
      "Jasmin Savoy Brown",
      "Mason Gooding."
    ],
    "director": " Matt Bettinelli-Olpin, Tyler Gillett.",
    "country": " United States.",
    "date": "2023-03-10",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt17663992/",
    "link2": "https://en.wikipedia.org/wiki/Scream_VI",

    "movie.watch": "../../Hollywood/Scream-4-2023/Scream4",

    "movie.watchP1": "https://sblona.com/e/ci6i270ipwwz.html",
    "movie.watchSR1": "https://dooood.com/e/uvn7a6vwbjww",

    "down1link1": "https://sblona.com/d/ci6i270ipwwz.html",
    "down2link1": "https://dooood.com/d/uvn7a6vwbjww",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Scream_VI___Official_Trailer-2023.mp4?updatedAt=1689195673147",
    "contentRating": " United States:R  ",
    "Originalnetwork": "Paramount Pictures.",
    "language": " English."
  },
  {
    "id": "INDEX40",
    "title": "INDIANA JONES ",
    "name": " Indiana Jones and the Dial of Destiny (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1689195730/Indiana_Jones_and_the_Dial_of_Destiny_2023_l3ulyb.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1689195730/Indiana_Jones_and_the_Dial_of_Destiny_2023_l3ulyb.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,"," THRILLER,", " ADVENTURE."],
    "rating": 6.9,
    "synopsis": "The year is 1963, and Indiana Jones (Harrison Ford) is ready to retire from his adventurous life. He longs to spend his odd years in peace with his wife, Marion (Karen Allen). However, his plans are noncontinuous when he crosses paths with the ruthless Soviet agent Irina Spalko (Lena Headey). Spalko is on a quest to obtain the Dial of Destiny, an antediluvian artifact with the power to manipulate time. Recognizing the risk of the artifact falling into the wrong hands, Indy reluctantly agrees to get together the fight against Spalko. Teaming upward with his trusted friend Sallah (John Rhys-Davies) and a youth woman named Helena (Alicia Vikander), Indy embarks on a perilous journey across Egypt, India, and Tibet in look for of the undefined of Destiny. Throughout their adventure, they encounter deadly traps, supernatural forces, and Spalko's merciless henchmen. Their determination and resourcefulness are put to the test as they overcome each challenge. In their quest, Indy and his team up with success turn up the undefined of circumstances but let out its vast power exceeds their expectations. The artefact has the ability to rewind time, and Spalko intends to castrate history using its power. Realizing the catastrophic consequences, Indy races against clock to confront Spalko and keep her from wielding the Dial's power. Their final examination opposition takes point in a enigma base concealed in the Himalayas. In a climactic battle, Indy emerges victorious, thwarting Spalko's plans and destroying the Dial of Destiny. The world is protected from the danger of neutering history. The movie concludes with Indy, Marion, and capital of Montana by his side as they ride off into the sunset. Although retired, Indy acknowledges that adventure will always be a separate of his life. They continue their journey, knowing that new adventures await.Indiana Daniel Jones and the Dial of Destiny is set in the 1960s and features thrilling litigate sequences, including car chases, gunfights, and a plane crash. The movie delves into themes of good versus evil, the import of destiny, and the power of history. Directed by James Mangold and written by David Koepp and Jonathan Kasdan, the film stars Harrison Ford, Karen Allen, Lena Headey, trick Rhys-Davies, and Alicia Vikander.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Indiana_Jones_and_the_Dial_of_Destiny___Trailer.mp4?updatedAt=1689195673477",
    "starring": [
      "Harrison Ford",
      "Phoebe Waller-Bridge",
      "Antonio Banderas",
      "Karen Allen",
      "John Rhys-Davies."
    ],
    "director": " James Mangold.",
    "country": " United States.",
    "date": "2023-06-30",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt1462764/",
    "link2": "https://en.wikipedia.org/wiki/Indiana_Jones_and_the_Dial_of_Destiny",

    "movie.watch": "../../Hollywood/Indiana-Jones-2023/Indiana-Jones",

    "movie.watchP1": "https://sblona.com/e/op535n6trem4.html",
    "movie.watchSR1": "https://dooood.com/e/2v4yq23h6f33",

    "down1link1": "https://sblona.com/d/op535n6trem4.html",
    "down2link1": "https://dooood.com/d/2v4yq23h6f33",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Indiana_Jones_and_the_Dial_of_Destiny___Trailer.mp4?updatedAt=1689195673477",
    "contentRating": "United States:PG-13  ",
    "Originalnetwork": "Walt Disney Studios Motion Pictures.",
    "language": " English."
  },
  {
    "id": "INDEX39",
    "title": "DEAD MANS HAND ",
    "name": " Dead Mans Hand (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1689195723/Dead_Mans_Hand_2023_qwz9k1.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1689195723/Dead_Mans_Hand_2023_qwz9k1.webp",
    "yearRelease": 2023,
    "genre": [" WESTERN,", " DRAMA."],
    "rating": 5.6,
    "synopsis": "Reno (Stephen Dorff) is a newly married gunfighter who seeks a peaceful life alongside his bride, Sarah (Delilah Andre). However, when Reno is forced to defend himself and kills a bandit in an act of self-defense, their plans for a quiet life are shattered. Clarence Bishop (Cole Hauser), the spoil city manager of their town, is unregenerate to avenge his brother's death. With a bounty on their heads, Reno and Sarah are unexpected to flee their hometown. They see refuge in a small mining town, hoping to evade Bishop and his henchmen. However, their pursuit is relentless, and Bishop sends his men to cross down the couple.Reno and Sarah manage to elude their pursuers for a while, but they soon find themselves caught in the middle of a deadly feud between II rival minelaying companies. In the chaos that ensues, Reno moldiness utilise his gunfighting skills to protect some himself and Sarah. Ultimately, Reno and Sarah emerge victorious, defeating Bishop and his men. However, the victory comes at a heavy cost—Sarah loses her life in the crossfire. Devastated by her death, Reno is left wing to mourn his love wife. The movie concludes with Reno riding off into the sunset, determined to find a new purpose and create a different living for himself.Dead Man's Hand is a western sandwich film set in the Old West, featuring intense gunfights and action sequences. It delves into themes of revenge, betrayal, and redemption. Directed by Brian Skiba and written by Kevin Minor, Matthew Minor, and Corin Nemec, the movie stars Stephen Dorff, Cole Hauser, jacklight Kilmer, and femme fatale Andre.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Dead_Man_s_Hand__2023__Official_Trailer.mp4?updatedAt=1689195675857",
    "starring": [
      "Delilah Andre",
      "Izzy Batinkoff",
      "Randall Batinkoff",
      "Mo Brings Plenty",
      "Jim Burleson."
    ],
    "director": " Brian Skiba.",
    "country": " United States.",
    "date": "2023-07-07",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt23469212/",
    "link2": "https://en.wikipedia.org/wiki/Dead_Man%27s_Hand_(2023_film)",

    "movie.watch": "../../Hollywood/Dead-Mans-Hand-2023/Dead-Mans-Hand",

    "movie.watchP1": "https://sblona.com/e/ju8mdpmixmof.html",
    "movie.watchSR1": "https://dooood.com/e/9610o2t9ocyl",

    "down1link1": "https://sblona.com/d/ju8mdpmixmof.html",
    "down2link1": "https://dooood.com/d/9610o2t9ocyl",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Dead_Man_s_Hand__2023__Official_Trailer.mp4?updatedAt=1689195675857",
    "contentRating": "United States:R  ",
    "Originalnetwork": "Grindstone Entertainment Group.",
    "language": " English."
  },
  {
    "id": "INDEX38",
    "title": "CASCADE ",
    "name": " Cascade (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1689195715/Cascade_2023_krsczc.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1689195715/Cascade_2023_krsczc.webp",
    "yearRelease": 2023,
    "genre": [" THRILLER,", " DRAMA."],
    "rating": 4.6,
    "synopsis": "Cascade (2023) is a survival thriller film oriented by Egidio Coccimiglio and scripted by Coccimiglio and Michael J. Murray. The shoot stars Jessica Amlee, Ryan Robbins, and Stephanie Bennett. The film follows a group of teenage girls led by 17-year-old Sarah (Jessica Amlee) as they embark on a Wilderness hike. Their adventure takes a nighttime ric when they stumble upon a crashed drug plane. To their shock, they discover that the skim is filled with illegal drugs. Realizing they cannot plainly leave the drugs behind, the girls make the risky undefined to undergo them with them. Unfortunately, this choice puts them in the undefined of a ruthless gang led by Javier (Ryan Robbins), who will stop at nonentity to repossess the drugs.As the gang up pursues them through the treacherous wilderness, the girls find themselves constantly on the run, exhausted, scared, and low on supplies. undefined the odds stacked against them, their determination to come through pushes them forward. In their bespeak for safety, the girls eventually find a secure concealment spot. However, they know the gang won't yield up easily. To ensure their long-term safety, they must find a way to dispose of the drugs once and for all. In a dare move, the girls decide to typeset fire to the plane, destroying the drugs. This infuriates the gang but ultimately leaves them defeated. The girls undefined victorious, having learned a valuable lesson just about the perils of the wilderness. Cascade delivers suspense and excitement, showcasing strong performances and surprising cinematography. The film features intense action sequences that are well-executed. While the shoot may stick to approximately predictable plat elements, and the character development may be lacking, it remains an attractive survival thriller. Its strength lies in its setting—the wilderness—which is skillfully portrayed, capturing some its ravisher and inherent dangers. The well-choreographed action sequences total to the film's appeal, offer philosophical doctrine and gritty portrayals of violence. Although the ending Crataegus oxycantha be somewhat foreseeable, it still provides a satisfying termination that corset true to the story, without attempting to be overly clever. Overall, Cascade stands as a solid survival thriller that entertains and keeps audiences on the edge of their seats.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Cascade___Official_Trailer.mp4?updatedAt=1689195675352",
    "starring": [
      "Sara Waisglass",
      "Greg Bryk",
      "Joanna Douglas",
      "Sadie Laflamme-Snow",
      "Josh Cruddas."
    ],
    "director": " Egidio Coccimiglio.",
    "country": " Canada.",
    "date": "2023-06-06",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt12180508/",
    "link2": "#",

    "movie.watch": "../../Hollywood/Cascade-2023/Cascade",

    "movie.watchP1": "https://sblona.com/e/7lj8tdhaxm58.html",
    "movie.watchSR1": "https://dooood.com/e/2xf08dr53ozv",

    "down1link1": "https://sblona.com/d/7lj8tdhaxm58.html",
    "down2link1": "https://dooood.com/d/2xf08dr53ozv",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Cascade___Official_Trailer.mp4?updatedAt=1689195675352",
    "contentRating": "Canada:TV-MA  ",
    "Originalnetwork": "Edge Entertainment.",
    "language": " English."
  },
  {
    "id": "INDEX37",
    "title": "SWEET KAARAM COFFEE ",
    "name": " Sweet Kaaram Coffee (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789933/Sweet_Kaaram_Coffee_2023_bpwurw.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789933/Sweet_Kaaram_Coffee_2023_bpwurw.webp",
    "yearRelease": 2023,
    "genre": [" FAMILY,", " DRAMA."],
    "rating": 8.5,
    "synopsis": "Sweet Kaaram Coffee is a 2023 Indian Tamil-language drama shoot directed by Ranjith Sankar and produced by K. Muruganantham. The film stars Lakshmi, Madhoo, Santhy Balachandran, Bala Suresh, and Kaala Bhavana. The film follows the lives of three women of unusual generations who live in the same house and undertake to put themselves ahead of the people they are bound by. The shoot opens with a scene of Lakshmi (Lakshmi), a middle-aged fair sex who is struggling to make ends meet. She works as a housemaid for a wealthy family, only she is constantly exploited by her employers. She is also a 1 mother who is raising her teenage daughter, Anjali (Rakshana). One day, Lakshmi meets Madhoo (Madhoo), a retired teacher who lives in the same house as her. Madhoo is a form and generous woman who offers to help Lakshmi with her finances. She too helps Lakshmi to find a freshly subcontract and to enroll Anjali in a good school. With Madhoo's help, Lakshmi is capable to start a new life for herself and her daughter. She becomes a successful businesswoman and she is capable to provide Anjali with the best training possible. Lakshmi is a warm and unregenerate woman who is not afraid to fight for what she believes in. She is as wel a touchy-feely and devoted mother who is forever putting her daughter's needs first.Madhoo is a Isaac Mayer Wise and compassionate woman who is always willing to serve others.She is a mentor to Lakshmi and she helps her to trust in herself and her dreams. Anjali is a bright and talented young woman who is stubborn to make a remainder in the world.She is inspired by her mother's effectiveness and determination, and she dreams of becoming a in businesswoman herself.The shoot explores the themes of female empowerment, friendship, and family. It shows how women can support each strange and help each other to achieve their dreams. It also shows the grandness of family and the challenges of raising a teenage daughter. The film is a heartwarming story about the power of women and the importance of never giving upward on your dreams. Lakshmi's journey to succeeder is not easy. She faces many challenges along the way, including discrimination, jealousy, and disapproval from her family. However, she never gives upwards and she in time achieves her dreams. Madhoo's subscribe is essential to Lakshmi's success. She is a true champion and wise man who is always there for Lakshmi when she of necessity her.Anjali is a young woman who is determination her own room in the world. She is glorious by her mother's strength and determination, and she dreams of becoming a successful businesswoman herself. The film is a heartwarming report all but the power of women and the importance of ne'er giving upwards on your dreams. It is a write up that wish stick with you hanker after you watch it.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Sweet_Kaaram_Coffee_-_Official_Trailer.mp4?updatedAt=1688789629677",
    "starring": [
      "Lakshmi",
      "Madhoo",
      "Santhy Balachandran",
      "Bala Suresh",
      "Kavin Jay Babu."
    ],
    "director": " Krishna Marimuthu, Swathi Raghuraaman, Bejoy Nambiar.",
    "country": " Indian.",
    "date": "2023-07-06",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt21908802/",
    "link2": "#",

    "movie.watch": "../../Bollywood/Sweet-Kaaram-Coffee-2023/SweetKaaramCoffee",

    "movie.watchP1": "https://sblona.com/e/qzpcrv120iq9.html",
    "movie.watchSR1": "https://sblona.com/e/qzpcrv120iq9.html",

    "down1link1": "https://sblona.com/d/qzpcrv120iq9.html",
    "down2link1": "https://sblona.com/d/qzpcrv120iq9.html",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Sweet_Kaaram_Coffee_-_Official_Trailer.mp4?updatedAt=1688789629677",
    "contentRating": "India:UA 16+  ",
    "Originalnetwork": "Amazon Prime Video.",
    "language": " Hindi."
  },
  {
    "id": "INDEX36",
    "title": "NEEYAT  ",
    "name": " Neeyat (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789901/Neeyat_2023_wdibvz.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789901/Neeyat_2023_wdibvz.webp",
    "yearRelease": 2023,
    "genre": [" CRIME,", " MYSTERY,", " THRILLER."],
    "rating": 9.1,
   "synopsis": "Neeyat is a 2023 Indian Hindi-language mystery thriller film directed by Anu Menon and produced by Ronnie Screwvala, Siddharth Roy Kapur, and Manish Mundra. The film stars Vidya Balan, Ram Kapoor, Rahul Bose, Shahana Goswami, and Harshvardhan Rane. The film follows a detective who investigates the murder of a billionaire at his birthday party. The take opens with a scene of a lavish birthday political party being held for Ashish Kapoor (Ram Kapoor), a wealthy businessman. The party is attended by Kapoor's close friends and family, including his wife, Rekha (Vidya Balan), and his daughter, Anya (Shahana Goswami). In the middle of the party, Kapoor is found dead in his swim pool. The police are called to investigate, and they quickly rule out the possibility of an accident. They believe that Kapoor was murdered, and they start to suspect his closest friends and family. The detective assigned to the case is Mira Rao (Vidya Balan), a acute and intuitive investigator. She quickly realizes that everyone at the party has something to hide. Rekha is a controlling and manipulative woman who is having an affair with Kapoor's best friend, Siddharth (Rahul Bose). Anya is a rebellious teenager who is struggling with her parents' expectations. And Siddharth is a ruthless businessman who is willing to do anything to protect his own interests. As Mira investigates, she uncovers a web of secrets and lies. She learns that Kapoor was not the saint that everyone thought he was. He was a remorseless businessman who had made many enemies. And he had a dark past that he had kept hidden from his family and friends. Mira eventually discovers who killed Kapoor, but the truth is more complicated than she ever imagined. The murder was not just about revenge. It was also about power and control. And it had far-reaching consequences that would change the lives of everyone involved. Mira Rao is a skilled detective who is able to see through the lies and deception of the people she interviews. She is also a compassionate woman who is able to empathize with the victims of the crime. For example, when she interviews Anya Kapoor, she can see that Anya is struggling with her parents' expectations and that she is feeling lost and alone. Mira is able to connect with Anya on a personal level and she offers her support. Rekha Kapoor is a complex character who is both vulnerable and manipulative. She is willing to do anything to protect her family, even if it means lying and cheating. For example, when she learns that her husband, Ashish Kapoor, is having an affair with her best friend, Siddharth, she is initially devastated. However, she eventually decides to use this information to her advantage. She blackmails Siddharth into leaving her husband, and she then uses the money she receives from him to start her own business. Siddharth is a ruthless businessman who is willing to do anything to get ahead. He is also a skilled manipulator who is able to convince people to do what he wants. For example, when he is trying to get Anya Kapoor to sign a contract that would give him control of her father's company, he uses her emotions against her. He tells her that if she doesn't sign the contract, he will ruin her father's reputation. Anya is afraid, and she signs the contract. Anya Kapoor is a rebellious teenager who is struggling to find her place in the world. She is also a talented artist who is trying to find her voice. For example, when she is feeling lost and alone, she turns to her art. She creates paintings that express her feelings, and she finds solace in the process of creating. The film explores the themes of greed, power, and revenge. It also shows the dark side of human nature and the lengths that people will go to protect their secrets. For example, when Anya learns that her father was murdered, she is determined to find the killer. She believes that the killer is someone close to her, and she is willing to do whatever it takes to find out who it is. She even risks her own safety to obtain the information she needs. The film ends with Mira Rao closing the case and capturing the killer. However, the film also shows that the event has had a lasting impact on everyone involved. Rekha Kapoor is now a single mother and she is struggling to raise Anya on her own. Siddharth is in jail and he has lost everything. And Anya is still trying to come to terms with the loss of her father. The film 'Neeyat' is a suspenseful and thought-provoking mystery thriller. It explores the dark side of human nature and the lengths that people will go to.",

    "audio": "https://ik.imagekit.io/gmcl6xvq6/Neeyat_-_Official_Trailer.mp4?updatedAt=1688789629477",
    "starring": [
      "Vidya Balan",
      "Ram Kapoor",
      "Rahul Bose",
      "Shahana Goswami",
      "Neeraj Kabi."
    ],
    "director": " Anu Menon.",
    "country": " Indian.",
    "date": "2023-07-07",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt21908676/",
    "link2": "https://en.wikipedia.org/wiki/Neeyat_(2023_film)",

    "movie.watch": "../../Bollywood/Neeyat-2023/Neeyat",

    "movie.watchP1": "https://sblona.com/e/y9r879cmewsd.html",
    "movie.watchSR1": "https://dooood.com/e/prrx0mobedpj",

    "down1link1": "https://sblona.com/d/y9r879cmewsd.html",
    "down2link1": "https://dooood.com/d/prrx0mobedpj",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Neeyat_-_Official_Trailer.mp4?updatedAt=1688789629477",
    "contentRating": " India: UA ",
    "Originalnetwork": "Pen Marudhar Entertainment.",
    "language": " Hindi."
  },
  {
    "id": "INDEX35",
    "title": "IB 71 ",
    "name": " IB 71 (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789873/IB_71_2023_ja3fp9.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789873/IB_71_2023_ja3fp9.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " THRILLER,", " DRAMA."],
    "rating": 8.2,
    "synopsis": "IB 71 is a 2023 Indian Hindi-language espionage thriller film directed by Sankalp Reddy and produced by process Hero Films, Reliance Entertainment, and T-Series. The film stars Vidyut Jamwal, Shruti Haasan, Neha Dhupia, and Chandan Roy Sanyal. The film is typeset in the aftermath of the 1971 India-Pakistan warfare and follows an Indian tidings officer who is tasked with infiltrating a Pakistani military base in order to prevent a nuclear attack on India. The film opens with a scene of a Pakistani military machine base being attacked by Indian jets. The attack is successful, but the Pakistani military machine retaliates by launch a nuclear missile at India. The missile is intercepted by an Indian refutation system, but the Indian government fears that the Pakistanis will launch another attack. The Indian government sends an intelligence officer, Ajay Singh Rathod (Vidyut Jamwal), to infiltrate the Pakistani military base and gather word on their plans. Rathod poses as a Pakistani soldier and is able to gain the bank of the Pakistani officers. He learns that the Pakistanis are planning to launch another nuclear missile at India, and he must race against time to stop them. Rathod is power-assisted in his mission by a Pakistani woman onymous Zara (Shruti Haasan). Zara is a doctor who workings at the armed forces base, and she is on the QT sympathetic to the Indian cause. She helps Rathod to pucker intelligence and to escape from the base when he is discovered. Rathod sooner or later succeeds in stopping the Pakistani military from launching the cell organelle missile. He does so by hacking into the Pakistani nuclear launch system and disqualifying it. The film ends with Rathod being hailed as a hero by the Indian government. Rathod's mission is successful even more difficult by the fact that he is not the only Indian spy in the base. There is another Indian spy, named Salim (Chandan Roy Sanyal), who is working for a rival intelligence agency. Salim is also trying to stop the Pakistanis from launch the nuclear missile, but he is working from the inside. Rathod and Carlos eventually team up to stop the Pakistanis, but they are not the only ones who are trying to stop the launch. The Pakistani military machine is too witting of the threat, and they are nerve-wracking to find and stop over the spies. The film culminates in a suspenseful and action-packed sequence in which Rathod and Salim rush against time to stop the Pakistanis from launching the cell organelle missile. In the end, they are successful, but not without casualties. Rathod is a skilled Martial artist and he uses his skills to struggle his way through the Pakistani military base. Zara is a beautiful and intelligent fair sex who is also a skilled doctor. She uses her skills to serve Rathod and Salim in their mission.Salim is a cunning and resourceful spy who is always one tread ahead of the Pakistanis. The Pakistani military is led by a ruthless general who is determined to launch the nuclear missile, atomic number 102 weigh what the cost.The film is full of suspenseful and action-packed scenes that will maintain you on the edge of your seat. The film is also a moving report about friendship, loyalty, and sacrifice.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/IB_71___Official_Trailer.mp4?updatedAt=1688789628611",
    "starring": [
      "Anupam Kher",
      "Vidyut Jammwal",
      "Bijay Anand",
      "Nissar Khan",
      "Dalip Tahil."
    ],
    "director": " Sankalp Reddy, Lee Whittaker.",
    "country": " Indian.",
    "date": "2023-05-12",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt15073166/",
    "link2": "https://en.wikipedia.org/wiki/IB71",

    "movie.watch": "../../Bollywood/IB71-2023/IB71",

    "movie.watchP1": "https://sblona.com/e/8kgmvgu3pvc9.html",
    "movie.watchSR1": "https://dooood.com/e/rac2ogn97l2w",

    "down1link1": "https://sblona.com/d/8kgmvgu3pvc9.html",
    "down2link1": "https://dooood.com/d/rac2ogn97l2w",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/IB_71___Official_Trailer.mp4?updatedAt=1688789628611",
    "contentRating": " India: UA ",
    "Originalnetwork": "Reliance Entertainment.",
    "language": " Hindi."
  },
  {
    "id": "INDEX34",
    "title": "TIKU WEDS SHERU  ",
    "name": " Tiku Weds Sheru (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688791126/Tiku_Weds_Sheru_2023_h6loie.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688791126/Tiku_Weds_Sheru_2023_h6loie.webp",
    "yearRelease": 2023,
    "genre": [" COMEDY,", " ROMANCE,", " DRAMA."],
    "rating": 3.6,
    "synopsis": "Tiku Weds Sheru is a 2023 Indian Hindi-language comedy-drama film directed by Sai Kabir and produced by Mukesh Bhatt below the streamer Vishesh Films. The film stars Nawazuddin Siddiqui and Avneet Kaur in the top roles, with Rahoul and Mukesh S. Bhatt in support roles. The take follows the story of Tiku (Kaur), a small-town girl who dreams of becoming an actress in Mumbai, and Sheru (Siddiqui), a bodyguard who has been working in the city for years. The II have married, but their family relationship is tested when Tiku's dreams take up to come true. The take begins with Tiku living in a moderate townsfolk with her family. She is a kind and diligent girl, simply she is also very ambitious. She dreams of becoming an actress in Mumbai, but her family cannot give to send her there. One day, Tiku meets Sheru, a bodyguard who has been working in Bombay for years. Sheru is impressed by Tiku's determination, and he offers to help her get to Mumbai. Tiku and Sheru suffer married, and they travel to Mumbai together. Tiku starts working as an actress, and she quickly becomes successful. Sheru is majestic of her, but he also feels left behind. He starts to work on as a security guard, but he is not felicitous with his job. One day, Tiku is offered a role in a big movie. She is excited about the opportunity, but she knows that it will mean a lot of time away from Sheru. Sheru is supportive of her decision, merely he is also distressed about how it will affect their relationship. Tiku starts filming the movie, and she quickly becomes really busy. Sheru tries to be understanding, but he starts to feel neglected. He starts outlay more time with his friends, and he even starts to flirt with other women. Tiku is hurt by Sheru's behavior, simply she tries to disregard it. She is too focused on her career to deal with her personal life. However, the problems in her family relationship start to take a cost on her. She becomes stressed and unhappy, and her public presentation in the moving-picture show starts to suffer. One day, Tiku has a breakdown on set. She realizes that she cannot continue to hold ou wish this, and she decides to terminate her marriage to Sheru. Sheru is heartbroken, just he understands her decision. He tells her that he will always love her, and he wishes her the trump of luck. Tiku moves on with her life, and she eventually becomes a successful actress. She never forgets Sheru, and she always treasures the clock they exhausted together. However, she knows that they were not meant to be together, and she is grateful for the lessons she learned from their relationship. The film ends with Tiku looking back on her life. She realizes that she has achieved her dreams, simply she also knows that she has lost something important along the way. She is sad just about the end of her marriage to Sheru, but she knows that she will ne'er forget him. The film Tiku Weds Sheru is a story about love, loss, and the quest of dreams. It is a moving and bittersweet film that will stay with you long after you have seen it.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Tiku_Weds_Sheru_-_Official_Trailer.mp4?updatedAt=1688791149102",
    "starring": [
      "Nawazuddin Siddiqui",
      "Avneet Kaur",
      "Rahoul",
      "Mukesh S. Bhatt",
      "Suresh Vishwakarma."
    ],
    "director": " Sai Kabir.",
    "country": " Indian.",
    "date": "2023-06-23",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt15891396/",
    "link2": "https://en.wikipedia.org/wiki/Tiku_Weds_Sheru",

    "movie.watch": "../../Bollywood/Tiku-Weds-Sheru-2023/Tiku-Weds-Sheru",

    "movie.watchP1": "https://sblona.com/e/63rhy1dpcmzw.html",
    "movie.watchSR1": "https://dooood.com/e/5rfxqz45u6np",

    "down1link1": "https://sblona.com/d/63rhy1dpcmzw.html",
    "down2link1": "https://dooood.com/d/5rfxqz45u6np",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Tiku_Weds_Sheru_-_Official_Trailer.mp4?updatedAt=1688791149102",
    "contentRating": " India: UA ",
    "Originalnetwork": " Amazon Prime Video.",
    "language": " Hindi."
  },
  {
    "id": "INDEX33",
    "title": "SPY  ",
    "name": " Spy (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789919/Spy_2023_tbqlgd.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789919/Spy_2023_tbqlgd.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " ADVENTURE,", " THRILLER."],
    "rating": 8.7,
    "synopsis": "The movie begins with R&AW agent Siddharth (Nikhil Siddharth) being assigned to investigate the activities of a notorious arms bargainer named Malhotra (Aryan Rajesh). Siddharth presently discovers that Malhotra is planning to sell a powerful artillery to a terrorist organization. Siddharth goes cloak-and-dagger as a smuggler in order to penetrate Malhotra's organization. He soon befriends Malhotra's right-hand man, Akash (Abhinav Gomatam). Through Akash, Siddharth learns that Malhotra is planning to utilise the weapon to lash out India's nuclear facilities. Siddharth confronts Malhotra and tries to stop him, but Malhotra is too powerful. He escapes and detonates a bomb at one of India's organelle facilities. The explosion causes a massive amount of damage and radiation. Siddharth is determined to stop Malhotra and keep him from carrying out his unusual attacks. He tracks Malhotra pop to a remote location and engages him in a final battle. Siddharth is victorious, only he is seriously injured. Despite his injuries, Siddharth manages to stop over Malhotra and prevent him from carrying out his attacks. He is hailed as a hero and is awarded the highest civilian honor in India. Siddharth's girlfriend, Meera (Iswarya Menon), is as wel a R&AW agent. She helps Siddharth with his probe and provides him with essential information.Malhotra is a ruthless and cunning villain. He will stop over at nonentity to achieve his goals.The weapon that Malhotra is planning to sell is a nuclear bomb. It is capable of destroying an stallion city.The terrorist organization that Malhotra is workings with is called the Black Widows. They are a group of highly trained and dangerous terrorists.The movie features some action sequences that are sure to sustain you on the edge of your seat.The movie likewise has a strong emotional core. It explores themes of love, loss, and sacrifice. Spy (2023) is an action-packed thriller with a strong feeling core. The movie features some of import performances, especially from Nikhil Siddharth and Iswarya Menon. The action sequences are well-choreographed and exciting. The movie also explores more or less fascinating themes, such as love, loss, and sacrifice. If you're looking for a thrilling and thought-provoking movie, then snoop (2023) is definitely Charles Frederick Worth checking out.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Spy_official_trailer-2023.mp4?updatedAt=1689014796021",
    "starring": [
      "Nikhil Siddharth",
      "Iswarya Menon",
      "Aryan Rajesh",
      "Abhinav Gomatam",
      "Sanya Thakur."
    ],
    "director": " Garry Bh.",
    "country": " Indian.",
    "date": "2023-06-29",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt15509266/",
    "link2": "#",

    "movie.watch": "../../Bollywood/Spy-2023/Spy",

    "movie.watchP1": "https://sblona.com/e/2srzjcipiy57.html",
    "movie.watchSR1": "https://dooood.com/e/509lnmbf3unm",

    "down1link1": "https://sblona.com/d/2srzjcipiy57.html",
    "down2link1": "https://dooood.com/d/509lnmbf3unm",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Spy_official_trailer-2023.mp4?updatedAt=1689014796021",
    "contentRating": " India: UA ",
    "Originalnetwork": " Red Cinemas.",
    "language": " Hindi."
  },
  {
    "id": "INDEX32",
    "title": "BLIND  ",
    "name": " Blind (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789860/Blind_2023_ife8k8.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789860/Blind_2023_ife8k8.webp",
    "yearRelease": 2023,
    "genre": [" CRIME,", " THRILLER,", " DRAMA."],
    "rating": 4.1,
   "synopsis": "Blind is a 2023 Indian Hindi-language thriller film directed by Aneesh Hazra and produced by A Kanai, AVMA Media, and Jio Studios. The film stars Sonam Kapoor as a blind woman who becomes the sole witness to a heinous crime. She must use her heightened senses to track down the killer and bring him to justice. The film begins with a young woman named Sophie being attacked and blinded by an unknown assailant. She is left for dead, but she manages to survive and eventually regains some of her sight. However, she is still severely visually impaired and must rely on her other senses to navigate. One day, Sophie is walking home from work when she witnesses a murder. She sees the killer's face, but she is unable to identify him. She reports the crime to the police, but they are skeptical of her story. They believe that she is mistaken or that she is making up the story for attention. Sophie is determined to find the killer herself. She uses her heightened senses to track him down, following his scent, listening for his footsteps, and even interpreting his body language. She eventually traces him to an abandoned warehouse. Sophie confronts the killer, but he overpowers her. He tries to kill her, but she manages to fight him off and escape. She runs back to her apartment and calls the police. The police arrive and arrest the killer. Sophie is hailed as a hero for her bravery, proving that even though she is blind, she is still capable of fighting for justice. She also becomes an inspiration to others who are visually impaired, showing them to never give up on their dreams. The killer is a man named Arjun, a wealthy businessman secretly involved in a criminal organization. He killed the victim because they knew too much about the organization's criminal activities. Sophie is able to track down Arjun by utilizing her other senses, following his scent to his apartment and listening for his footsteps when he leaves. She is also able to interpret his body language during their confrontation. The struggle between Sophie and Arjun is intense. While Sophie is able to fight back, Arjun eventually overpowers her. He attempts to strangle her, but she manages to break free and escape. Initially skeptical of Sophie's story, the police eventually believe her after she provides them with detailed descriptions of the killer and the crime scene. They are able to arrest Arjun and bring him to justice. Sophie's story is a testament that people with disabilities may face challenges, but they are still capable of achieving great things. Sophie becomes a hero who inspires others to never give up on their dreams.",

    "audio": "https://ik.imagekit.io/gmcl6xvq6/Blind_-_Official_Trailer.mp4?updatedAt=1688789628094",
    "starring": [
      "Sonam Kapoor",
      "Lucy Aarden",
      "Lillete Dubey",
      "Shubham Saraf",
      "Purab Kohli."
    ],
    "director": " Shome Makhija.",
    "country": " Indian.",
    "date": "2023-07-07",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt5316648/",
    "link2": "https://en.wikipedia.org/wiki/Blind_(2023_film)",

    "movie.watch": "../../Bollywood/Blind-2023/Blind",

    "movie.watchP1": "https://likessb.com/e/4jhyubhfhibz.html",
    "movie.watchSR1": "https://dooood.com/e/deme52w9zzft",

    "down1link1": "https://likessb.com/d/4jhyubhfhibz.html",
    "down2link1": "https://dooood.com/d/deme52w9zzft",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Blind_-_Official_Trailer.mp4?updatedAt=1688789628094",
    "contentRating": " India: UA ",
    "Originalnetwork": " Jio Cinema.",
    "language": " Hindi."
  },
  {
    "id": "INDEX31",
    "title": "LUST STORIES 2  ",
    "name": " Lust Stories 2 (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789892/Lust_Stories_2_2023_xici9x.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789892/Lust_Stories_2_2023_xici9x.webp",
    "yearRelease": 2023,
    "genre": [" ROMANCE,",  " DRAMA."],
    "rating": 7.3,
   "synopsis": "The movie Lust Stories 2 (2023) is a sequel to the 2018 anthology film Lust Stories. The take consists of four interwoven stories about love, lust, and desire. The first story is about a young woman named Anya (Rani Mukerji) who is married to a wealthy businessman. Anya is bored with her marriage and seeks excitement elsewhere. She meets a young man named Arjun (Arjun Kapoor), and they start an affair. The affair is passionate but dangerous, and Anya soon finds herself in over her head. The second story is about a middle-aged woman named Maya (Huma Qureshi) who is struggling to hold her marriage together. Maya's husband, Jai (Vicky Kaushal), is a workaholic, and he rarely pays attention to her. Maya begins an affair with a younger man named Veer (Adarsh Gourav) in an attempt to feel alive again. The affair gives Maya a sense of purpose, but it also threatens to destroy her marriage. The third story is about a young couple named Tara (Kiara Advani) and Veer (Siddhant Chaturvedi) who are in a long-distance relationship. Tara lives in Mumbai, and Veer lives in Delhi. The couple tries to maintain their relationship through phone calls and video chats, but it is difficult. Tara and Veer eventually decide to meet in person, but their reunion does not go as planned. The fourth and final story is about a group of friends who go on a weekend getaway. The friends are all from different backgrounds, and they have different expectations for the trip. One of the friends, a young woman named Meera (Sanya Malhotra), is hoping to have a sexual encounter with one of the other friends. Meera's plan backfires, and she ends up having a much more emotional experience than she bargained for. The four stories in Lust Stories 2 (2023) are all interconnected by the theme of desire. The characters in each story are all searching for something, whether it is excitement, love, or connection. The film explores the different ways that desire can manifest itself in our lives, and it shows how it can both enrich and destroy us. The film is directed by four different directors: Anurag Kashyap, Zoya Akhtar, Karan Johar, and Dibakar Banerjee. The film stars a number of well-known Indian actors, including Rani Mukerji, Huma Qureshi, Vicky Kaushal, Adarsh Gourav, Kiara Advani, and Siddhant Chaturvedi. The film was released in India on February 10, 2023. The film has received positive reviews from critics, with many praising the performances of the actors and the direction of the filmmakers.",

    "audio": "https://ik.imagekit.io/gmcl6xvq6/Lust_Stories_2___Official_Trailer.mp4?updatedAt=1688789629291",
    "starring": [
      "Kajol",
      "Mrunal Thakur",
      "Tamannaah Bhatia",
      "Tillotama Shome",
      "Kumud Mishra."
    ],
    "director": " R. Balki, Sujoy Ghosh, Amit Ravindernath Sharma, Konkona Sen Sharma.",
    "country": " Indian.",
    "date": "2023-06-29",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt27989067/",
    "link2": "#",

    "movie.watch": "../../Bollywood/Lust-Stories2-2023/ ",

    "movie.watchP1": "https://sblona.com/e/g06h4bqxganv.html",
    "movie.watchSR1": "https://dooood.com/e/z0jzeae2bmxs",

    "down1link1": "https://sblona.com/d/g06h4bqxganv.html",
    "down2link1": "https://dooood.com/d/z0jzeae2bmxs",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Lust_Stories_2___Official_Trailer.mp4?updatedAt=1688789629291",
    "contentRating": " India: A ",
    "Originalnetwork": " Netflix.",
    "language": " Hindi."
  },
  {
    "id": "INDEX30",
    "title": "SERGEANT ",
    "name": " Sergeant (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789919/Sergeant_2023_loplfl.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789919/Sergeant_2023_loplfl.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " THRILLER,", " DRAMA."],
    "rating": 4.3,
    "synopsis": "The movie Sergeant (2023) follows the write up of a former soldier named serjeant David, who suffers from severe slump after losing a limb on duty. He is struggling to adjust to civilian life and is haunted by the memories of his clock in the military. One day, Sergeant David is approached by a woman named Monica, who claims to be a former soldier as well. She tells him that she is part of a group of veterans who are helping other veterans who are troubled with PTSD. Sergeant David is at first skeptical, but he yet agrees to meet with Monica and her group. The group helps Sergeant David to undefined to damage with his trauma and to take up to rebuild his life. He makes new friends and begins to feel wish he belongs again. However, his newfound happiness is short-lived when he is targeted by a aggroup of criminals who are targeting veterans. The criminals are led by a man named Marcus, who is a sadistic and ruthless killer. He believes that veterans are weak and that they merit to suffer. Marcus and his men track toss off serjeant David and his friends and begin to terrorize them. Sergeant David and his friends are forced to fight for their lives. They apply all of their skills and training to survive, but they are outnumbered and outgunned. Just when it seems like whol hope is lost, Sergeant David remembers something that Monica taught him: that veterans are stronger than they think.   With renewed determination, Sergeant David and his friends fight back against Marcus and his men. They eventually manage to defeat them, but not without suffering heavily losses. In the end, serjeant-at-law David is able to find peace and closure, knowing that he has helped to protect strange veterans from harm. The movie Sergeant (2023) is directed by Prawaal Raman. The movie is based on a true story. The real-life Sergeant David is a former soldier who suffered from PTSD after serving in Afghanistan. ",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Sergeant_-_Official_Trailer.mp4?updatedAt=1688789627617",
    "starring": [
      "Daphne Alexander",
      "Tahir Ashraf",
      "Sonia Goswami",
      "Arun Govil",
      "Randeep Hooda."
    ],
    "director": " Prawaal Raman.",
    "country": " Indian.",
    "date": "2023-06-30",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt28152747/",
    "link2": "#",

    "movie.watch": "../../Bollywood/Sergeant-2023/Sergeant",

    "movie.watchP1": "https://likessb.com/e/we61aa9wj829.html",
    "movie.watchSR1": "https://dooood.com/e/tsn89dgovexg",

    "down1link1": "https://likessb.com/d/we61aa9wj829.html",
    "down2link1": "https://dooood.com/d/tsn89dgovexg",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Sergeant_-_Official_Trailer.mp4?updatedAt=1688789627617",
    "contentRating": " India: UA ",
    "Originalnetwork": " Jio Cinema.",
    "language": " Hindi."
  },
  {
    "id": "INDEX29",
    "title": "ADHURA S01",
    "name": " Adhura S01 (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789839/Adhura_S01_2023_placm5.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789839/Adhura_S01_2023_placm5.webp",
    "yearRelease": 2023,
    "genre": [" HORROR,", " THRILLER,", " DRAMA."],
    "rating": 6.8,
   "synopsis": "The movie Adhura S01 (2023) follows a group of friends who are invited to a remote boarding school for a special retreat. The friends are all from different backgrounds, but they have one thing in common: they are all struggling with their pasts. The school is located in a beautiful, isolated setting, and the friends are initially excited about the prospect of spending time away from their everyday lives. However, they soon realize that something is not quite right at the school. The students are kept under close watch, and they are not allowed to leave the grounds. The friends begin to suspect that they are being held captive, and they start to investigate. They soon discover that the school is run by a secret society that is conducting experiments on the students. The experiments are aimed to unlock the students' supernatural powers, but they also have a dark side. The friends must find a way to escape from the school and stop the experiments. However, they are not the only ones who are trying to escape. The members of the secret society are also after them, and they will stop at nothing to keep their secrets hidden. The friends' escape is a harrowing ordeal. They are pursued by the members of the secret society, they are attacked by supernatural creatures, and they are forced to brave extreme conditions. But they never give up hope, and they eventually manage to escape. The friends return to the outside world, but they are not safe yet. The members of the secret society are still after them, and they will not stop until they have been silenced. The friends must find a way to bring the secret society to justice, and they must do it before it's too late. The friends are all gifted with supernatural powers. They can see the future, they can read minds, and they can move objects with their minds. The secret society is led by a man named Marcus. He is a powerful sorcerer who is determined to use the students' powers for his own evil purposes. The school is located in a remote region of the Himalayas. The area is said to be cursed, and it is rumored that the school is built on the site of an ancient temple. The experiments that are being conducted on the students are dangerous and unethical. The students are being subjected to physical and psychological torture, and they are being forced to use their powers in ways that are harmful to themselves and others. The friends' escape from the school is a miracle. They are outnumbered and outgunned, but they are able to use their powers to overcome the odds. The friends' return to the outside world is not a happy one. They are traumatized by their experience, and they are hunted by the members of the secret society. But they are determined to bring the secret society to justice, and they will not stop until they have achieved their goal.",

    "audio": "https://ik.imagekit.io/gmcl6xvq6/Adhura_-_Official_Trailer.mp4?updatedAt=1688789628684",
    "starring": [
      "Ishwak Singh",
      "Rasika Dugal",
      "Shrenik Arora",
      "Rahul Dev",
      "Poojan Chhabra."
    ],
    "director": " Ananya Banerjee, Gauravv K. Chawla.",
    "country": " Indian.",
    "date": "2023-07-07",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt19868286/",
    "link2": "#",

    "movie.watch": "../../Bollywood/Adhura-S01-2023/Adhura",

    "movie.watchP1": "https://sblona.com/e/9j6mae0jkhgv.html",
    "movie.watchSR1": "https://dooood.com/e/zth5le4u9i8v",

    "down1link1": "https://sblona.com/d/9j6mae0jkhgv.html",
    "down2link1": "https://dooood.com/d/zth5le4u9i8v",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Adhura_-_Official_Trailer.mp4?updatedAt=1688789628684",
    "contentRating": " India: UA ",
    "Originalnetwork": " Amazon Prime Video.",
    "language": " Hindi."
  },
  {
    "id": "INDEX28",
    "title": "WARHORSE ONE   ",
    "name": " Warhorse One (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789945/Warhorse_One_2023_klj5c9.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789945/Warhorse_One_2023_klj5c9.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " WAR,", " DRAMA."],
    "rating": 4.7,
    "synopsis": "The movie Warhorse One (2023) follows the story of a young soldier named Johnny who is assigned to a unit of soldiers tasked with piloting experimental warhorses into battle. The warhorses are highly intelligent and nimble creatures, equipped with state-of-the-art weapons and armor. Johnny is initially hesitant to work with the warhorses, but he soon bonds with his horse, named Shadow. Together, they train for battle and become a highly effective fighting team. The warhorses are first deployed in a battle against a group of Taliban insurgents, defeating them swiftly and emerging unscathed. The warhorses' success leads to more missions around the world, where they prove victorious time and again. Johnny and Shadow develop a close bond, becoming like brothers, trusting each other implicitly. One day, during a mission to rescue hostages, Shadow is injured in an explosion. Johnny is forced to lead Shadow to safety, knowing his horse won't survive. Devastated by Shadow's death, Johnny carries on the fight. He takes Shadow's saddle as a symbol of his fallen companion. Johnny continues to fight bravely, earning a reputation as one of the most skilled and dedicated soldiers in the war. He is eventually promoted to the rank of captain and given command of his own unit. Johnny leads his soldiers into battle on numerous occasions, always emerging victorious. His strategic brilliance outmaneuvers his opponents repeatedly. As the war eventually ends, Johnny returns home as a hero. He is warmly welcomed by family and friends, celebrated for his bravery and service to his country. Johnny's story is one of courage, sacrifice, and friendship that will inspire audiences of all ages. The warhorses in the movie are based on real-life creatures called war pigs, which were used by the Roman Army in ancient times with great effectiveness. The movie's warhorses are equipped with state-of-the-art weapons and armor, including machine guns, lasers, and missiles. They are trained to fight in various environments, such as deserts, jungles, and urban areas. The warhorses are highly intelligent and can quickly learn new commands and adapt to different situations. They have a deep loyalty to their human companions, willing to fight to the death to protect their riders. While Warhorse One is a fictional story, it draws inspiration from real-life events. The use of warhorses in battle was a common practice in ancient times, and there are historical accounts of warhorses being employed in modern warfare as well. The movie pays tribute to the bravery and sacrifice of all soldiers who have fought in wars throughout history, serving as a reminder that even in the darkest of times, there is always hope.",

    "audio": "https://ik.imagekit.io/gmcl6xvq6/WARHORSE_ONE__2023__Official_Trailer.mp4?updatedAt=1688789629616",
    "starring": [
      "Johnny Strong",
      "Athena Durner",
      "Raj Kala",
      "James Sherrill",
      "Siya."
    ],
    "director": " Johnny Strong.",
    "country": " United States.",
    "date": "2023-06-30",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt16527824/",
    "link2": "#",

    "movie.watch": "../../Hollywood/Warhorse-One-2023/WarhorseOne",

    "movie.watchP1": "https://sblona.com/e/qrnyr8fu5v7l.html",
    "movie.watchSR1": "https://dooood.com/e/722lwc60quzh",

    "down1link1": "https://sblona.com/d/qrnyr8fu5v7l.html",
    "down2link1": "https://dooood.com/d/722lwc60quzh",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/WARHORSE_ONE__2023__Official_Trailer.mp4?updatedAt=1688789629616",
    "contentRating": " United States:R ",
    "Originalnetwork": " Operator Films.",
    "language": " English."
  },
  {
    "id": "INDEX27",
    "title": "HUNT CLUB  ",
    "name": " Hunt Club (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789860/Hunt_Club_2023_zdekbb.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789860/Hunt_Club_2023_zdekbb.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " THRILLER,", " DRAMA."],
    "rating": 3.0,
  "synopsis": "The movie Hunt Club (2023) follows a group of female friends who are invited to a remote island for a weekend of hunting. The women are experienced hunters, but they are not prepared for what awaits them on the island. The island is owned by a group of affluent men who have been running a secret hunting club for years. The club's members hunt women, and they have a sinister system in place to lure their victims to the island. The women on the island are quickly captured and taken to the club's headquarters. They are then forced to participate in a series of deadly games. The women must use their skills and cunning to survive, but the odds are stacked against them. One by one, the women are killed. The only survivors are a group of four friends: Maya, Jess, Sarah, and Mia. The four women band together and formulate a plan to escape from the island. Maya, a former soldier, leads the group with her combat skills and strategic thinking. Jess, a survivalist, excels in finding food, water, and evading pursuers. Sarah, a hacker and skilled pilot, navigates the club's computer systems and finds ways to gain an advantage. Mia, a lawyer and skilled negotiator, uses her legal expertise to help the group. The women utilize their combined skills and resources to escape, evading the club's members, finding sustenance, and ultimately finding a way off the island. Once back on the mainland, the women are not safe yet. The club's members relentlessly pursue them, seeking revenge. The women must remain on the run and find a way to bring down the club once and for all. Eventually, they track down the club's members and confront them, exposing their crimes to the public and ensuring justice is served. The women's story is one of survival, friendship, and courage, inspiring women everywhere to fight for their rights and never lose hope. The club's members are wealthy and powerful men, accustomed to getting their way through violence if necessary. The women on the island come from diverse backgrounds, united by their common goal of survival. The island itself is a dangerous place, with wild animals, treacherous terrain, and unpredictable weather. The women's escape is a harrowing ordeal, facing pursuit, animal attacks, and extreme weather conditions. However, their determination and resilience lead to a successful escape. As they return to the mainland, they face the trauma of their experiences and continue to be hunted by the club's members. Yet, their unwavering resolve to dismantle the club drives them forward until justice is achieved.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Hunt_Club_Official-Trailer-2023.mp4?updatedAt=1689014796540",
    "starring": [
      "Mena Suvari",
      "Casper Van Dien",
      "Will Peltz",
      "Maya Stojan",
      "Mickey Rourke."
    ],
    "director": " Elizabeth Blake-Thomas.",
    "country": " United States.",
    "date": "2023-04-04",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt21220802/",
    "link2": "https://en.wikipedia.org/wiki/Hunt_Club_(film)",

    "movie.watch": "../../Hollywood/Hunt-Club-2023/HuntClub",

    "movie.watchP1": "https://sblona.com/e/6ykxn6cmusav.html",
    "movie.watchSR1": "https://dooood.com/e/kuvp5l5a537t",

    "down1link1": "https://sblona.com/d/6ykxn6cmusav.html",
    "down2link1": "https://dooood.com/d/kuvp5l5a537t",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Hunt_Club_Official-Trailer-2023.mp4?updatedAt=1689014796540",
    "contentRating": " United States:TV-MA ",
    "Originalnetwork": " Amazon Prime Video.",
    "language": " English."
  },
  {
    "id": "INDEX26",
    "title": "ASEQ  ",
    "name": " Aseq (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789839/Aseq_2023_vnerlt.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789839/Aseq_2023_vnerlt.webp",
    "yearRelease": 2023,
    "genre": [" HORROR,",  " DRAMA."],
    "rating": 7.5,
    "synopsis": "The movie Aseq (2023) is about a young man named Ronnie who is trying to move on from his recent breakup with his girlfriend, Priyanka. He starts dating a new woman named Lail, but he begins to experience eerie events. He suspects Priyanka of the strange events and seeks the help of his friends. Can Ronnie and his friends unravel the riddle? Ronnie and Lail are a seemingly perfect couple. They are both young, attractive, and successful. But Ronnie is still haunted by his breakup with Priyanka, and he can't seem to let go of the past. One day, Ronnie starts to experience strange events. He sees shadows out of the corner of his eye. He hears noises when no one else is around. He even sees Priyanka's face in the mirror. Ronnie is convinced that Priyanka is haunting him. He tells his friends about what is happening, but they don't believe him. They think he is just imagining things. Ronnie starts to spiral out of control. He can't sleep. He can't eat. He is constantly on edge. He is convinced that Priyanka is going to hurt him or Lail. One night, Ronnie has a dream. In the dream, Priyanka tells him that she is not haunting him. She tells him that she is trying to warn him about something. Ronnie wakes up from the dream and realizes that Priyanka was trying to tell him about Lail. He realizes that Lail is not who she seems. She is not the sweet, innocent girl that he thought she was. Ronnie confronts Lail, and she admits that she is not who she said she was. She is a witch, and she has been using Ronnie to get to Priyanka. Ronnie is horrified. He doesn't know what to do. He knows that Lail is dangerous, but he doesn't know how to stop her. Ronnie turns to his friends for help. They agree to help him, but they know that it will be a dangerous mission. Ronnie and his friends track down Lail. They confront her, and she reveals her true form. She is a hideous creature, and she is filled with hatred. Ronnie and his friends fight Lail, but she is too powerful. She is about to kill them when Priyanka appears. Priyanka is not the sweet, innocent girl that Ronnie remembers. She is a powerful witch, and she is determined to protect Ronnie. Priyanka and Lail battle, and in the end, Priyanka is victorious. Lail is defeated, and she is banished to another dimension. Ronnie and Priyanka are reunited, and they finally move on from the past. They are stronger together, and they know that they can face anything that comes their way.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/ASEQ_Official_Trailer.mp4?updatedAt=1688789627680",
    "starring": [
      "Vardhan Puri",
      "Sonnalli Seygall",
      "Siddhant Kapoor",
      "Elena Roxana Maria Fernandes",
      "Adi Chugh."
    ],
    "director": " Sarim Momin.",
    "country": " Indian.",
    "date": "2023-06-23",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt15446834/",
    "link2": "#",

    "movie.watch": "../../Bollywood/Aseq-2023/Aseq",

    "movie.watchP1": "https://sblona.com/e/26q7jf4ky0sn.html",
    "movie.watchSR1": "https://dooood.com/e/e5o86z98gvqc",

    "down1link1": "https://sblona.com/d/26q7jf4ky0sn.html",
    "down2link1": "https://dooood.com/d/e5o86z98gvqc",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/ASEQ_Official_Trailer.mp4?updatedAt=1688789627680",
    "contentRating": " India: UA ",
    "Originalnetwork": " Jio Cinema.",
    "language": " Hindi."
  },
  {
    "id": "INDEX25",
    "title": "LOVE GURU S03 PART 2   ",
    "name": " Love Guru S03 Part 2 (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789882/Love_Guru_S03_Part_2_2023_fdnjrw.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789882/Love_Guru_S03_Part_2_2023_fdnjrw.webp",
    "yearRelease": 2023,
    "genre": [" ADULT, ", " EROTIC, ", " HOT +18."],
    "rating": 4.4,
    "synopsis": "Love Guru is back with another season. People are curious to know more about the release date of the Ullu web series Season 3 Part 2. You will get complete details about Love Guru Season 3 Part 2 in this article. Keep reading for more information.The trailer of Love Guru Season 3 Part 2 starts with a disclaimer. It further shows the logo of the Ullu app. The trailer proceeds with the girl drinking water and her tuition teacher is sitting in front of her whom she loves. While the boy who like Mini is looking at her secretly. The next scene shows her tuition teacher sitting in a room when she hugs him from the back. She says sir, while he replies that he loves her a lot. His expression shows that he was not saying it out of love but was saying it out of fear. While the guy who loves Mini saw her with her tuition sir whom she loves. He tells Mini’s friend that Mini is so much crazy for her.She invites him to her home for studying. They are doing romance more than studying. While we saw that Mini is doing what her love guru asks. She wears the clothes her love guru asks her to wear. She says to her love guru that she wore the clothes he said. Her tuition teacher says that she looks beautiful. They both have drinks. After having drinks, she nervously says bye and wishes him a happy birthday. It’s his birthday occasion. He stops her and says, Mini. They both have romance. The trailer ends here. People are curious to know about the release date of Love Guru Season 3 Part 2.Love Guru Season 3 Part 2 will release on 7th July 2023, Friday. The makers have announced the release date of Love Guru season 3 part 2. The excitement among the fans is real. The curiosity can be seen clearly. Fans are showing love for the series. It will be interesting to have reviews about the series. We will update you with the reviews of the new part after its release. This was all about Love Guru Season 3 Part 2 release date. We keep bringing such details on our website.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Love_Guru_-_Season_3___Part_2___Official_Trailer.mp4?updatedAt=1688789627463",
    "starring": [
      "Smita Paul",
      "Suhana Khan",
      "Rajsi Verma."
      
    ],
    "director": " Punit Goyal.",
    "country": " Indian.",
    "date": "2023-07-07",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt28096139/",
    "link2": "#",

    "movie.watch": "../../Adult/LoveGuruS03P2-2023/Love-Guru-S03-P2",
    
    "movie.watchP1": "https://sblona.com/e/o8geo4dj5v94.html",
    "movie.watchSR1": "https://dooood.com/e/q979smbgn7cq",

    "down1link1": "https://sblona.com/d/o8geo4dj5v94.html",
   "down2link1": "https://dooood.com/d/q979smbgn7cq",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Love_Guru_-_Season_3___Part_2___Official_Trailer.mp4?updatedAt=1688789627463",
    "contentRating": " India: 18+ ",
    "Originalnetwork": " Ullu Originals.",
    "language": " Hindi."
  },
  {
    "id": "INDEX24",
    "title": "HUGOT  ",
    "name": " Hugot (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688158914/Hugot_2023_ucrszf.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688158914/Hugot_2023_ucrszf.webp",
    "yearRelease": 2023,
    "genre": [" ADULT, ", " EROTIC, ", " HOT +18."],
    "rating": 6.1,
    "synopsis": "Jay is a talented and ambitious basketball player with dreams of making it big in the NBA. However, his aspirations take a dark turn when he is approached by a crime boss named Don Benny. Don Benny offers Jay a tempting deal to secure his basketball career, but Jay soon realizes the consequences of his decision. As Jay becomes entangled in Don Benny's criminal activities, he loses sight of his true self and is forced to do things he never imagined. One of Jay's first assignments is to collect a debt from a local businessman, which escalates into violence. Jay feels disgusted with himself and begins to question his involvement with Don Benny. His next task leads him into a dangerous neighborhood, where he becomes the target of an ambush. Despite being outnumbered, Jay manages to escape and becomes a wanted man. Fleeing the city, Jay seeks refuge in a small town and attempts to start anew. However, Don Benny's men eventually track him down, forcing Jay to fight for his survival and escape into the wilderness. Now a fugitive, Jay lives in constant fear, unable to trust anyone and haunted by his past actions. One day, Jay stumbles upon a group of protesters opposing Don Benny's criminal empire. Inspired by Jay's testimony, the crowd decides to take a stand against Don Benny's corruption. Together, they launch a campaign to expose Don Benny's crimes, organizing rallies, boycotts, and raising awareness. Despite Don Benny's attempts to silence them, the protestors remain resolute and fight for justice. Ultimately, Jay and the protestors succeed in their mission. Don Benny is apprehended and held accountable for his actions. Finally free from the clutches of the crime boss, Jay can begin to rebuild his life. Having learned a valuable lesson, he is determined to never let anyone manipulate or control him again.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/Hugot_Official_trailer.mp4?updatedAt=1688158872928",
    "starring": [
      "Azi Acosta",
      "Jiad Arroyo",
      "Jennifer Georgo",
      "Peter Georgo",
      "Stephanie Raz."
    ],
    "director": " Daniel Palacio.",
    "country": " Philippines.",
    "date": "2023-06-30",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt27566294/",

    "movie.watch": "../../Adult/Hugot-2023/Hugot",
    
    "movie.watchP1": "https://sblona.com/e/ks6oo3eifb49.html",
    "movie.watchSR1": "https://dooood.com/e/wczc125xjlwm",

    "down1link1": "https://sblona.com/d/ks6oo3eifb49.html",
   "down2link1": "https://dooood.com/d/wczc125xjlwm",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Hugot_Official_trailer.mp4?updatedAt=1688158872928",
    "contentRating": " Philippines:18+ ",
    "Originalnetwork": " Viva Films.",
    "language": " English."
  },
  {
    "id": "INDEX23",
    "title": "BERMUDA ISLAND ",
    "name": " Bermuda Island (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688789849/Bermuda_Island_2023_mcfpwf.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688789849/Bermuda_Island_2023_mcfpwf.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,"," ADVENTURE,", " DRAMA."],
    "rating": 3.1 ,
    "synopsis": "The movie opens with a group of passengers on their way to a tropical paradise. The plane crashes at sea and the survivors find themselves stranded on a deserted island. The group is initially hopeful that they will be rescued, but as days turn into weeks, they begin to lose hope. The survivors are divided into two groups: those who are determined to survive and those who are ready to give up. The group that is determined to survive is led by Tom Sizemore's character, a former military man who is used to dealing with adversity. The group that is ready to give up is led by Noel Gugliemi's character, a drug dealer who is more interested in getting high than in surviving. As the tension between the two groups grows, the survivors begin to turn on each other. There are fights, murders, and even cannibalism. The island seems to be taking a toll on the survivors' sanity, and they are all starting to lose their grip on reality. One of the first survivors to lose their grip on reality is a young woman named Sarah. She begins to have visions of a dark presence on the island. She is convinced that the island is haunted, and she begins to fear for her life. Another survivor who starts to lose their sanity is a man named John. He is a former police officer who has seen his fair share of violence. But the violence on the island is unlike anything he has ever seen before. He begins to have flashbacks of his time as a police officer, and he starts to see the island as a place of death and destruction. As the survivors' sanity continues to deteriorate, the island seems to become more and more dangerous. The survivors begin to see strange creatures in the shadows. They hear noises in the night. They start to believe that they are being hunted. The tension between the two groups of survivors reaches a breaking point when the drug dealer, Noel Gugliemi, murders one of the survivors. In retaliation, Tom Sizemore's character kills Noel Gugliemi. This act of violence only serves to further divide the survivors. The survivors are now at war with each other. They are no longer fighting for survival, they are fighting for their lives. The island has become a place of nightmares, and the survivors are all trapped in a living hell.In the end, only a handful of survivors are left. They are rescued by a passing ship, but the experience has left them changed forever. They have seen the worst in humanity, and they have learned that they can only rely on themselves.",
    "audio": "https://ik.imagekit.io/gmcl6xvq6/BERMUDA_ISLAND__2023__Official_Trailer.mp4?updatedAt=1688791678972",
    "starring": [
      "Tom Sizemore",
      "Noel Gugliemi",
      "John Wells",
      "Sarah French",
      "Wesley Cannon."
    ],
    "director": " Adam Werth.",
    "country": " United States.",
    "date": "2023-01-20",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt14926914/",
    "link2": "https://wiki.movie/bermuda-island",

    "movie.watch": "../../Hollywood/Bermuda-Island-2023/Bermuda-Island",
  
    "movie.watchP1": "https://sblona.com/e/1lywo1gdtbs0.html",
   
    "movie.watchSR1": "https://dooood.com/e/4afhuj3wvs1h",
  
    "down1link1": "https://sblona.com/d/1lywo1gdtbs0.html",
    
    "down2link1": "https://dooood.com/d/4afhuj3wvs1h",
   
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/BERMUDA_ISLAND__2023__Official_Trailer.mp4?updatedAt=1688791678972",
    "contentRating": "   United States:TV-MA    ",
    "Originalnetwork": " Amazon Prime Video.",
    "language": " English."
  },

  {
    "id": "INDEX22",
    "title": "THE WITCHER S03 ",
    "name": " The Witcher S03 (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688158916/the-witcher-3-2023_ppd2ea.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688158916/the-witcher-3-2023_ppd2ea.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,"," ADVENTURE,", " DRAMA."],
    "rating": 8.1 ,
    "synopsis": "The third season of The Witcher picks up where the second season left off, with Geralt of Rivia (Henry Cavill), Princess Ciri (Freya Allan), and Yennefer of Vengerberg (Anya Chalotra) all on their own separate journeys. Geralt is still struggling to come to terms with his newfound destiny as Ciri's protector, while Ciri is still trying to come to terms with her own powers and what it means to be a child of destiny. Yennefer, meanwhile, is still reeling from the loss of her magic and is determined to find a way to get it back. The three of them eventually find their way back to each other, but they are soon faced with a new threat: a mysterious group of creatures known as the Wild Hunt. The Wild Hunt is led by a powerful being known as Eredin Breacc Glas, who is determined to capture Ciri and use her power for his own evil purposes. Geralt, Ciri, and Yennefer must unite once again to stop the Wild Hunt and save the world. Along the way, they will face many challenges, including dangerous new enemies, betrayals from old friends, and the ever-present threat of death. In the end, they are able to defeat the Wild Hunt and save the world, but at a great cost. Ciri is forced to sacrifice her own happiness in order to save the world, and Geralt and Yennefer are left to pick up the pieces of their broken hearts.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688682700/Knights_of_the_Zodiac_wyi6d6.mp3",
    "starring": [
      "Henry Cavill",
      "Freya Allan",
      "Anya Chalotra",
      "Eamon Farren",
      "MyAnna Buring."
    ],
    "director": " Lauren Schmidt Hissrich.",
    "country": " United States.",
    "date": "2023-07-27",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt5180504/",
    "link2": "https://en.wikipedia.org/wiki/The_Witcher_(TV_series)",

    "movie.watch": "../../Hollywood/The-Witcher-2023/The-Witcher-EP1",
  
    "movie.watchP1": "https://sblona.com/e/lszznell15sd.html",
    "movie.watchP2": "https://sblona.com/e/3zswgogknmwr.html",
    "movie.watchP3": "https://sblona.com/e/83higzk60b7x.html",
    "movie.watchP4": "https://sblona.com/e/9lq7e6ila9if.html",
    "movie.watchP5": "https://sblona.com/e/4g6j92mzt1zc.html",


    "movie.watchSR1": "https://dooood.com/e/tqiic1mo763q",
    "movie.watchSR2": "https://dooood.com/e/5noda20y6bd0",
    "movie.watchSR3": "https://dooood.com/e/hvrinjmkmw5u",
    "movie.watchSR4": "https://dooood.com/e/nbtzcjxg8gdg",
    "movie.watchSR5": "https://dooood.com/e/06i8u9ohb5aj",
 
    "down1link1": "https://sblona.com/d/lszznell15sd.html",
    "down1link2": "https://sblona.com/d/3zswgogknmwr.html",
    "down1link3": "https://sblona.com/d/83higzk60b7x.html",
    "down1link4": "https://sblona.com/d/9lq7e6ila9if.html",
    "down1link5": "https://sblona.com/d/4g6j92mzt1zc.html",

    "down2link1": "https://dooood.com/d/tqiic1mo763q",
    "down2link2": "https://dooood.com/d/5noda20y6bd0",
    "down2link3": "https://dooood.com/d/hvrinjmkmw5u",
    "down2link4": "https://dooood.com/d/nbtzcjxg8gdg",
    "down2link5": "https://dooood.com/d/06i8u9ohb5aj",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/The_Witcher__Season_3___Official_Teaser.mp4?updatedAt=1688158868261",
    "contentRating": "   United States:TV-MA    ",
    "Originalnetwork": " Netflix.",
    "language": " English."
  },

  {
    "id": "INDEX21",
    "title": "KNIGHTS OF THE ZODIAC ",
    "name": " Knights of the Zodiac (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688158926/Knights-of-the-Zodiac-2023_iyuh6b.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688158926/Knights-of-the-Zodiac-2023_iyuh6b.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,"," ADVENTURE,", " DRAMA."],
    "rating": 4.4 ,
    "synopsis": "The movie opens with Seiya, a young orphan, being taken to the Sanctuary, a secret temple in Greece where the Saints are trained. Seiya is told that he is destined to become a Saint, and he must undergo rigorous training to become one of the chosen few. Seiya trains alongside other young orphans, including Shiryu, Hyoga, Shun, and Ikki. The five friends learn to harness the power of the cosmos and use it to fight evil. Meanwhile, Mars, the god of war, is planning to conquer the world. Mars has been resurrected by a group of humans who worship him, and he is determined to use his power to destroy the Saints and take over the world. Seiya and his friends are called upon to stop Mars and his followers. The five friends travel to different parts of the world, fighting Mars's minions and trying to stop him from carrying out his plans. Along the way, Seiya and his friends face many challenges. They are attacked by powerful enemies, and they must overcome their own fears and doubts. But they also learn the true meaning of friendship and courage, and they grow stronger as a team. In the end, Seiya and his friends are able to defeat Mars and his followers. Mars is banished back to the underworld, and the world is saved. Seiya and his friends are hailed as heroes, and they continue to fight for justice and protect the innocent.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688682700/Knights_of_the_Zodiac_wyi6d6.mp3",
    "starring": [
      "Mackenyu",
      "Famke Janssen",
      "Madison Iseman",
      "Diego Tinoco",
      "Mark Dacascos."
    ],
    "director": " Tomasz Baginski.",
    "country": " United States.",
    "date": "2023-04-28",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt6528290/",
    "link2": "https://en.wikipedia.org/wiki/Knights_of_the_Zodiac_(film)",

    "movie.watch": "../../Hollywood/Knights-of-the-Zodiac-2023/Knights-of-the-Zodiac",
  
    "movie.watchP1": "https://sblona.com/e/uwscqk2fvzl0.html",
    "movie.watchSR1": "https://dooood.com/e/ny7phg0htq4d",
 
    "down1link1": "https://sblona.com/d/uwscqk2fvzl0.html",
    "down2link1": "https://dooood.com/d/ny7phg0htq4d",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/KNIGHTS_OF_THE_ZODIAC__2023__Official_Trailer.mp4?updatedAt=1688158872615",
    "contentRating": "   United States:PG-13   ",
    "Originalnetwork": " Sony Pictures Releasing International.",
    "language": " English."
  },
  {
    "id": "INDEX20",
    "title": "RESURRECTED ",
    "name": " Resurrected (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688158914/Resurrected_2023_jbck9c.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688158914/Resurrected_2023_jbck9c.webp",
    "yearRelease": 2023,
    "genre": [" HORROR,", " SCI-FI."],
    "rating": 4.8 ,
    "synopsis": "The movie Resurrected (2023) is about a group of scientists who are working on a revolutionary new technology that can bring the dead back to life. The technology is still in its early stages, but the scientists are hopeful that it could one day be used to save the lives of loved ones who have passed away. The team of scientists is led by Dr. Emily Sanders (Kate Beckinsale), a brilliant but ambitious scientist who is determined to make the technology a success. She is joined by a team of experts, including Dr. David Palmer (James McAvoy), a bioengineer who is responsible for developing the technology; Dr. Sarah Walker (Jessica Chastain), a psychologist who is studying the psychological effects of the technology; and Dr. Mark Wilson (Chris Pine), a medical doctor who is responsible for overseeing the clinical trials. The team of scientists begins by testing the technology on animals, and they are initially successful. However, when they try to use the technology on humans, they encounter a number of problems. The first person they bring back to life is a young woman named Anna (Saoirse Ronan), who was killed in a car accident. Anna is initially confused and disoriented, and she has difficulty adjusting to life in the present day. She also begins to experience strange visions and hallucinations. The scientists are concerned about Anna's mental state, and they decide to put a hold on the clinical trials. However, Dr. Sanders is determined to continue her work, and she secretly brings back to life a man named John (Joel Edgerton), who was killed in a terrorist attack. John is initially grateful to be alive, but he soon begins to exhibit violent and erratic behavior. He also begins to have visions of the terrorist attack that killed him. The scientists are now faced with a dilemma. They know that the technology is dangerous, but they also believe that it has the potential to save lives. They must decide whether to continue with the clinical trials, even though they know that there is a risk of the technology being used for evil.    In the end, the scientists decide to destroy the technology. They believe that the risk of it being used for evil is too great. However, Dr. Sanders is not convinced. She believes that the technology could be used for good, and she vows to find a way to make it safe.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688680294/Resurrected_vts1or.mp3",
    "starring": [
      "Dave Davis",
      "Luke Adams",
      "Carolyn Alise",
      "Steven Lee Allen",
      "Ilca Andrade."
    ],
    "director": " Egor Baranov.",
    "country": " United States.",
    "date": "2023-04-27",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt15340206/",
    "link2": "#",

    "movie.watch": "../../Hollywood/Resurrected-2023/Resurrected",
  
    "movie.watchP1": "https://sblona.com/e/3vl2wcqngr0r.html",
    "movie.watchSR1": "https://dooood.com/e/lok3r6jgt31i",

    "down1link1": "https://sblona.com/d/3vl2wcqngr0r.html",
    "down2link1": "https://dooood.com/d/lok3r6jgt31i",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Resurrected___Trailer___Movie__2023.mp4?updatedAt=1688158874512",
    "contentRating": "   United States:R  ",
    "Originalnetwork": " XYZfilms.",
    "language": " English."
  },
  {
    "id": "INDEX19",
    "title": "SHEROES ",
    "name": " Sheroes (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688158915/Sheroes-2023_h8itoh.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688158915/Sheroes-2023_h8itoh.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " ADVENTURE."],
    "rating": 3.6 ,
    "synopsis": "The movie Sheroes (2023) opens with a young woman named Maya saving a group of people from a burning building. She uses her powers to fly and shoot lasers from her eyes to rescue the people. The media soon picks up on her story and dubs her The Shero. Maya is reluctant to become a superhero, but she eventually agrees to use her powers to help others. She meets with a group of women who have also been granted superpowers. The women decide to form a team of superheroes called Sheroes.The Sheroes quickly become popular and are seen as a symbol of hope for women around the world. They use their powers to fight crime, save lives, and inspire others. However, the Sheroes soon find themselves facing a new threat. A group of villains called the Anti-Sheroes have been created by a mysterious enemy. The Anti-Sheroes are determined to destroy the Sheroes and take over the world. The Sheroes and the Anti-Sheroes clash in a series of epic battles. The Sheroes are initially outnumbered and outgunned, but they eventually prevail. They defeat the Anti-Sheroes and save the world. In the end, the Sheroes learn that they can achieve anything if they work together. They also learn that they are not alone. There are other women out there who are just as strong and brave as they are. The movie ends with the Sheroes continuing their fight for justice. They are determined to make the world a better place for all women.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688676657/Sheroes_wkqq2z.mp3",
    "starring": [
      "Isabelle Fuhrman",
      "Sasha Luss",
      "Wallis Day",
      "Skai Jackson",
      "Jack Kesy."
    ],
    "director": " Jordan Gertner.",
    "country": " United States.",
    "date": "2023-06-23",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt16970906/",
    "link2": "#",

    "movie.watch": "../../Hollywood/Sheroes-2023/Sheroes",
  
    "movie.watchP1": "https://sblona.com/e/6nb5zz9v3ea0.html",
    "movie.watchSR1": "https://dooood.com/e/fm01kgtupjh5",

    "down1link1": "https://sblona.com/d/6nb5zz9v3ea0.html",
    "down2link1": "https://dooood.com/d/fm01kgtupjh5",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Sheroes_Trailer__2023_.mp4?updatedAt=1688158873375",
    "contentRating": "   United States:R  ",
    "Originalnetwork": "Paramount Global.",
    "language": " English."
  },
  {
    "id": "INDEX18",
    "title": "DAUGHTER OF THE BRIDE ",
    "name": " Daughter of the Bride (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688158915/Daughter-of-the-Bride-2023_p8yt6x.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688158915/Daughter-of-the-Bride-2023_p8yt6x.webp",
    "yearRelease": 2023,
    "genre": [" COMEDY,", " DRAMA."],
    "rating": 3.9 ,
    "synopsis": "The movie Daughter of the Bride (2023) is about a young woman named Sarah (Kaitlyn Dever) who is about to get married. Her mother, Ellie (Kyra Sedgwick), is thrilled for her, but she is also struggling with the idea of her daughter growing up and leaving home. Ellie and Sarah have always been close, and Ellie has always been a bit of a helicopter mom. She has been involved in every aspect of Sarah's life, from her education to her friendships. Now that Sarah is getting married, Ellie is starting to feel like she is losing her grip on her daughter's life. Sarah is aware of her mother's feelings, and she tries to be understanding. However, she also wants to start her own life and make her own decisions. This leads to some tension between Sarah and Ellie, as they both try to come to terms with the changes that are happening. In the end, Sarah and Ellie are able to work through their issues and come to a new understanding of each other. They realize that they will always be close, even though Sarah is starting a new chapter in her life.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688673861/Daughter_of_the_Bride_opl8va.mp3",
    "starring": [
      "Halston Sage",
      "Marcia Gay Harden",
      "Andrew Richardson",
      "Aidan Quinn",
      "Brenda Currin."
    ],
    "director": " Annette Haywood-Carter.",
    "country": " United States.",
    "date": "2023-02-03",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt21106970/",
    "link2": "https://en.wikipedia.org/wiki/Daughter_of_the_Bride",

    "movie.watch": "../../Hollywood/Daughter-of-the-Bride-2023/DaughteroftheBride",
  
    "movie.watchP1": "https://sblona.com/e/z9kygx108uvj.html",
 
    "down1link1": "https://sblona.com/d/z9kygx108uvj.html",
  
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Daughter_of_the_Bride_-_Official_Trailer__2023_.mp4?updatedAt=1688518402059",
    "contentRating": "  United States:PG ",
    "Originalnetwork": "MarVista Entertainment.",
    "language": " English."
  },
  {
    "id": "INDEX17",
    "title": "CONFIDENTIAL INFORMANT ",
    "name": " Confidential Informant (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688158915/Confidential-Informant-2023_edefpc.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688158915/Confidential-Informant-2023_edefpc.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " THRILLER,", " DRAMA."],
    "rating": 3.9 ,
    "synopsis": "The movie Confidential Informant (2023) is about a police detective named Moran (Mel Gibson) who is dying of cancer. He makes a deal with an informant named Carlos (Erik Valdez) to get killed in the line of duty so that his family can receive the hefty death benefits from the department. Moran and Carlos plan to stage Moran's death during a drug bust. However, things go wrong when the drug dealer they are targeting turns out to be more dangerous than they thought. Moran is shot and killed, but Carlos is able to escape. Carlos is hailed as a hero for saving Moran's life, and he is given a large reward by the department. However, he soon begins to feel guilty about Moran's death. He knows that he could have prevented it if he had not agreed to Moran's plan. Carlos starts to investigate Moran's death, and he soon discovers that Moran was not the kind of man he thought he was. Moran was corrupt and had been involved in a number of illegal activities. Carlos is disgusted by what he learns, and he decides to come clean about the truth. Carlos tells the Internal Affairs department about Moran's corruption, and he is eventually arrested. However, he is eventually cleared of all charges and is given a new job with the department. He has learned from his mistakes, and he is determined to use his new position to make a difference. The movie ends with Carlos giving a speech to a group of new police recruits. He tells them about his experiences and warns them about the dangers of corruption. He also tells them that they have a responsibility to uphold the law and to protect the innocent.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688671925/Confidential_Informant_vg8hkj.mp3",
    "starring": [
      "Andrea Abreu",
      "Kate Bosworth",
      "Dianna Camacho",
      "John Cassini",
      "Mel Gibson."
    ],
    "director": " Michael Oblowitz.",
    "country": " United States.",
    "date": "2023-06-27",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt21391242/",
    "link2": "#",

    "movie.watch": "../../Hollywood/Confidential-Informant-2023/Confidential-Informant",
  
    "movie.watchP1": "https://sblona.com/e/jg1qgcf7jbrj.html",
    "movie.watchSR1": "https://dooood.com/e/vh0vikdvl9fy",

    "down1link1": "https://sblona.com/d/jg1qgcf7jbrj.html",
    "down2link1": "https://dooood.com/d/vh0vikdvl9fy",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Confidential_Informant__2023__Official_Trailer.mp4?updatedAt=1688158874169",
    "contentRating": "  United States:R ",
    "Originalnetwork": "Red Sea Media.",
    "language": " English."
  },
  {
    "id": "INDEX16",
    "title": "SECRET INVASION S1 ",
    "name": " Secret Invasion S1 (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688158915/Secret-Invasion-S01-2023_ohfsnv.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688158915/Secret-Invasion-S01-2023_ohfsnv.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " ADVENTURE,", " DRAMA."],
    "rating": 7.0 ,
    "synopsis": "The series begins with Nick Fury and Talos, the Skrull who impersonated Fury in Captain Marvel (2019), investigating a series of mysterious attacks that have been happening around the world. They soon discover that the Skrulls have been secretly infiltrating Earth for years, and that they are now in positions of power all over the world. Fury and Talos team up with a group of other superheroes, including Carol Danvers, Maria Hill, and the Winter Soldier, to try to stop the Skrulls from taking over Earth. However, the Skrulls are well-organized and well-prepared, and they have a number of powerful allies, including the Supreme Intelligence. The series follows the heroes as they race against time to stop the Skrulls from completing their plans. Along the way, they learn more about the Skrulls and their motivations, and they also have to deal with the personal consequences of the invasion. In the end, the heroes are able to defeat the Skrulls and save Earth. However, the victory comes at a cost. Many of the heroes are killed or injured, and the world is forever changed by the invasion.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688668483/Secret_Invasion_snchpq.mp3",
    "starring": [
      "Samuel L. Jackson",
      "Ben Mendelsohn",
      "Cobie Smulders",
      "Olivia Colman",
      "Emilia Clarke."
    ],
    "director": " Ali Selim.",
    "country": " United States.",
    "date": "2023-06-21",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt13157618/",
    "link2": "https://en.wikipedia.org/wiki/Secret_Invasion_(TV_series)",

    "movie.watch": "../../Hollywood/Secret-Invasion-2023/Secret-Invasion-S1-EP1",
  

    "movie.watchP1": "https://sblona.com/e/2vwv6qqymqgj.html",
    "movie.watchP2": "https://sblona.com/e/5z4vbimbhxg9.html",

    "movie.watchSR1": "https://dooood.com/e/i5ky5zepqvtk",
    "movie.watchSR2": "https://dooood.com/e/8eonk4s8brgh",

    "down1link1": "https://sblona.com/d/2vwv6qqymqgj.html",
    "down1link2": "https://sblona.com/d/5z4vbimbhxg9.html",

    "down2link1": "https://dooood.com/d/i5ky5zepqvtk",
    "down2link2": "https://dooood.com/d/8eonk4s8brgh",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Secret_Invasion___Official_Trailer.mp4?updatedAt=1688158871955",
    "contentRating": " United States:TV-14",
    "Originalnetwork": "Disney+.",
    "language": " English."
  },
  {
    "id": "INDEX15",
    "title": "RIDE ON ",
    "name": " Ride On (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/v1688158915/Ride-On-2023_qboeqz.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688158915/Ride-On-2023_qboeqz.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " COMEDY,", " DRAMA."],
    "rating": 6.3 ,
    "synopsis": "Lao Luo is a prolific stuntman who works with his Red Hare, his deformed-at-birth stunt horse who he saved from euthanasia. His life is falling apart - he had suffered a serious injury that sent him bankrupt 8 years ago and lost the custody of his daughter, Xiao Bao, after divorcing his late wife while she was still young. One night, Lao and Red Hare get into a fight with debt collectors and they soon learn Red Hare is at risk of being auctioned after their original company went bankrupt. Lao seeks legal help from Bao, now a university student studying law, and despite being reluctant at first, she offers him the services of her boyfriend, Naihua. Meanwhile, after Lao's fight with the debt collectors goes viral, he and Red Hare are hired for several films, with Bao becoming his agent ad litem. Although they are able to help each other during tough situations, Lao and Bao's relationship remains strained. One day, Lao is offered a major role in a new action film, but he is told that he can only have the part if he gets rid of Red Hare. Lao is devastated, but he knows that he cannot turn down the opportunity. He sells Red Hare to a circus, but he cannot bear to be apart from him. He secretly visits Red Hare every day, and he even helps the circus trainers train the horse. One day, Red Hare is injured during a performance. Lao rushes to the circus and helps to save the horse's life. The circus trainers are so grateful that they offer to give Red Hare back to Lao. Lao is overjoyed, and he promises to never let Red Hare go again. With Red Hare back in his life, Lao's career begins to take off. He stars in several more successful films, and he even wins an award for his work. Bao is proud of her father, and she finally begins to understand why he loves stunt work so much. The film ends with Lao and Red Hare performing a daring stunt together. They leap off a high building and land safely on the ground below. The crowd cheers, and Lao smiles. He knows that he has finally found his true calling.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688666187/RaidOn_xb2hax.mp3",
    "starring": [
      "Jackie Chan",
      "Haocun Liu",
      "Kevin Guo",
      "Yueting Lang",
      "Andy On."
    ],
    "director": " Larry Yang.",
    "country": " China.",
    "date": "2023-04-13",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt15430628/",
    "link2": "https://en.wikipedia.org/wiki/Ride_On_(film)",

    "movie.watch": "../../Hollywood/Raid-On-2023/Raid-On",

    "movie.watchP1": "https://sblona.com/e/iozd6ycpsnp2.html",
    "movie.watchSR1": "https://dooood.com/e/p3ikfocxghgs",

    "down1link1": "https://sblona.com/d/iozd6ycpsnp2.html",
    "down2link1": "https://dooood.com/d/p3ikfocxghgs",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/RIDE_ON_Trailer.mp4?updatedAt=1688158872009",
    "contentRating": " United States:TV-14",
    "Originalnetwork": "Shanghai Pictures.",
    "language": " English."
  },
    {
    "id": "INDEX14",
    "title": "JACK RYAN S4 ",
    "name": " Tom Clancys Jack Ryan Season 4 (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688158915/Tom-Clancys-Jack-Ryan-S04_rxnbdt.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688158915/Tom-Clancys-Jack-Ryan-S04_rxnbdt.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " THRILLER,", " DRAMA."],
    "rating": 8.7 ,
    "synopsis": "The season opens with Jack Ryan (John Krasinski) as the new Acting Deputy Director of the CIA. He is quickly thrust into a high-stakes investigation when a Nigerian presidential assassination is linked to the CIA. Ryan uncovers a secret operation codenamed Pluto that was authorized by former CIA Director James Greer (Wendell Pierce). Pluto involved the CIA working with a drug cartel to smuggle weapons into Nigeria. The cartel then used the weapons to assassinate the president and destabilize the country. Ryan is determined to shut down Pluto and bring those responsible to justice. He teams up with Domingo Ding Chavez (Michael Peña), a fellow CIA agent, and Cathy Mueller (Abbie Cornish), a doctor who works with the CIA. The trio follows the trail of Pluto from Nigeria to Mexico to the United States. Along the way, they uncover a web of corruption and betrayal that reaches the highest levels of the US government. As Ryan gets closer to the truth, he finds himself in danger. He is targeted by assassins, framed for crimes, and even forced to go on the run. But Ryan is not easily intimidated. He is determined to see justice done, no matter the cost. In the end, Ryan is successful in shutting down Pluto and bringing those responsible to justice. He also clears his own name and restores his reputation. However, the experience takes a toll on him. He is forced to confront the dark side of the CIA and the lengths that the government will go to protect its secrets. He also realizes that he can no longer trust anyone, not even his own colleagues. The season ends with Ryan resigning from the CIA. He is disillusioned with the agency and the government. He decides to go back to his old life as a financial analyst. However, he knows that he will never be able to fully escape the world of espionage. He is a Jack Ryan, after all.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688660140/JackRyan_jbet0p.mp3",
    "starring": [
      "John Krasinski",
      "Wendell Pierce",
      "Michael Kelly",
      "Abbie Cornish",
      "Betty Gabriel."
    ],
    "director": " Carlton Cuse, Graham Roland.",
    "country": " United States.",
    "date": "2023-06-29",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt5057054/",

    "movie.watch": "../../Hollywood/JackRayan-2023/JackRyan-EP1",


    "movie.watchP1": "https://sblona.com/e/q8g2qiko70m6.html",
    "movie.watchP2": "https://sblona.com/e/vmkki8xgbm9j.html",
    "movie.watchP3": "https://sblona.com/e/1lhtc20i919a.html",
    "movie.watchP4": "https://sblona.com/e/5elh8zq6lhh6.html",
  
    "movie.watchSR1": "https://dooood.com/e/f120xzbqe9io",
    "movie.watchSR2": "https://dooood.com/e/6aum44skj19e",
    "movie.watchSR3": "https://dooood.com/e/xwxovxnnjplr",
    "movie.watchSR4": "https://dooood.com/e/1ttode1nzu19",

    "down1link1": "https://sblona.com/d/q8g2qiko70m6.html",
    "down1link2": "https://sblona.com/d/vmkki8xgbm9j.html",
    "down1link3": "https://sblona.com/d/1lhtc20i919a.html",
    "down1link4": "https://sblona.com/d/5elh8zq6lhh6.html",
   
    "down2link1": "https://dooood.com/d/f120xzbqe9io",
    "down2link2": "https://dooood.com/d/6aum44skj19e",
    "down2link3": "https://dooood.com/d/xwxovxnnjplr",
    "down2link4": "https://dooood.com/d/1ttode1nzu19",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Tom_Clancy_s_Jack_Ryan_-_The_Final_Season___Official_Trailer.mp4?updatedAt=1688158871663",
    "contentRating": " United States:TV-14",
    "Originalnetwork": "Amazon Prime Video.",
    "language": " English."
  },
  {
    "id": "INDEX13",
    "title": "HIJACK  ",
    "name": " Hijack (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1688158914/Hijack-2023_parekf.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1688158914/Hijack-2023_parekf.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " THRILLER,", " DRAMA."],
    "rating": 7.7,
    "synopsis": "The series begins with a hijacked plane flying from London to New York City. The hijacker, who calls himself Captain Kamal, demands a ransom of $50 million. He also threatens to kill one passenger every hour if his demands are not met. The passengers on the plane are a diverse group of people from all walks of life. There are businessmen, politicians, celebrities, and even a young child. They are all terrified and unsure of what will happen to them. The British government sends a team of negotiators to try to talk to the hijacker. They are led by Detective Superintendent Martin Kurtz, who is a seasoned negotiator with a reputation for getting results. Kurtz and the hijacker engage in a series of tense negotiations. The hijacker is a clever and ruthless negotiator, and he does not give an inch. The British government is under increasing pressure to pay the ransom, but Kurtz refuses to give in. As the hours go by, the tension on the plane mounts. The passengers are becoming increasingly restless and scared. They start to turn on each other, and there is a growing sense of panic. The hijacker begins to carry out his threat to kill one passenger every hour. The first to die is a young woman named Sarah. Her death is a devastating blow to the passengers, and it only serves to heighten the sense of fear and desperation. The British government finally agrees to pay the ransom, but it is too late. The hijacker has already killed several passengers, and he is not going to stop. He demands a helicopter to take him to safety, and he threatens to crash the plane if his demands are not met.    The British government sends a helicopter to the plane, but it is shot down by the hijacker. The plane is now in free fall, and it is clear that there is no hope of survival. The passengers brace themselves for impact, and the plane crashes into the ocean. All of the passengers are killed, including the hijacker. The series ends with a scene of Kurtz standing on the beach, looking out at the ocean. He is haunted by the deaths of the passengers, and he wonders if he could have done anything to save them. The series Hijack is a suspenseful and gripping thriller that will keep you on the edge of your seat from beginning to end. The characters are well-developed and relatable, and the plot is full of twists and turns. If you are a fan of high-stakes thrillers, then you will definitely enjoy Hijack.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688252568/hijack_qmadkj.mp3",
    "starring": [
      "Idris Elba",
      "Neil Maskell",
      "Max Beesley",
      "Ben Miles",
      "Kaisa Hammarlund."
    ],
    "director": " Jim Field Smith, George Kay.",
    "country": " United States.",
    "date": "2023-06-28",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt19854762/",

    "movie.watch": "../../Hollywood/Hijack-2023/Hijack-EP1",

    "movie.watchP1": "https://sblona.com/e/tn7z3aynwn50.html",
    "movie.watchP2": "https://sblona.com/e/s6gdm41r1c8g.html",
    "movie.watchP3": "https://sblona.com/e/u7wbnx923sjx.html",
    "movie.watchP4": "https://sblona.com/e/04wp7nn5fgen.html",

    "movie.watchSR1": "https://dooood.com/e/28bv4u62tgnx",
    "movie.watchSR2": "https://dooood.com/e/npjqs11tq8vo",
    "movie.watchSR3": "https://dooood.com/e/4jhcs4bs51p2",
    "movie.watchSR4": "https://dooood.com/e/hxd2fuvo24w2",

    "down1link1": "https://sblona.com/d/tn7z3aynwn50.html",
    "down1link2": "https://sblona.com/d/s6gdm41r1c8g.html",
    "down1link3": "https://sblona.com/d/u7wbnx923sjx.html",
    "down1link4": "https://sblona.com/d/04wp7nn5fgen.html",

    "down2link1": "https://dooood.com/d/28bv4u62tgnx",
    "down2link2": "https://dooood.com/d/npjqs11tq8vo",
    "down2link3": "https://dooood.com/d/4jhcs4bs51p2",
    "down2link4": "https://dooood.com/d/hxd2fuvo24w2",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/HIJACK_Official_Trailer__2023_.mp4?updatedAt=1688158873908",
    "contentRating": " United States:TV-MA",
    "Originalnetwork": "Apple TV+.",
    "language": " English."
  },
  
  {
    "id": "INDEX12",
    "title": "ADIPURUSH ",
    "name": " Adipurush (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1687612157/Adipurush-2023_jbhtko.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1687612157/Adipurush-2023_jbhtko.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " ADVENTURE,", " DRAMA."],
    "rating": 3.9,
    "synopsis": "The movie opens with a scene of Lord Vishnu meditating in his abode, Vaikuntha. He is visited by Brahma, the creator god, who tells him that he has chosen Raghava, a young prince from Ayodhya, to be his avatar on Earth. Raghava is destined to defeat the evil demon king Lankesh and rescue his wife, Sita, from Lanka. Raghava is born into a royal family and is raised to be a righteous and just ruler. He is also a skilled warrior and archer. When he is 18 years old, he is challenged to break Shiva's bow, a weapon that is said to be unbreakable. Raghava not only breaks the bow, but he also shoots an arrow through the eye of a golden fish that is hanging high in the sky. This feat of strength and skill convinces everyone that Raghava is indeed the chosen one. Not long after, Lankesh hears of Raghava's greatness and sends his sister, Surpanakha, to Ayodhya to seduce him. Surpanakha is a hideous demon, but she is also very beautiful. She disguises herself as a beautiful woman and goes to Raghava's palace. Raghava is immediately smitten with her, but he refuses to marry her because he is already married to Sita. Surpanakha is furious and attacks Sita. She cuts off Sita's nose, which enrages Raghava. He vows to avenge Sita and defeat Lankesh. Raghava, Sita, and Lakshmana, Raghava's younger brother, set out on a journey to Lanka. Along the way, they are joined by Hanuman, a monkey god who is a loyal friend and ally. When they reach Lanka, Raghava and his army lay siege to the city. Lankesh sends his army to fight, but Raghava and his men are victorious. Raghava finally confronts Lankesh in single combat. The two warriors fight for hours, but neither one can gain an advantage. Finally, Raghava shoots an arrow that pierces Lankesh's heart. Lankesh falls to the ground, dead. Raghava and his army then free Sita and return to Ayodhya, where they are welcomed as heroes. Raghava is crowned king of Ayodhya and rules wisely and justly for many years. He and Sita have two sons, Luv and Kush, who grow up to be great warriors. The movie ends with a scene of Raghava and Sita meditating in the forest. They are surrounded by their loved ones and are at peace.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688152494/adpurush_zfz7wl.mp3",
    "starring": [
      "Kriti Sanon",
      "Saif Ali Khan",
      "Prabhas",
      "Devdutta Nage",
      "Vatsal Sheth."
    ],
    "director": " Om Raut.",
    "country": " Indian.",
    "date": "2023-06-16",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt12915716/",

    "movie.watch": "../../Bollywood/Adipurush-2023/Adipurush",

    "movie.watchP1": "https://sblona.com/e/9frhaytzwukv.html",
    "movie.watchSR1": "https://dooood.com/e/alq2czdtwuh8",

    "down1link1": "https://sblona.com/d/9frhaytzwukv.html",
    "down2link1": "https://dooood.com/d/alq2czdtwuh8",
       
    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Adipurush-Final-Trailer.mp4?updatedAt=1687612128868",
    "contentRating": " India: U ",
    "Originalnetwork": " T-Series Films.",
    "language": " Hindi."
  },
  {
    "id": "INDEX11",
    "title": "MAUKA YA DHOKA ",
    "name": " Mauka Ya Dhoka (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1687612200/Mauka-Ya-Dhoka-2023_dacw49.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1687612200/Mauka-Ya-Dhoka-2023_dacw49.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " CRIME,", " THRILLER."],
    "rating": 9.4,
    "synopsis": "Mauka Ya Dhokha,Released in the year 2023, is an Suspense, thriller film is directed by Gaurav Pareek. The film stars  Himanshu Malhotra, Aabhaas Mehta, Samiksha Bhatnagar, Vatsal Desai, Sapna Choubisa, Deepakk Sunil Prasadh,Rajinder Singh Puller,Kabir Sadanand, the story is Amit is an ordinary man who dreams of playing for the Indian cricket team. One day, he is given the opportunity of a lifetime to try out for the team. However, he soon realizes that the opportunity may not be all that it seems. Beware what you wish for, for some wishes have the power to shatter your life irreversibly.In the intriguing murder mystery thriller Mauka Ya Dhokha set amidst the picturesque backdrop of Goa, love, greed, and betrayal take center stage, driving the narrative forward. The film revolves around the life of Amit, a young and aspiring cricketer whose greatest dream is to represent the Indian cricket team. His relentless passion for the sport fuels his desire to excel and pushes him towards achieving his goals. One fateful day, Amit is presented with a golden opportunity to try out for the national team, seemingly bringing him closer to his cherished dream. Little does he know that the path to glory is riddled with darkness and deceit. As Amit embarks on this journey towards his dreams, he becomes entangled in a web of danger that threatens not only his career but his very existence. Forced to navigate treacherous waters, he finds himself confronted with choices that will shape his future and have far-reaching consequences. The movie delves into the depths of ambition, exposing its dangers when pursued blindly, and underscores the significance of vigilance when it comes to placing trust in others. Set against the breathtaking backdrop of Goa, the film mesmerizes viewers with its stunning  cinematography,  capturing the scenic beauty of the coastal paradise. Every frame exudes an aura of mystery, enhancing the suspenseful atmosphere that permeates the story. The talented cast adds to the film's allure, with performances that captivate and leave a lasting impression,Himanshu Malhotra, Aabhaas Mehta, and Samiksha Bhatnagar deliver standout portrayals, bringing their characters to life with depth and conviction. Mauka Ya Dhokha is a masterfully crafted thriller, boasting a gripping narrative that keeps audiences on the edge of their seats. The intricate web of suspense  and intrigue woven throughout the story ensures that viewers are constantly engaged, eagerly anticipating the next twist and turn. It serves as a cautionary tale, highlighting the perils of unchecked ambition and the importance of discerning whom to trust in a world filled with deceit. With its captivating storyline, compelling performances, and beautiful visuals,  Mauka Ya Dhokha offers an enthralling cinematic experience. It explores the universal themes of ambition, betrayal, and redemption, resonating with audiences on an emotional level. As the plot unravels, the film leaves viewers questioning the lengths they would go to fulfill their dreams and the consequences that may follow. In conclusion, is a well-crafted thriller that weaves a tale of ambition, love, and betrayal against the enchanting backdrop of Goa. With its captivating narrative, breathtaking cinematography, and stellar performances, the movie keeps viewers engrossed from start to finish. It serves as a cautionary reminder that not all wishes come true without a price, urging us to tread carefully on the path to our dreams.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688153897/maa_wskkxj.mp3",
    "starring": [
      "Samiksha Bhatnagar",
      "Himanshu Malhotra",
      "Abhaas Mehta",
      "Sapna Choubisa",
      "Narendra Gupta."
    ],
    "director": " Deepakk Sunil Prasadh.",
    "country": " Indian.",
    "date": "2023-06-23",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt28100421/",

    "movie.watch": "../../Bollywood/MaukaYaDhoka-2023/MaukaYaDhoka",
  
    "movie.watchP1": "https://sblona.com/e/hqwpkdgpgroe.html",
    "movie.watchSR1": "https://dooood.com/e/09cts1ipp60o",

    "down1link1": "https://sblona.com/d/hqwpkdgpgroe.html",
    "down2link1": "https://dooood.com/d/09cts1ipp60o",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Mauka-Ya-Dhoka-2023.mp4?updatedAt=1687612132480",
    "contentRating": " India: A ",
    "Originalnetwork": " Hungama Original Show.",
    "language": " Hindi."
  },
  {
    "id": "INDEX10",
    "title": "LADIES TAILOR ",
    "name": " Ladies Tailor (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1687612185/LADIES_TAILOR_Part_1-2023_vf13tg.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1687612185/LADIES_TAILOR_Part_1-2023_vf13tg.webp",
    "yearRelease": 2023,
    "genre": [" ADULT, ", " EROTIC, ", " HOT +18."],
    "rating": 4.4,
    "synopsis": "Ladies Tailor is a 2023 Indian web series directed by Saurabh Tiwari and produced by Wow Originals. The series stars Mahika Sharma,Leena Singh, and Priya Banerjee in the lead roles. It tells the story of two women, Meera and Anju, who run a ladies tailor shop in Mumbai. The series explores the challenges that women face in the workplace, as well as the bonds of friendship and sisterhood. The series premiered on the Wow Originals app on June 29, 2023. It has received positive reviews from critics, who have praised the performances of the cast, the direction, and the story. Meera and Anju are two women who have been best friends since childhood. They both work as tailors in a small shop in Mumbai. Meera is a talented tailor, but she is also very shy and introverted. Anju is more outgoing and confident, and she is the driving force behind the shop. One day, Meera meets a man named Rohan, who is a successful businessman. Rohan is immediately sexually attracted to Meera, and he asks her out on a date. Meera is hesitant at first, but she eventually agrees to go out with him. Rohan and Meera start dating, and they quickly fall in love. However, their relationship is not without its challenges. Rohan's family is traditional and conservative, and they do not approve of his relationship with Meera. They believe that she is not good enough for him, and they try to break them up. Meera and Rohan are determined to be together, but they face many obstacles along the way. They must overcome the disapproval of Rohan's family, as well as the challenges of their different social backgrounds. But through it all, their love for each other only grows stronger. Ladies Tailor is a heartwarming story about love, friendship, and the power of women. It is a must-watch for anyone who enjoys feel-good dramas.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1688048503/Ladies-Tailor-head_uxy0wg.mp3",
    "starring": [
      "Sana Asundi",
      "Leena Singh",
      "Mahi Kaur",
      "Pankaj Kumar",
      "Vivan."
    ],
    "director": " Sameer Salim Khan.",
    "country": " Indian.",
    "date": "2023-06-14",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt28096139/",

    "movie.watch": "../../Adult/LadiesTailor-2023/LadiesTailor",
    
    "movie.watchP1": "https://sblona.com/e/cukkf79g36nb.html",
    "movie.watchSR1": "https://dooood.com/e/fiulc0fxae4u",

    "down1link1": "https://sblona.com/d/cukkf79g36nb.html",
   "down2link1": "https://dooood.com/d/fiulc0fxae4u",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/LADIES-TAILOR-Part_1-2023.mp4?updatedAt=1687612131782",
    "contentRating": " India: 18+ ",
    "Originalnetwork": " Woworiginals.",
    "language": " Hindi."
  },
  {
    "id": "INDEX09",
    "title": "TOHFA ",
    "name": " Tohfa Full Complete Series (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1687612261/Tohfa-Part_-1-2023_wtuqbm.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1687612261/Tohfa-Part_-1-2023_wtuqbm.webp",
    "yearRelease": 2023,
    "genre": [" ADULT, ", " EROTIC, ", " HOT +18."],
    "rating": 4.4,
    "synopsis": "Montu is a young man from the city who arrives at a remote village to deliver a gift to his friend's wife, Renu. Renu is a beautiful and attractive woman, and Montu is immediately drawn to her. However, he knows that she is married to his friend, and he does not want to betray his friendship. Montu tries to ignore his feelings for Renu, but it becomes increasingly difficult. He finds himself constantly thinking about her, and he can't help but notice the way she looks at him. One day, Renu confesses to Montu that she is unhappy in her marriage. She tells him that her husband is neglectful and abusive, and she feels like she is trapped in a loveless relationship. Montu is sympathetic to Renu's situation, and he offers her his support. They begin spending more and more time together, and their friendship slowly begins to develop into something more. Renu and Montu eventually give in to their desires and start an affair. The affair continues for some time, but it eventually comes to an end. Renu's husband finds out about the affair, and he is furious. He confronts Montu and threatens to kill him. Montu is forced to leave the village, and he promises Renu that he will never forget her. Montu returns to the city, but he is haunted by the memories of his time with Renu. He knows that he made a mistake by getting involved with her, but he can't help but feel like he is missing something. He eventually decides to go back to the village to see Renu one last time. When Montu arrives at the village, he finds that Renu has left. She has gone to the city to start a new life. Montu is heartbroken, but he knows that he has to let her go. He leaves the village and returns to the city, alone.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1687971981/Tohfa-head_ksoewl.mp3",
    "starring": [
      "Sohail Shaikh",
      "Madhuri Pandey",
      "Basant Kumar",
      "Leena Singh",
      "Pihu Singh."
    ],
    "director": " Humayun Shabbar Abbas.",
    "country": " Indian.",
    "date": "2023-06-13",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt28057495/",

    "movie.watch": "../../Adult/Tohfa-2023/Tohfa-EP1",
  
    "movie.watchP1": "https://sblona.com/e/sbha2n27daqg.html",
    "movie.watchP2": "https://sblona.com/e/obf5x3wksj10.html",

    "movie.watchSR1": "https://dooood.com/e/falyi887qgip",
    "movie.watchSR2": "https://dooood.com/e/qo8s9wgzj2k1",

    "down1link1": "https://sblona.com/d/sbha2n27daqg.html",
    "down1link2": "https://sblona.com/d/obf5x3wksj10.html",

    "down2link1": "https://dooood.com/d/falyi887qgip",
    "down2link2": "https://dooood.com/d/qo8s9wgzj2k1",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Tohfa-Part_-1-Official_Trailer.mp4?updatedAt=1687612133603",
    "contentRating": " India: 18+ ",
    "Originalnetwork": " Ullu Digital.",
    "language": " Hindi."
  },
  {
    "id": "INDEX08",
    "title": "HOSTO ",
    "name": " Hosto (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1687612174/Hosto-2023_nbenrh.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1687612174/Hosto-2023_nbenrh.webp",
    "yearRelease": 2023,
    "genre": [" ADULT, ", " EROTIC, ", " HOT +18."],
    "rating": 4.4,
    "synopsis": "Patrick is a young man from the Philippines who gets a visa to Japan in order to provide for his family. He works as a construction worker, but he is not earning enough money to support his family. He is introduced to the world of hosto, which is a type of gig economy work where men are paid to accompany women on dates. Patrick is initially hesitant to become a hosto, but he eventually agrees to try it out. Patrick quickly realizes that the world of hosto is full of indecent proposals. He is propositioned by women who are looking for more than just companionship. He is also subjected to groping and other forms of sexual harassment. Patrick tries to ignore these advances, but they become increasingly difficult to deal with. One day, Patrick is invited to a party by one of his clients. The party is full of wealthy businessmen and their wives. Patrick is offered drugs and alcohol, and he is encouraged to participate in sexual activities. Patrick refuses, and he leaves the party early. The next day, Patrick is fired from his construction job. He is unable to find another job, and he is forced to rely on his earnings from hosto to support his family. Patrick's situation becomes increasingly desperate, and he begins to spiral out of control. One night, Patrick is invited to a hotel room by a client. The client is a wealthy businessman who is known for his sexual appetite. Patrick is hesitant to go, but he eventually agrees. The businessman forces Patrick to perform sexual acts, and he threatens to kill Patrick if he tells anyone. Patrick is traumatized by the experience, and he begins to have nightmares. He also starts to experience physical symptoms, such as headaches and nausea. Patrick realizes that he needs help, but he is afraid to tell anyone what happened. One day, Patrick meets a social worker who is working with victims of sexual assault. The social worker helps Patrick to understand what happened to him, and she encourages him to report the crime. Patrick eventually decides to press charges against the businessman, and he is eventually convicted and sentenced to prison. Patrick's story is a cautionary tale about the dangers of the hosto industry. It is a reminder that even seemingly harmless activities can have serious consequences. It is also a story of hope, as Patrick is able to find the strength to overcome his trauma and rebuild his life.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1687948966/Hosto_head_zh06y6.mp3",
    "starring": [
      "Jay Manalo",
      "Vince Rillon",
      "Angela Morena",
      "Denise Esteban",
      "Ali Asistio."
    ],
    "director": " Jao Daniel Elamparo.",
    "country": " Philippines.",
    "date": "2023-06-16",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt27912053/",

    "movie.watch": "../../Adult/Hosto-2023/Hosto",

    "movie.watchP1": "https://sblona.com/e/w2g1dk1pn41z.html",
    "movie.watchSR1": "https://dooood.com/e/6la5sy6mkiee",
  
    "down1link1": "https://sblona.com/d/w2g1dk1pn41z.html",
    "down2link1": "https://dooood.com/d/6la5sy6mkiee",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Hosto-Official-Trailer.mp4?updatedAt=1687612131334",
    "contentRating": " Philippines: 18+ ",
    "Originalnetwork": "Viva Films.",
    "language": " Tagalog, Filipino."
  },
  {
    "id": "INDEX07",
    "title": "HILOM ",
    "name": " Hilom (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1687612166/Hilom-2023_bwtjc9.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1687612166/Hilom-2023_bwtjc9.webp",
    "yearRelease": 2023,
    "genre": [" Adult, ", " EROTIC, ", " HOT +18."],
    "rating": 5.9,
    "synopsis": "The movie begins with a young woman named Alma being cursed by a witch. The curse causes Alma to become possessed by a spirit that is slowly killing her. Alma's friends and family try to help her, but nothing seems to work. Eventually, they decide to seek help from a shaman. The shaman tells them that the only way to break the curse is to find the witch who cast it. The group of friends and family set out on a journey to find the witch. Along the way, they encounter many dangers, but they are determined to save Alma. Eventually, they find the witch and break the curse. Alma is saved, and the group returns home victorious.    The movie Hilom (2023) is a well-made and suspenseful film. The acting is top-notch, and the story is engaging. If you are a fan of Filipino drama films, then you will definitely enjoy this movie.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1687939361/Hilom_mse5oo.mp3",
    "starring": [
      "Arron Villaflor",
      "Christine Bermas",
      "Julia Victoria",
      "Alma Moreno",
      "Liz Alindogan"
    ],
    "director": " GB Sampedro.",
    "country": " Philippines.",
    "date": "2023-06-09",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt27925161/",

    "movie.watch": "../../Adult/Hilom-2023/Hilom",
   
    "movie.watchP1": "https://sblona.com/e/koudq3kor3h7.html",
    "movie.watchSR1": "https://dooood.com/e/pqprzxpjyn3s",

    "down1link1": "https://sblona.com/d/koudq3kor3h7.html",
    "down2link1": "https://dooood.com/d/pqprzxpjyn3s",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Hilom-Official_Trailer.mp4?updatedAt=1687612129049",
    "contentRating": " Philippines: 18+ ",
    "Originalnetwork": "Viva Films.",
    "language": " Tagalog, Filipino."
  },
  {
    "id": "INDEX06",
    "title": "THE POCKET DIAL MURDER ",
    "name": "Pocket Dial Murder (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1687612200/Pocket-Dial-Murder-2023_gh5dfm.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1687612200/Pocket-Dial-Murder-2023_gh5dfm.webp ",
    "yearRelease": 2023,
    "genre": [" DRAMA,",  " THRILLER."],
    "rating": 4.8,
    "synopsis": "The movie opens with a young woman named Sarah (played by Emma Roberts) who is struggling to find her place in the world. She is working a dead-end job, and she is not sure what she wants to do with her life. One day, Sarah is browsing through a thrift store when she finds a beautiful dress. The dress is perfect for her, and she decides to buy it. She wears the dress to a party, and she meets a handsome man named Jake (played by Josh Duhamel). Jake and Sarah hit it off, and they start dating. Jake is everything that Sarah has ever wanted in a man. He is handsome, successful, and he seems to be perfect for her. However, Sarah soon starts to realize that Jake is not what he seems. He is controlling and possessive, and he is not as perfect as she thought he was. Sarah tries to break up with Jake, but he refuses to let her go. He threatens her and her family, and he makes it clear that he will not let her go without a fight. Sarah is scared, but she knows that she has to stand up to Jake. She refuses to let him control her, and she fights back against him. In the end, Sarah is able to defeat Jake and escape from him. She is finally free from his control, and she can start to rebuild her life. The Perfect Find 2023 is a thriller that explores the themes of control and manipulation. Emma Roberts is excellent in the lead role, and she brings a lot of strength and vulnerability to the character of Sarah. The movie is also well-acted and well-directed, and it is sure to keep viewers on the edge of their seats.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1687892282/u-pdm_jziggu.mp3 ",
    "starring": [
      "Kirsten Comerford ",
      "Steve Byers",
      "Gina Torres",
      "Mathieu Bourassa",
      "Dawn Lambing."
    ],
    "director": " Roxanne Boisvert.",
    "country": " United States.",
    "date": "2023-06-15",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt24072236/",

    "movie.watch": "../../Hollywood/PocketDialMurder-2023/Pocket-Dial-Murder",
   
    "movie.watchP1": "https://sblona.com/e/cgiqapgj9l3p.html",
    "movie.watchSR1": "https://dooood.com/e/fmic3vvonoiu",

    "down1link1": "https://sblona.com/d/cgiqapgj9l3p.html",
    "down2link1": "https://dooood.com/d/fmic3vvonoiu",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Pocket-Dial-Murder-2023-Trailer.mp4?updatedAt=1687612129975",
    "contentRating": " United States:TV-14",
    "Originalnetwork": " N.B Thrilling Films 8.",
    "language": " English."
  },
  {
    "id": "INDEX05",
    "title": "THE PERFECT FIND ",
    "name": " The Perfect Find (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1687853537/the_perfect_find_2023_gxsxvk.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1687853537/the_perfect_find_2023_gxsxvk.webp ",
    "yearRelease": 2023,
    "genre": [" DRAMA,", " COMEDY,", " ROMANCE."],
    "rating": 5.3,
    "synopsis": "The movie opens with a young woman named Sarah (played by Emma Roberts) who is struggling to find her place in the world. She is working a dead-end job, and she is not sure what she wants to do with her life. One day, Sarah is browsing through a thrift store when she finds a beautiful dress. The dress is perfect for her, and she decides to buy it. She wears the dress to a party, and she meets a handsome man named Jake (played by Josh Duhamel). Jake and Sarah hit it off, and they start dating. Jake is everything that Sarah has ever wanted in a man. He is handsome, successful, and he seems to be perfect for her. However, Sarah soon starts to realize that Jake is not what he seems. He is controlling and possessive, and he is not as perfect as she thought he was. Sarah tries to break up with Jake, but he refuses to let her go. He threatens her and her family, and he makes it clear that he will not let her go without a fight. Sarah is scared, but she knows that she has to stand up to Jake. She refuses to let him control her, and she fights back against him. In the end, Sarah is able to defeat Jake and escape from him. She is finally free from his control, and she can start to rebuild her life. The Perfect Find 2023 is a thriller that explores the themes of control and manipulation. Emma Roberts is excellent in the lead role, and she brings a lot of strength and vulnerability to the character of Sarah. The movie is also well-acted and well-directed, and it is sure to keep viewers on the edge of their seats.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1687852254/The_Perfect_Find-tittle_idat6s.mp3 ",
    "starring": [
      "Gabrielle Union",
      "Keith Powers",
      "Gina Torres",
      "La La Anthony",
      "Aisha Hinds."
    ],
    "director": " Numa Perrier.",
    "country": " United States.",
    "date": "2023-06-14",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt8400584/",

    "movie.watch": "../../Hollywood/ThePerfectFind-2023/The-Perfect-Find",

    "movie.watchP1": "https://sblona.com/e/svg9r4zymqt1.html",
    "movie.watchSR1": "https://sblona.com/e/svg9r4zymqt1.html",

    "down1link1": "https://sblona.com/d/svg9r4zymqt1.html",
    "down2link1": "https://sblona.com/d/svg9r4zymqt1.html",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/The-Perfect-Find___Official-Trailer.mp4?updatedAt=1687612131240",
    "contentRating": " United States:TV-MA",
    "Originalnetwork": "Netflix.",
    "language": " English."
  },
  {
    "id": "INDEX04",
    "title": "THE MACHINE ",
    "name": "The Machine (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1687612249/THE-MACHINE-2023_fk9iqh.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1687612249/THE-MACHINE-2023_fk9iqh.webp ",
    "yearRelease": 2023,
    "genre": [" ACTION,", " COMEDY,", " THRILLER."],
    "rating": 6.1,
    "synopsis": "he movie opens with Bert Kreischer (played by himself) in a therapy session, talking about a wild story from his past. He tells the therapist about how he was once a drug dealer in Russia and how he was involved in a gang war that left several people dead. Bert's story is interrupted by a knock at the door. It is his friend Mark, who has come to tell him that his past has come back to haunt him. Mark tells Bert that a Russian mobster named Sasha is looking for him, and that he needs to leave town immediately. Bert is reluctant to go, but he knows that Mark is right. He packs his bags and leaves town, but he is not able to escape Sasha's reach. Sasha tracks Bert down to a small town in the United States, and he kidnaps Bert's wife and daughter. Bert is forced to go on the run, and he teams up with a Russian gangster named Igor to rescue his family. The two men track Sasha down to a remote cabin in the woods, and they engage in a bloody battle. In the end, Bert is able to rescue his family, and he kills Sasha. However, the experience has left Bert changed. He is no longer the same carefree party guy that he once was. He is now a man who has seen the dark side of life, and he is determined to make amends for his past mistakes. The movie ends with Bert returning to therapy, and he tells the therapist that he is ready to move on from his past. He is ready to start a new life, and he is determined to be a better man. The Machine 2023 is a dark comedy that explores the themes of redemption and second chances. Bert Kreischer is excellent in the lead role, and he brings a lot of humor and heart to the movie. The movie is also well-acted and well-directed.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1687776516/The_Machine-tittle_dzzrqz.mp3",
    "starring": [
      "Bert Kreischer",
      "Mark Hamill",
      "Jimmy Tatro",
      "Iva Babic",
      "Robert Maaser."
    ],
    "director": " Peter Atencio.",
    "country": " United States.",
    "date": "2023-05-26",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt11040844/",

    "movie.watch": "../../Hollywood/TheMachine-2023/The-Machine",

    "movie.watchP1": "https://sblona.com/e/bwud2zqr9lg5.html",
    "movie.watchSR1": "https://dooood.com/e/x4eshycyc3qo",

    "down1link1": "https://sblona.com/d/bwud2zqr9lg5.html",
    "down2link1": "https://dooood.com/d/x4eshycyc3qo",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/THE-MACHINE-Official-Trailer.mp4?updatedAt=1687612126078",
    "contentRating": " United States:R",
    "Originalnetwork": "Sony Pictures Releasing.",
    "language": " English."
  },
  {
    "id": "INDEX03",
    "title": "EXTRACTION 2  ",
    "name": "Extraction 2 (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1687612166/Extraction-2-2023_bjjpad.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1687612166/Extraction-2-2023_bjjpad.webp ",
    "yearRelease": 2023,
    "genre": [" ACTION,", " DRAMA,", " THRILLER."],
    "rating": 7.1,
    "synopsis": "Extraction 2 was released by Netflix on June 16, 2023, Extraction 2 is a 2023 American action thriller film. The movie opens with Tyler Rake (Chris Hemsworth) in prison, serving time for his actions in the first film. He is visited by his ex-wife Mia (Olga Kurylenko), who tells him that she has been offered a job to extract a woman named Nik Khan (Golshifteh Farahani) from Bangladesh. Nik is a former CIA agent who is now being hunted by a group of mercenaries led by Zurab (Riz Ahmed). Rake agrees to help Mia, and the two of them travel to Bangladesh to rescue Nik. However, things quickly go wrong when they are ambushed by Zurab's men. Rake and Mia are forced to flee, and they take Nik with them. The group makes their way to a safe house, but they are soon surrounded by Zurab's men. In the ensuing battle, Rake and Mia are able to defeat Zurab's men, but Nik is mortally wounded. Rake and Mia take Nik to a hospital, but she dies from her injuries. Rake is devastated, but he knows that he must still finish the mission. He tracks down Zurab and kills him, avenging Nik's death. The movie ends with Rake being arrested by the authorities. However, he is soon released, and he is approached by a mysterious man named Alcott (Idris Elba). Alcott tells Rake that he has another mission for him, and Rake agrees to take it on. The ending of Extraction 2 leaves the door open for a sequel, and it also introduces a new character in Alcott. Alcott is a powerful figure who is clearly not afraid to get his hands dirty. He is a dangerous opponent, but he is also someone who can offer Rake the kind of challenges that he craves. The movie also explores the themes of redemption and second chances. Rake is a flawed character, but he is also a hero. He is willing to risk his life to save others, and he is always willing to fight for what he believes in. Extraction 2 is a thrilling action movie that also offers a thought-provoking exploration of the human condition.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1687762749/Extraction2-tittle_iw2rq1.mp3",
    "starring": [
      "Chris Hemsworth",
      "Golshifteh Farahani",
      "Adam Bessa",
      "Tornike Gogrichiani",
      "Demetre Kavelashvili."
    ],
    "director": "Sam Hargrave.",
    "country": " United States.",
    "date": "2023-06-13",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt12263384/",

    "movie.watch": "../../Hollywood/Extraction2-2023/Extraction-2",
 
    "movie.watchP1": "https://sblona.com/e/pewadmz8f98a.html",
    "movie.watchSR1": "https://dooood.com/e/7h0cjiykoyrl",

    "down1link1": "https://sblona.com/d/pewadmz8f98a.html",
    "down2link1": "https://dooood.com/d/7h0cjiykoyrl",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/EXTRACTION_2___Official_Teaser_Trailer.mp4?updatedAt=1687759631962",
    "contentRating": " United States:R ",
    "Originalnetwork": "Netflix.",
    "language": " English."
  },
  {
    "id": "INDEX02",
    "title": "BLOODY DADDY  ",
    "name": " Bloody Daddy (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1686515465/Bloody-Daddy-2023_kywtrm.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1686515465/Bloody-Daddy-2023_kywtrm.webp",
    "yearRelease": 2023,
    "genre": [" ACTION,", " DRAMA,", " THRILLER."],
    "rating": 7.6,
    "synopsis": "Bloody Daddy is a 2023 Indian Hindi-language action thriller film directed by Ali Abbas Zafar who co-wrote the film with Aditya Basu and Siddharth–Garima, and produced by Jio Studios. It features Shahid Kapoor, Sanjay Kapoor, Diana Penty, Ronit Roy, Rajeev Khandelwal, Ankur Bhatia and Vivan Bhatena. It is the adaptation of 2011 French film Sleepless Night, which itself was remade in Tamil as Thoongaa Vanam (2015), starring Kamal Haasan. The film follows the story of Sumair Azad (Shahid Kapoor), a messed up, tenacious man who faces off against cops and crime lords to save the one relationship that matters to him: his son, Arjun (Agastya Nanda). Sumair is a former police officer who was framed for a crime he didn't commit. He was released from prison after serving five years, but he has never been able to clear his name. He now works as a private investigator, trying to make ends meet and provide for his son. One day, Arjun is kidnapped by Sikandar Chowdhary (Ronit Roy), a powerful crime lord. Sikandar is demanding a ransom of ₹100 crore, but Sumair refuses to pay. He knows that if he pays the ransom, Sikandar will just come back for more. Sumair decides to take matters into his own hands. He tracks down Sikandar and confronts him. A fight ensues, and Sumair is able to rescue Arjun. However, Sikandar is not finished yet. He vows to get revenge on Sumair and his family. Sumair and Arjun go on the run, trying to stay one step ahead of Sikandar's men. They are helped by a team of police officers, led by Inspector Khan (Sanjay Kapoor). However, Sikandar is a powerful enemy, and he is not going to give up easily. The film culminates in a showdown between Sumair and Sikandar. The two men fight to the death, and in the end, Sumair is victorious. He has saved his son, and he has finally cleared his name. Bloody Daddy is a fast-paced, action-packed thriller that will keep you on the edge of your seat. It is a story of love, loss, revenge, and redemption. Shahid Kapoor gives a powerful performance as Sumair, and the supporting cast is also excellent. The film is directed with flair by Ali Abbas Zafar, and the action sequences are well-choreographed. Bloody Daddy is a must-see for fans of action thrillers.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1687094006/BLOODY_TITEL_i0ogh6.mp3",
    "starring": [
      "Shahid Kapoor",
      "Amy Aela ",
      "Ankur Bhatia",
      "Diana Penty",
      "Ronit Roy."
    ],
    "director": "Ali Abbas Zafar.",
    "country": " India.",
    "date": "2023-06-09",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt27501039/",

    "movie.watch": "../../Bollywood/bloodydaddy-2023/Bloody-Daddy",

    "movie.watchP1": "https://sblona.com/e/rqu66x7m461t.html",
    "movie.watchSR1": "https://dooood.com/e/3jyolbel4mak",

    "down1link1": "https://sblona.com/d/rqu66x7m461t.html",
    "down2link1": "https://dooood.com/d/3jyolbel4mak",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Bloody_Daddy_Official_Trailer.mp4?updatedAt=1686515404311",
    "contentRating": " India:A ",
    "Originalnetwork": "JioCinema.",
    "language": " Hindi."
  },
  {
    "id": "INDEX01",
    "title": "MODERN LOVE CHENNAI ",
    "name": " Modern Love Chennai (2023)",
    "poster": "https://res.cloudinary.com/dezf3wemk/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/v1686515490/Modern-Love-Chennai-2023_nwaheo.webp",
    "banner": "https://res.cloudinary.com/dezf3wemk/image/upload/c_fill,g_auto,e_sharpen,h_250,w_970/b_rgb:000000,e_gradient_fade,y_-0.10/c_scale,co_rgb:ffffff,fl_relative,l_text:montserrat_25_style_light_align_center:Download%20Now,w_0.3,y_0.35/v1686515490/Modern-Love-Chennai-2023_nwaheo.webp",
    "yearRelease": 2023,
    "genre": [" DRAMA,"," COMEDY."],
    "rating": 7.6,
    "synopsis": "Modern Love Chennai is a 2023 Indian Tamil-language anthology romantic comedy-drama television series directed by Bharathiraja, Balaji Sakthivel, Thiagarajan Kumararaja, Rajumurugan, Krishnakumar Ramakumar and Akshay Sundher. It was produced by Tyler Durden and Kino Fist. It stars Ritu Varma, Ashok Selvan, Remya Nambeesan, Wamiqa Gabbi, Sri Gouri Priya, Samyuktha Vishwanathan, Pawan Alex, Aniiruth Kanakarajan, T. J. Bhanu, Sanjula Sarathi, Chu Khoy Sheng, Srikrishna Dayal, Vasudevan Murali, Vasundhara Kashyap, Kishore, Vijayalakshmi and PB. The series is an adaptation of the American anthology series Modern Love, which is based on the column of the same name published in The New York Times. The series tells six stories of love in Chennai, each with its own unique perspective. The first story, Lalagunda Bommaigal, is about a young couple who fall in love despite their different social backgrounds. The second story, Imaigal, is about a group of friends who come together to support each other through a difficult time. The third story, Kaadhal Enbadhu Kannula Heart Irukkura Emoji, is about a young man who falls in love with a woman who uses emojis to communicate her feelings. The fourth story, Margazhi, is about a couple who rekindle their love after many years apart. The fifth story, Paravai Kootil Vaazhum Maangal, is about a young woman who finds love with a man who is not her caste. The sixth story, Ninaivo Oru Paravai, is about a woman who learns to love herself after a series of heartbreaks. Modern Love Chennai is a heartwarming and uplifting series that celebrates the power of love in all its forms. It is a must-watch for anyone who loves a good love story.",
    "audio": "https://res.cloudinary.com/db36kfuq3/video/upload/v1687096960/MCL-TITTLE_sfzc0m.mp3",
    "starring": [
      "Wamiqa Gabbi",
      "Ritu Varma ",
      "Ashok Selvan",
      "Vijayalakshmi Ahathian",
      "Sri Gouri Priya."
    ],
    "director": "Thiagarajan Kumararaja.",
    "country": " India.",
    "date": "2023-05-18",
    "status": "New Movie",
    "link": "https://www.imdb.com/title/tt21883062/",

    "movie.watch": "../../Bollywood/ModernLoveChennai-2023/ModernLoveChennai",
  
    "movie.watchP1": "https://sblona.com/e/cdx839wxmpd1.html",
    "movie.watchSR1": "https://sblona.com/e/cdx839wxmpd1.html",

    "down1link1": "https://sblona.com/d/cdx839wxmpd1.html",
    "down2link1": "https://sblona.com/d/cdx839wxmpd1.html",

    "movie.trailer": "https://ik.imagekit.io/gmcl6xvq6/Modern_Love_Chennai_-_Official_Trailer.mp4?updatedAt=1686515406041",
    "contentRating": " India:UA 16+ ",
    "Originalnetwork": "Amazon Prime Video.",
    "language": " Hindi."
  }


]