[
  {
    "title": "Benafsha, the Afghan cricket queen, who defeated the Taliban, by building her own life, taking the team along, talking a lot and listening to Farsi love ballads",
    "link": "http://localhost:3000/sports/benafsha-the-afghan-cricket-queen-who-defeated-the-taliban-by-building-her-own-life-taking-the-team-along-talking-a-lot-and-listening-to-farsi-love-ballads",
    "siteurl": "http://localhost:3000/sports/benafsha-the-afghan-cricket-queen-who-defeated-the-taliban-by-building-her-own-life-taking-the-team-along-talking-a-lot-and-listening-to-farsi-love-ballads",
    "description": "Benafsha's father was killed in mysterious circumstances in Kabul, but cricket kept her determined at 18 to escape Talib atrocities even as she insisted that she would seek refuge in Australia only if the rest of the cricket team and families were taken in too.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Benafsha-Hashimi-afghanistan.png",
    "description1": "Benafsha Hashimi is sitting on her father’s lap, stroking his beard, in Kabul, Afghanistan when an advisory message plays out on the television. “Don't come to Australia illegally on boats”, a note for the many immigrant residents risking, often losing, their lives to get across. Little Benafsha thinks Australia is just on the other side of the big river in Kabul. “I shall go there, pedar (Father, in Dari language) one day, I have to just cross the river”. The father tells her she has to learn swimming first. “Don’t worry, I can go in a boat!” The father laughs but assures her that she can go the proper way one day but she has to study hard and grow up. Nearly one-and-half decades later, in 2021, the 21 year old Hashimi has ended up in Canberra in Australia, escaping the clutches of Taliban, surviving the death of her father, an Afghan special forces soldier, in mysterious circumstances. But she also witnessed an aunt who bled to death, besides myriad shootings, before dragging her entire Afghan team of women along with her. All this when she was still a teenager, three years back. It’s a remarkable story of hope, will-power, selflessness, stubbornness, and a lot of cheekiness. We meet at an outdoorsy cafe the morning after India’s warm-up game against the Prime Minister’s XI. Almost immediately, she excuses herself and hops off to play with a dog that was barking rather loudly and she laughs, a lovely full-throated aural memory that will stick in the mind, when the dog’s owner says ‘he likes his own voice’. When she plonks back on her chair, she announces, “I have a cat, Lilly. I love lilies and my Lilly. We talk a lot.” It’s probably the rare imagery of the morning when she reflects her age; the rest of the time, as she narrates her life story, immense inspiring maturity floats in the air. It’s a story that’s difficult to decide where to start. At that moment, perhaps, when the Taliban had taken over the city, the 18-year old rushes to the bank to withdraw money for her family of 10 but instead hears the Taliban soldiers outside the bank, firing in the air. Or at the Checkpost at Pakistan border, when she is fleeing with the family in the middle of night 'sadly like a pack of thieves” and is stopped by the Talibs, who bark at her brother Hamid to tell “this girl to stop talking, who has given a girl rights to talk, just stand aside.” Or the moment when her phone starts to ring, with a popular Farsi love song triggering outrage in the Taliban soldiers, and her brother muttering, ‘we are all going to die’ even as he tried to stop the call. It was her friend, a cricketing team-mate wanting to know her whereabouts. It’s perhaps best to start with why that friend was reaching out. Not at that moment, but how Benafsha became the rallying group leader for the girls of her cricket team, and their families, to get to Australia in a move that’s bound to have positive repercussions for generations to come for those families. “No, no, it was a combined team effort, I couldn’t have done it without my friends,” she says but it’s clear that they couldn’t have even dared to dream this life without her. She was the resourceful one, tirelessly pursuing opportunities outside, sending emails to all parts of the cricketing world and beyond to see a possible light at the end of the Taliban tunnel. The first three emails were her passport to survival and better life but unbelievably she chose to ignore them. The US authorities offered her escape due to her father’s past with them, Canada threw her a lifeline and so did Dubai, but she is adamant that she wants her team with her. “My well-wishers who were trying to help me to escape all understandably called me an idiot. But I was stubborn. In weak moments when I would think perhaps I should take it, an inner voice would come loud and clear: ‘C’mon Benafsha, you are a team player. This is not what a good person does. You can’t abandon your friends and be selfish.” And so she even lies to her mother that she didn’t hear back from anyone. That they have to just wait and hope. It’s when Mel Jones, an Australian woman cricketer of stature hears her story, and offers help. The Australian authorities get into the picture soon and are shocked to hear that she wants the entire team and families to escape. “You know, right, we can’t do that. It’s not easy, how can we take so many people out. You and your family come first.” Benafasha Hashimi listens to no one but her inner voice. “Even today when I speak to youngsters I tell them, my life motto is, “Listen to all, but don’t follow anyone. Only follow your heart, courage will come automatically.” Around us, the dog is now barking at a distance as the owners have just left, the sun is shining brightly, and the cafe lady offers coffee; Benafsha doesn’t want any. “That dog is funny. I haven’t heard any other dog in this city bark as loudly as him. It’s not like Kabul, you know,” she says. Or India. But we plunge back to Kabul, before we can return to her escape, and to her father. “He treated me like a little princess. Usually Afghan men prefer sons; he was different, distributing laddoos to everyone in the neighbourhood when I was born, his fourth child. He would keep telling me that I am a special one and can do whatever I want, live my dream but only that I have to be educated and work hard.” Due to the nature of his work, he was often away. “And then one day, he came in a coffin. There he was laid out, outside our door and I was not even 10 then. I just sat there, staring at him. My younger sister kept repeating, “he is just sleeping, he will wake up.” It was their mother who took both aside to tell them that their father is no more and it’s okay to cry. “Don’t bottle it up, cry if you have to. This is what it is. We have to face reality.” The reality kept turning dark. “Some said he had a heart-attack, some said he was poisoned, we don’t know to this day.” Not long after that, more tragedy struck. Benafsha found herself pouring water on her aunt’s dea",
    "description2": "d body to cleanse. “Only women are allowed in our tradition. She was shot in the hip and head, blood on her body when she was brought home.” A childhood shot to pieces, pushing her to grow up rather too quickly but luckily one remnant would remain. “Cricket saved my life,” she says with a chirpiness, and adding solemnly, “Cricket is my life.” *** Her mother never liked her playing cricket. Especially in the streets with the boys, once she grew up a little. The coaches at the official academy didn’t take a liking to her because she was a “street cricketer” and not someone who grew up in the system. Her memories of playing in the streets still remain very special to her. “The empty oil tin cans were our stumps and I must say I terrorised the boys by hitting!” It was her eldest brother Hamid who kept fighting with their mother to allow her to play cricket and things turned a bit when she won a scholarship to a cricket talent programme. Things kept escalating positively and she was named alongside 25 girls, officially contracted by the Afghanistan Cricket board in 2021. The lights would go out soon, though. She remembers that day at the bank just days after the Taliban took over. “When I heard the shootings I froze in fear. I huddled behind other women, not knowing what would happen.” But it wasn’t the bullets that was her worst moment, but the vulgar gaze of a male Taliban soldier. “He gave me this look - a dirty look that I can’t describe but I knew what it was. He told the others to stop shooting and told me that the bank is shut today, but write your name now in this paper. And come to meet me tomorrow. I shall take you inside. I nodded and ran from there, shivering. That look is my worst memory from those days at Kabul. It made me doubly determined that I should leave Afghanistan. There was no option left.” But as we know even when the opportunities came, she didn’t take them as she wanted her team also to be safe. “I am the one doing all the paperwork, emailing, talking in my broken English; what would happen to them if I left?” And so she pressed the Australian authorities to somehow pull off the miracle for her. They buckled under her sweet emotional pressure, and promised her they would. That they will process the paperwork, get the required permission, but the evacuation can’t be en-masse. First her and her family. “I managed to get two more families along with me, of course,” she smiles. And it’s to that night in September 2021 she returns to. “Many in our group were happy, but me and my sister Safia, who is two years younger and also in our team, were sad. We love Afghanistan, we loved our days in Kabul. We didn’t want to leave …” There were numerous checkpoints, where they would all insist that they were off to a wedding. It was at one such post where her phone rang with Farsi love tune drifting in the air. “The talibs were so angry, screaming that it’s blasphemy and that we shall be whiplashed. Somehow we got through.” They were in Pakistan, first, for a week before they flew to Australia. They say it takes a village to rear a child, it takes people from different countries to flee that village in distress. Walwala and Toba in Afghanistan cricketing circuit, unnamed Australian authorities, Mel Jones, and Catherine Ordway, a lawyer, academic, and sports integrity expert who has been part of tribunals. Catherine, who had helped her through the process, was at hand to receive her in Australia, and very soon would be referred to as “mum” by Benafsha. “ I remember the moment when we emotionally bonded. They had taken us, not long after arrival in Canberra, to the river. It was a man-made waterbody and was black in colour. I have never seen black waters before and even as I was talking to her, I held her hand. My friends whispered to me not to do it, and so I asked her if she minded. She had this bright smile when she said no, and gave me this hug. I call her mum, these days.” She plays for two clubs in Australia, she also played for Sydney University team briefly, and travelled to Fiji to play cricket with the organisation ‘Cricket without Borders’. In January, she will represent Afghan Women XI that will play against Cricket without Borders at MCG in Melbourne. “We shall get there early January and there will be selection trials. I would absolutely love it if I were the captain!” Not everything is hunky dory. The past has a way to cling on, leaving its residues in the soul. Benafsha often wakes up screaming at nights, calling out for her mother. “I would have different nightmares that also include me being about to be killed.” Seeing the alarmed face, she explains in a gentle voice as if speaking to a kid. “Don’t worry, it’s normal. In the most depressive times when one is in a place of great trouble, as I was in Kabul, nothing spills out. Your determination, your need to be positive and look ahead gets you through. Often, when you reach a safe place, with the troubles seemingly behind you, it’s when the trauma hits.” She is taking counselling and is all set to pursue her sports management course, that has psychology in the syllabus, at the Canberra University from February next year. She then cues up an awww moment with her own mother, who had worried about her playing cricket, worried about her straying outside on the streets, worried about her studying in Kabul - again her brother had insisted she must as it was the father’s dream and she was the brightest kid in the family. “One day here, she said, “Benafsha, without you, none of this would have been possible. I dread to think what would have happened to us in Kabul.” There is this look on Benafsha’s face as she recalls that - not a face of pride, surprisingly, but of love. And as he gets up to leave, ignoring protests that she has not even eaten anything and whether she needs a lift, Benafsha, which means 'violet' and whose nickname is 'Choti Shaitaan (Little Devil), beams this bright smile and says, “Don’t worry Janaab, I know my way, this is my country now!”",
    "image": "https://images.indianexpress.com/2024/12/Benafsha-Hashimi-afghanistan.png",
    "image1": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
    "date": "2/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T13:19:47+05:30",
    "dateModified": "2024-12-02T13:19:47+05:30"
  },
  {
    "title": "Pink ball practice game: Is Rohit Sharma batting at No 4 a hint of him batting down the order in Adelaide?",
    "link": "http://localhost:3000/sports/pink-ball-practice-game-is-rohit-sharma-batting-at-no-4-a-hint-of-him-batting-down-the-order-in-adelaide",
    "siteurl": "http://localhost:3000/sports/pink-ball-practice-game-is-rohit-sharma-batting-at-no-4-a-hint-of-him-batting-down-the-order-in-adelaide",
    "description": "IND vs AUS: Rohit Sharma's batting position has been a topic of debate ever since KL Rahul batted as well as he did in the first Test. Perhaps, it would have been different had Rohit been in a richer vein of form.",
    "thumbnail": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T183048.303.jpg",
    "description1": "Rohit Sharma didn’t open, choosing to bat at No.4 in the Prime Minister’s XI pink-ball game at Manuka Oval, triggering obvious thoughts about his batting position in the Adelaide Test. It does make sense after KL Rahul’s assured batting as an opener in both innings of the Perth Test, the way he mentored Yashasvi Jaiswal in the second dig there. It was Shubman Gill, who batted at three, reassuming his position that he has made his own, and made a neat fifty. It also allows Rohit, who has been a bit too impetuous in the recent Tests as an opener, to settle in a middle-order role. He lasted just 11 balls though against PM XI, chasing a ball well outside off from Charlie Anderson, and edging it to the slips. The crowd sensed that Virat Kohli was not at the ground - he had left by then—and a large section left the arena. Rishabh Pant, who kept for the first half of the PM XI’s batting innings before Sarfaraz Khan took over, too didn’t bat. Rohit’s batting position has been a topic of debate ever since Rahul batted as well as he did in the first Test. Perhaps, it would have been different had Rohit been in a richer vein of form. At his pomp as Test opener, he was the classic opener, not taking any risks, letting a ton of balls go through to the ‘keeper, taking his time to open up. But of late, he has been in a bit of a hurry, trying to stamp his authority rather quickly on the proceedings. The middle-order role allows him more breathing space, and less issues as he doesn’t have to face the moving pink ball. All else went pretty well for India. They won the toss and chose to bowl first to test their batting under lights. The pink ball did move around a bit, especially when new, in total contrast to the afternoon when it was pretty flat. The game itself was a bit of a friendly as India kept batting on even after they “won”, chasing down the 241-run target. Mid-afternoon rains had reduced the game from 50-overs to 46 and Sam Konstas-the 19-year old opener who has suddenly shot up in the national reckoning and was in the frame to be selected for the Perth Test-slammed an aggressive hundred. Yashasvi Jaiswal took it up to Jack Nisbet in Canberra but the fiery NSW quick wasn't backing down! 👀 #PMXIvIND pic.twitter.com/tX3O86wEv2 — cricket.com.au (@cricketcomau) December 1, 2024 Compact Rahul Rahul continued to showcase his compact technique. The best thing about it isn’t in the shots he played, but in dealing with the ball in the off-stump corridor. In the past, he has o",
    "description2": "ccasionally let his hands jar at the ball, dragging the bat away from the body. But in Perth, as also here, he just played the line. If the ball jagged away, it would sail past the edge without any danger. Even the forward stride that was so precise and effective at Perth was on view here. His form gives additional reason for Rohit to go down the order. Gill eased into his knock without much fuss. There were a couple of deliveries initially when he had a bit of a poke and a miss, and Rahul came across for a mid-pitch chat. The ball had straightened or just about shaped away on those occasions. There weren't many alarms for him afterwards, and pretty soon in his piece, he unfurled his short-arm jabbed cut - that stroke without much follow-through and a shot that was reared on cement tracks in childhood. It’s quite a visual treat, as he allows the ball to come through and sort of hammers the nail on its head with one swift fluid move. A half-century for Shubman Gill in his first innings of India's Australian tour #PMXIvIND pic.twitter.com/YCPGFMqvs8 — cricket.com.au (@cricketcomau) December 1, 2024 Jaiswal was squared-up a couple of times against the new ball cutting away from him. There were a couple more edged fours through slips as he tried to charge and heave once, and got a leading edge on the other when he tried to work the ball to the on side. But when he wanted to be compact and tight, he was. The only real sign of concern, if that word can be used, when he seemingly had a back spasm. He kept fiddling with his back and when it ailed him a tad bit more, he took treatment from the physio, as he lay on his stomach. But it must not have been something serious as he continued batting. Of all the Indian batsmen, he was the one who tried to be overtly aggressive, and eventually miscued a heave to cover. Nitish Reddy continued to be his impressively busy self. Just as he did to Nathan Lyon at Perth, he took the attack to the leg spinner Lloyd Pope. A charge down the track and a slog sweep had the crowd howling in delight but the shot of the game was his revere-swept boundary. It was some shot, to a full delivery outside off and Reddy just let his hands go through the shot in some style. India wrapped up the game, with most batsmen they wanted getting a hit, and the bowlers getting a bowl. Brief Scores: Prime Minister's XI 240 (Konstas 107, Jacobs 61, Rana 4-44) lost to India 257 for 5 (Gill 50, Jaiswal 45, Reddy 42, Washington 42*, Anderson 2-30) by five wickets.",
    "image": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T183048.303.jpg",
    "image1": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
    "date": "1/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T18:38:28+05:30",
    "dateModified": "2024-12-01T18:38:28+05:30"
  },
  {
    "title": "India vs Japan U19 Asia Cup 2024, LIVE Cricket Score: Mohammad Amaan’s century help IND reach 339/6",
    "link": "http://localhost:3000/sports/india-vs-japan-u19-asia-cup-2024-live-cricket-score-mohammad-amaan-s-century-help-ind-reach-339-6",
    "siteurl": "http://localhost:3000/sports/india-vs-japan-u19-asia-cup-2024-live-cricket-score-mohammad-amaan-s-century-help-ind-reach-339-6",
    "description": "India vs Japan (IND-U19 vs JPN-U19) U19 Asia Cup 2024 Live Cricket Score Online Updates: India captain Mohammad Amaan slammed unbeaten 122 to help India post 339 for 6 vs Japan in Sharjah.",
    "thumbnail": "https://images.indianexpress.com/2024/12/India-vs-Japan-IND-U19-vs-JPN-U19-IND-U19-vs-JPN-U19-live-score-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-live-score-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-live-cricket-score-live-cricket.jpg",
    "description1": "India U19 vs Japan U19 (IND-U19 vs JPN-U19) U19 Asia Cup 2024 Live Cricket Score Updates: Riding on a calm and calculated hundred from captain Mohammad Amaan, India posted 339 for 6 in 50 overs in their second match of the ACC U-19 Asia Cup at the Sharjah Cricket Stadium on Monday. India had a rollicking start courtesy their openers Ayush Mhatre (54 off 29 balls) and Viabhav Suryavanshi (233 off 23 balls) as the duo forged together a 65-run stand for the first wicket. C Andre Siddarth (35) and KP Karthikeya (57) also played a crucial role. But the knock of the day was played by Amaan, who remained unbeaten on ",
    "description2": "122. For Japan, Hugo Kelly (2/42) and Kiefer Yamamoto-Lake (2/74) were the most successful bowler. Charles Hinze and Aarav Tiwari chipped in with a wicket apiece. Playing XIs India U-19 XI: Ayush Mhatre, Vaibhav Suryavanshi, Andre Siddarth, KP Karthikeya, Mohammad Amaan (C), Nikhil Kumar, Hardik Raj, Harvansh Singh (wk), Samarth Nagaraj, Yudhajit Guha, Chetan Sharma. Japan U-19 XI: Nihar Parmar, Aditya Phadke, Koji Hardgrave Abe, Kazuma Kato Stafford, Charlie Hinze, Hugo Kelly, Timothy Moore, Kiefer Yamamoto Lake, Daniel Panckhurst, Max Yonekawa Lynn, Aarav Tiwari. Follow India U-19 vs Japan U-19 updates below",
    "image": "https://images.indianexpress.com/2024/12/India-vs-Japan-IND-U19-vs-JPN-U19-IND-U19-vs-JPN-U19-live-score-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-live-score-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-live-cricket-score-live-cricket.jpg",
    "image1": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
    "date": "2/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T09:22:39+05:30",
    "dateModified": "2024-12-02T09:22:39+05:30"
  },
  {
    "title": "How Arsenal have turned the previously-derided set-piece routine into a fine art and massive weapon",
    "link": "http://localhost:3000/sports/how-arsenal-have-turned-the-previously-derided-set-piece-routine-into-a-fine-art-and-massive-weapon",
    "siteurl": "http://localhost:3000/sports/how-arsenal-have-turned-the-previously-derided-set-piece-routine-into-a-fine-art-and-massive-weapon",
    "description": "Gabriel is at the forefront of Gunners' prowess at corners and free-kicks, masterminded by specialist coach Nicolas Jover.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Arsneal-football.jpg",
    "description1": "Two events foreshadow an Arsenal corner kick. The moment the referee decrees one, Gabriel, the strapping centre-back, ambles to the vicinity of the far post. On the touchline, manager Mikel Arteta, perennially on an emotional edge, slouches onto his seat in the dug-out; set-piece coach Nicolas Jover, with a twinkle in his eyes, veers onto the touchline. Two events often follow an Arsenal corner kick too. The soaring giant of a man, Gabriel leaping above his markers, sliding and stretching his neck as though it were made of rubber and heading the ball into the net. Jover would leap and swipe the air. Since the start of last season, Arsenal have converted more set-pieces than any other club (25 excluding penalties) in the Premier League. Gabriel, unsurprisingly, has netted more goals than any other centre-back since his arrival in the 2021-22 season (15, the next best Virgil van Dijk has scored nine times). It’s so frequent that their supporters buzz as though they have earned a penalty. The action — from the time the ball goes out and the corner is swung — barely takes half a minute. In this time, the players move to their designated positions, which vary from match to match. But the most common pattern features one of Arsenal’s players rubbing shoulders with the goalkeeper inside the six-yard box, giving a false impression that he is the intended target. He is rather the decoy, his only intention being to distract the goalkeeper, manufacturing space for the intended target (often Gabriel, but not always him, as it could become too predictable). Gabriel lurks on the edge of the six-yard box, on the left. Three of them usually hover behind him, inside the 18-yard box. They are the dummy runners, trying to clear out the far post area. When the ball swings in, they often move towards the ball, dragging markers to the near post. One or two might linger just outside the box and the rest stand behind them, to thwart any counter-attack. So far, it’s straightforward. The deliveries, Bukayo Saka from the right and Declan Rice from the left, are largely in-swingers fired either on the goalkeeper or to the back post. Some bend late into the goal; some don’t. It's then the intricate patterns set in a fury of limbs moving this way or that. The runners from deep in the box charge in, the shield dishevels the goalkeeper or the nearest defender (sometimes controversially, and a reason perhaps the more stringent referees of Champions League award a foul against them). Gabriel’s opening goal against West Ham United this week",
    "description2": "end was a classic instance, when Jurren Timber bumped into the back of Lucas Paquetá at the front post, denying him the space to jump and clear the ball. It swirled into the path of Gabriel, who hit the target. West Ham players rebelled for a lost cause. As have several other teams the last two seasons. Ben White tried to undo the gloves of Tottenham goalkeeper Guglielmo Vicario before one of the corner-kick goals. Keeping opponents guessing Whereas Gabriel’s movements have been similar - a shimmy to the right (when delivered from the right), an explosive leap as he scuds the ball goalward - the rest of their movements are unpredictable. Sometimes, they drift into the box like a swarm of bees. Sometimes, they scatter like a regiment after a drill. It’s synchronised chaos, so second-guessing their patterns becomes difficult. These are movements chiselled to perfection on the training ground under Jover’s watch. The coach, who joined Arteta from Manchester City after he thought he was not getting enough time to work on set-pieces with the champions, more reliant on open play than set-pieces for goals, polished their set-pieces with intense, opponent-specific drills. The onus is on specific runs to sharpen their movements. Players are given just two seconds to run into a specific point to receive the ball, with Jover insisting on repeating and re-repeating the action until it becomes second nature. The season before Jover took over, Arsenal had scored just six goals from set-pieces in the entire season. Arteta can’t stop praising him. “Him and the rest of the staff have injected the belief into the players that there are many ways to win football matches. This is a really powerful one and he has given us a lot,” he once said. Jover is not the pioneer in set-piece coaching, but its most efficient exponent. The 43-year-old Frenchman has never played competitive football, but after completing his sports degree in Canada, joined the French club Montpellier as video analyst, before camping with the Croatian national team as match analyst. It was at Brentford in 2016 that he assumed the role of free-kick specialist. This was around the time teams were starting to focus more on set-pieces than ever before rather than decrying its lack of aesthetics, even though 28 percent of all goals every season arrive in this fashion. Earlier, it was seen as the refuge of teams in the relegation zone (as Brentford was when Jover joined the Bees). But no team has mastered the set-piece art like Arsenal. At the heart of it is Jover.",
    "image": "https://images.indianexpress.com/2024/12/Arsneal-football.jpg",
    "image1": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
    "date": "2/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T08:50:08+05:30",
    "dateModified": "2024-12-02T08:50:08+05:30"
  },
  {
    "title": "How Bharat Arun helped Mohammed Siraj turn his form around by making him bowl yorkers",
    "link": "http://localhost:3000/sports/how-bharat-arun-helped-mohammed-siraj-turn-his-form-around-by-making-him-bowl-yorkers",
    "siteurl": "http://localhost:3000/sports/how-bharat-arun-helped-mohammed-siraj-turn-his-form-around-by-making-him-bowl-yorkers",
    "description": "IND vs AUS: It was Arun’s advice that would give Mohammed Siraj the confidence to forget about wickets and enjoy the process. Arun recalls the conversation at the end of the home Test series against New Zealand.",
    "thumbnail": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T195124.492.jpg",
    "description1": "The former bowling coach of India Bharat Arun was startled to hear Mohammad Siraj’s voice in a phone call. “He sounded a touch sad, down, then,” Arun tells this newspaper on a day where Siraj thanked Arun for a turnaround in his fortunes in Australia. At the end of the game against Prime Ministers XI at Canberra, Siraj talked about how he has “rediscovered the joy of bowling,” and how in the recent past he was “trying too hard to get wickets” and when it didn't come, it led to a vicious loop. Everyone mattered, he said, told him to not to over-stress about wickets and just bowl. Be it Jasprit Bumrah, who told him “don’t worry about wickets, it will come in due time. If it doesn’t, come to me.” Or Morne Morkel, the current bowling coach, who told him, “You are a warrior, don’t worry, just bowl,” Siraj recalled at the end of the PM XI game. But it was Arun’s advice that would give him the confidence to forget about wickets and enjoy the process. Arun recalls the conversation at the end of the home Test series against New Zealand. Siraj had been dropped from the second Test against New Zealand. “He told me that the ball was sliding towards leg, he wasn’t getting the swing and the seam position didn’t feel as ideal as before,” Arun shares. “I had been watching him and had noticed a few changes and asked him what he had been trying. In his pursuit of wickets, he had felt that he had to increase his pace, try to get more swing/movement and was putting more effort at release.” But all that had messed up with his original method. “The main problem as I saw it was his wrist wasn’t behind the ball, his most crucial weapon. In his effort to increase the pace, all these mistakes were creeping up. Perhaps he felt a bit rushed at the crease. What happens then is your body can also slide/tilt a bit more, especially if you are an open-chested bowler like him. That meant his radar was now going down,” he explains. “Without the wrist at the right place, the seam position too was getting affected. And instead of getting more movement that he wanted, the bowling was getting affected,” he adds. SIUUU-RAJ Arrives! 🫡#MohammedSiraj kicks off India’s wicket-taking spree, luring Renshaw into a well-set trap in the #PinkBallTest! 🤩 Rain has stopped play in the #AUSvINDonStar Warm-up match! Stay tuned to Star Sports for further updates! #ToughestRivalry pic.twitter.com/DZZTr53WGf — Star Sports (@StarSportsIndia) December 1, 2024 Simple plan Bharat, wh",
    "description2": "o has mentored Siraj through his first-class years, knows what will work for him. “It’s no use saying get the wrist behind the ball; when you are edgy and worried, all that doesn’t make sense. I know Siraj, he works best when you give him a simple bowling plan, a drill, say.” So, Arun told him in a subsequent conversation to aim at one stump, and keep bowling. “That’s the off stump, so to speak, and if he wants he can bring the ball from just outside or straight. Setting a simple target like that forces accuracy,” he details. “I then told him to bowl a lot of yorkers at that one stump. Now, this is not to improve his yorkers but to get the wrist in the right position behind the ball. You can’t bowl yorkers, good ones that is, without the wrist in the right position. If it’s tilted or out of shape, then the ball won’t go where you want it to go.” In the subsequent conversations, Arun says it was a happier Siraj who called him to say that the yorker plan had worked. “When the wrist is behind, the pace also increases automatically. The accuracy is a lot better, and you can actually then bowl what you want to bowl: be it the one that cuts back in or straightens,” he says. “I talked to Bharat Arun sir. He said this is what is happening with me. He had known me for a long time,” Siraj would say at the end of the PM XI. “ I have been bowling very well for the last six-seven months but I wasn’t getting wickets. As a human being, you start wondering why you’re not getting wickets. So just trying a little too hard to get the wickets led me to miss my lines and lengths a little. So I sat at home and thought about why this is happening to me.” That’s when the thought hit him that he should call his old coach Arun. The proof that the plan worked out would come in Perth, Arun knew. So he watched the game intently. “That Smith wicket in the second innings was the ideal Siraj for me. How much did it move? Not much. It’s not what he was trying to do when he was down and in poor form; he had wanted lots of movement etc. That’s not him, as in that’s not his bowling style,” he says. Subsequently, his shoulder didn’t fall away prior to release. “That helps the ball in straightening and when it did, Smith edged it. For Siraj, the main thing is the wrist behind the ball. That’s the sign; for him if that happens, it means other things are in place: he is not falling away, he is not pushing the ball down, and he is hitting the right lengths,” he says.",
    "image": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T195124.492.jpg",
    "image1": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
    "date": "1/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T19:55:34+05:30",
    "dateModified": "2024-12-01T19:55:34+05:30"
  },
  {
    "title": "World Chess Championship: How Gukesh courageously spurned chance to draw despite being in worse position vs Ding Liren",
    "link": "http://localhost:3000/sports/world-chess-championship-how-gukesh-courageously-spurned-chance-to-draw-despite-being-in-worse-position-vs-ding-liren",
    "siteurl": "http://localhost:3000/sports/world-chess-championship-how-gukesh-courageously-spurned-chance-to-draw-despite-being-in-worse-position-vs-ding-liren",
    "description": "World Chess Championship: The two combatants, Ding Liren and Gukesh, are tied at three points apiece going into second rest day of the showdown.\n\n",
    "thumbnail": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T193005.896.jpg",
    "description1": "For about 25 minutes in Game 6 on Sunday – which eventually resulted in a draw after 46 moves - Ding Liren spent his time on the board with feet dipped in the warm pool of false hope. The two queens had spent the last few moves waltzing in the middle of the board, their gaze locked at each other. Ding’s queen shuffled backwards and forwards on d5 and d6 squares, batting its eyelashes at its counterpart. D Gukesh’s queen seemed to be following its lead, moving between e7 and g5 squares. Then, when one more step on the g5 square would have solemnised a draw by threefold repetition - which would have seen both players head into the second rest day of the 2024 World Chess Championship at three points each – the Indian’s queen opted to swipe left. Instead of heading to the e7 square, Gukesh’s queen went to h4, rejecting the advances of Ding’s queen. The 18-year-old from Chennai had chosen to spurn his world champion opponent’s very evident draw offer. Gukesh was in no mood to down weapons this early. Not right before a rest day, at least. So instead of playing 26…Qe7 for the third time, he instead played 26…Qh4. Call it the heady optimism of youth, or just the opportunistic psychological prodding of a player who knows what his opponent wants, and is ready to suffer himself for as long as possible just so that the other player is denied what he craves. Ding threw a few accusatory looks at his opponent at this stage, as if the Indian teen had been leading him on. “I thought I might be slightly worse. I wasn’t sure if I was. With the files open in front of his king, I thought I had counterplay. I saw no reason to go for the repetition. Not like I was playing for the win or anything, but I just wanted to play a few more moves and see what happened,” Gukesh said nonchalantly at the post-game press conference. So when had Gukesh decided that he would not play for the draw? Was it the second time he repeated the moves? Or was it just before it was time to move the queen for the third time? READ MORE: At World Chess Championship, Ding not chilling. or having ice cream “When I moved it the second time, I had decided that I would not go for the draw,” he said. Gukesh was asked if this was a psychological ploy to get under Ding’s skin, to gauge the world champion’s intentions and then send a message that he was feeling up for a fight. “I just like playing chess, yeah?” smiled Gukesh. “It was more the position than a psychological thing. And I didn’t see too much danger fo",
    "description2": "r me.” INTERACTIVE: Game 6 between Gukesh and Ding Liren You can check out the move by move action from Game 6 between Gukesh and Ding Liren and also play along in the interactive below. Scroll down to read our updates in real time from Game 6. Contrasting approaches While Gukesh was living life on the edge, his mentor Viswanathan Anand was speaking in the FIDE commentary booth about how the 14-game World Chess Championship has played out thus far. “We’re seeing contrasting approaches. Ding is very solid with white. It's not like his ideas are lacking venom. But he’s not taking a lot of risks yet. Gukesh is pushing a bit more. But every once in a while, he stumbles. Yesterday, thanks to a miracle, he got away. Gukesh is putting more pressure, but needs to be more exact,\" Anand said about Saturday’s Game 5. Just as Anand had indicated, Ding was playing risk-free chess in Game 6. Gukesh was taking a devil-may-care approach that possibly would have made his backroom team squirm. After all, it’s the world chess championship. If you’re in a position to take a draw, while you’re in a worse position, you take a draw. But Gukesh was clearly not in the mood for that sort of logic. “Even in an inferior endgame, Gukesh is trying instead of opting for a draw… But he wins the respect of a lot of fans! ” tweeted chess legend Susan Polgar, who later added: “I would be super nervous playing black here. Not easy at all!” The game did end in a draw. The queens were traded by the 35th move, something Ding had been attempting to do as early as the 13th move, trying to throw his destroyer-in-chief on squares where both queens could be exchanged. But Gukesh resisted, before finally giving in. READ MORE: In contrast to inscrutable Gukesh, Ding Liren allows the world to see how he feels Just like in previous games, Ding had come out swinging on Sunday with his opening preparation. He blitzed his first 20 moves, spending barely seven minutes on them. In contrast, his teenage challenger was pushed into long phases of thought after the world champion employed the London System. Gukesh used up almost 53 minutes on his first 20 moves. At one point, Gukesh was trailing by as much as 45 minutes on the clock but managed to navigate himself out of trouble. But eventually, not just out-maneuvering himself out of trouble, he was also actively courting it in some phases. The result means that both players head into the second rest day of the world chess championship even on three points each.",
    "image": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T193005.896.jpg",
    "image1": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
    "date": "1/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T19:35:54+05:30",
    "dateModified": "2024-12-01T19:35:54+05:30"
  },
  {
    "title": "IPL Auction 2025: Meet 13-year-old Vaibhav Suryavanshi, rated highly by VVS Laxman, set to play for Rahul Dravid’s Rajasthan Royals",
    "link": "http://localhost:3000/sports/ipl-auction-2025-meet-13-year-old-vaibhav-suryavanshi-rated-highly-by-vvs-laxman-set-to-play-for-rahul-dravid-s-rajasthan-royals",
    "siteurl": "http://localhost:3000/sports/ipl-auction-2025-meet-13-year-old-vaibhav-suryavanshi-rated-highly-by-vvs-laxman-set-to-play-for-rahul-dravid-s-rajasthan-royals",
    "description": "IPL Auction: Aged 13 years, 243 days, Vaibhav Suryavanshi became the youngest player to be signed in IPL history as he cut a bidding war between the Royals and Delhi Capitals, the former ultimately securing him for Rs 1.1 crore.",
    "thumbnail": "https://images.indianexpress.com/2024/11/New-Project-63.jpg",
    "description1": "Vaibhav Surayvanshi was in an India U-19 team meeting ahead of their Asia Cup preparation when a member of the coaching staff broke the news to the 13-year-old that he had been picked by Rajasthan Royals in the IPL mega auction on Monday. Aged 13 years, 243 days, Vaibhav became the youngest player to be signed in IPL history following a bidding war between the Royals and Delhi Capitals, the former ultimately securing him for Rs 1.1 crore. \"I am speechless.I don't know what to say. It's a massive thing for our family. I had a gut feeling that he would get picked but never in my wildest dreams would I have thought that there would be a bidding war,\" Vaibhav's father Sanjeev Suryavanshi tells The Indian Express. The youngster grabbed eyeballs recently when he became the youngest batter (13 years, 288 days) to record an international century, scoring 104 off 62 balls in a Youth Test for India Under-19 against Australia U-19 in Chennai. The left-hander’s century came in 58 balls, making it the fastest Youth Test hundred by an Indian and the second-fastest overall in the world. \"Everything is coming as a flashback to me. I was a cricket tragic myself. But had to kill that dream when I moved to Mumbai at the age of 19 to earn money. I did a lot of jobs. I worked as a bouncer in a nightclub in Colaba, worked at a Sulabh toilet,\" recollects an emotional Sanjeev. \"All those 12 years I spent in Mumbai, I used to think when my luck would change. Now my son has made it a reality. I don't know what the future holds but after this, I won't have to borrow money from anyone for his cricket,\" he adds. Watch 13 year old vaibhav suryavanshi&#039;s quick fire 82 runs against Australia u19RR picks him for 1.10 Cr pic.twitter.com/7mMvKHtbvv&mdash; ICT Fan (@Delphy06) November 25, 2024 Suryavanshi first made headlines earlier this year when he made his Ranji Trophy debut for Bihar, aged 12, making him one of the youngest ever to play in India’s premier First-Class tournament. \"Cricket",
    "description2": " is coming back to Bihar. Ranji Trophy has returned. A budget of Rs 450 crore has already been passed to renovate Moin-ul-Haq stadium in Patna. And now Vaibhav has burst onto the scene. He will play for India in the future for sure,\" BCA President Rakesh Tiwari tells this newspaper. Sanjeev is happy that his son will be under the wings of his favourite player Rahul Dravid, who is now at the helm in Rajasthan Royals. \"Over the years, Royals have groomed the youngsters. Be it Sanju Samson, Yashasvi Jaiswal, Dhruv Jurel or Riyan Parag, all are products of the Rajasthan Royals franchise. I sincerely hope that Vaibhav will also follow the same path,\" says Sanjeev, who hails from Bihar's Samstipur district. Vaibhav's childhood coach Manoj Ojha, echoes the sentiments of Sanjeev: \"Perfect for Vaibhav. There is no better franchise for a youngster than Rajasthan Royals.\" \"VVS Laxman rates him very highly and monitors his development. He said last year that the next two years are going to be very crucial for Vaibhav. If someone like VVS Laxman is praising him, then there must be something special in the kid,\" says Ojha. In five Ranji Trophy matches Vaibhav has played, he is yet to set the stage on fire. He has managed only 100 runs with a highest score of 41 against Madhya Pradesh. However, on Saturday, making his debut in the Syed Mushtaq Ali Trophy in Rajkot, he smoked Rajasthan's left-arm pacer Aniket Choudhary for two sixes before being dismissed for 13 off six deliveries. The one thing that worried Sanjeev was how his son would deal with all this price tag pressure. \"Money is good. Whatever I get, it will go in his fix-deposit. But my biggest fear is how he will deal with this situation. I am yet to have a word with him. I will talk to him and will make sure that this IPL auction doesn't get into his head, he still has a long way to go,” the father says. Vaibhav will be in action for India U-19 in their Asia Cup match against arch-rivals Pakistan on Saturday in Dubai.",
    "image": "https://images.indianexpress.com/2024/11/New-Project-63.jpg",
    "image1": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
    "date": "25/11/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-25T23:03:57+05:30",
    "dateModified": "2024-11-25T23:03:57+05:30"
  },
  {
    "title": "India vs Australia: Why the Perth Test win be remembered as a triumph of India’s youth",
    "link": "http://localhost:3000/sports/india-vs-australia-why-the-perth-test-win-be-remembered-as-a-triumph-of-india-s-youth",
    "siteurl": "http://localhost:3000/sports/india-vs-australia-why-the-perth-test-win-be-remembered-as-a-triumph-of-india-s-youth",
    "description": "India vs Australia: Kohli, Bumrah and Rahul performed their roles, but as significant were the contributions of Jaiswal, Reddy, Rana and Jurel, who showed they belonged to this level",
    "thumbnail": "https://images.indianexpress.com/2024/11/IND-AUS-3.jpg",
    "description1": "India vs Australia: Sometime in the afternoon at Perth, Fox Sports showed a split-screen visual. On the right side of the frame was Nitish Reddy running into bowl. On the left was one of the world’s greatest fast bowlers Dennis Lillee steaming in. Perhaps, they saw some similarity in the load-up of the left leg. Or perhaps Australia has gone all soft in lionising India. “What the hell is that? Why is that kid shown with Dennis; he is not even India’s main-line bowler, is he?,” an elderly lady scorer, who has seen Lillee terrorising batsmen, exclaimed in shock. In some ways, the visuals were apt: the question before the series was whether India’s youngsters can perform in alien and hostile Australian conditions. Within four days, one of them has been propped up next to a pace legend. How quickly can things change? Nothing went against the script on the final day, with India downing Australia, overnight on 12 for 3, for 238. Only Travis Head crossed 50; he made an attacking 89 before Jasprit Bumrah, the man of the match, ended his stay. “When you lose a Test like this, there is a lot of hurt in the change room,” Pat Cummins said at the end. Conversely, when a team wins after being bowled out for 150, the feeling is one of pride. “I am very proud,” Bumrah talked about how he enjoyed being a captain and about his team. Everything that India wished went in their favour, after that 150 all out at tea on the first day. The youngsters showed they belonged: be it Harshit Rana, who possibly produced the ball of the match when he knocked down the off stump of Travis Head, a game-turning moment in the first innings. Be it Nitish Reddy whose plucky 41 in the first innings gave the Indian bowlers something to work with, and whose breezy 38 in the second allowed Virat Kohli the room to not worry about doing it on his own when declaration was around the corner. Be it Jaiswal, not a debutant but whose second-innings hundred reflected such maturity in the way he took his time (when he crossed his fifty, it was the slowest he had ever taken off 123 balls), that Bumrah too made a point to mention about that initial phase he kept leaving the ball. Or be it KL Rahul, who showed such reassuring form in both innings and in the way he mentored Jaiswal in the se",
    "description2": "cond. Even the relative non-performances with the bat of Dhruv Jurel, who took the catch of the game with a stunning reflex pouch at short-leg to dismiss Mitch Starc in the second innings, and Devdutt Padikkal who wasn’t too bad, means selection headaches for India with Rohit Sharma, who had a batting stint at Perth nets against the pink ball, and Shubman Gill returning for the second Test. Discipline and thinking On Monday, yet again India’s discipline and thinking stood out. They tailored their bowling according to the demands of the up-and-down pitch, and according to the batsmen. Usman Khawaja, who likes to pull off the front foot, was thrown a sucker short ball but outside off by Mohammad Siraj. Perhaps the ball didn’t come on at the pace he expected and allied with the fact that he was fetching it from outside off, a top edge resulted which was taken by Rishabh Pant. India also didn’t allow Steve Smith to return to form before the second Test. After initially looking confident, he was slowly nailed to the crease, and Siraj induced an edge with a straightener outside off stump. Mitch Marsh was made to sweat hard for his 47 as Bumrah hit his body a few times with carefully curated slower cutters. In the end, Nitish Reddy took him out, again the pitch playing a part with an inside-edge on to the stumps. It was during that spell that he found himself alongside Lillee on international coverage. Nathan Lyon was foxed with a lovely straightener on the off stump from Washington Sundar and lost his off stump. Even the end was noteworthy. Rana, who had impressed many with his pace, bouncers, and control, slipped in a cool slower ball to take out a stubborn Alex Carey. Bumrah and KL Rahul picked stumps and just when it seemed there might be big celebrations, Indians turned quiet. Gentle handshakes, hands around each other’s shoulders, taps on the back - and they were off. Almost as if it was just another day in the office, and not one of the biggest days in Australian soil. In 2021, they bounced back from the depths of 36 all out with a memorable win in Melbourne. But here, in 2024 Perth, they have bounced back in the same Test they were tottering after the nightmarish first innings. There is nothing ordinary about this extraordinary triumph.",
    "image": "https://images.indianexpress.com/2024/11/IND-AUS-3.jpg",
    "image1": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
    "date": "25/11/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-25T16:45:55+05:30",
    "dateModified": "2024-11-25T16:45:55+05:30"
  },
  {
    "title": "Perth Test: India’s winning (in Australia) habit continues",
    "link": "http://localhost:3000/sports/perth-test-india-s-winning-in-australia-habit-continues",
    "siteurl": "http://localhost:3000/sports/perth-test-india-s-winning-in-australia-habit-continues",
    "description": "The turnaround from Day 1 wasn't about clinging on and clawing back, but a resounding stomp of intentful aggression as the home side capitulated by 295 runs.",
    "thumbnail": "https://images.indianexpress.com/2024/11/India-vs-Australia.jpg",
    "description1": "On the eve of the series-opener in Perth, just before the Border-Gavaskar trophy unveiling, Jasprit Bumrah was excitedly chatting about his son with Australian captain Pat Cummins. He would return to his kid at the end of a sensational come-from-behind win. “My young son was in the stands. He was also there at the T20 World Cup win. He won’t know anything now, but I now have stories to tell him when he grows up; how he was there during special Indian wins.” For a particular generation of older fans, to experience India playing cricket in Australia in the last decade has been a sweet erasure of a torrid past. In 2014, they stood up to Australia; in 2018, they knocked down Australia; in 2021, they seemed on the mat, but conjured a triumph for a lifetime. This 2024 series started like a bad dream, a whitewash at home, absences of key players, doubts about the new management’s working relationship with players. On the first day in Perth India crashed and burned — 150 all out in four hours on a bright sunny Australian day. Yet, within that day, the turnaround had begun, and that was not just consolidated over the next three days but an utter domination was achieved as India wrapped up the first Test in Perth in some style: a 295-run win, India's biggest in terms of runs in Australia. Bumrah would nail down the turning point moment as the one that came after the lowest moment in the Test. “The most positive thing was when we were out for 150. There was no one in the dressing room who was down. They believed that if we could get out like that, we could do the same to them. My only message to the team was not to get too desperate as sometimes bowling teams can do that after getting bowled out cheaply. I told them there was enough on the pitch if we hit the right areas.” Aptly, a debutant helped apply the final seal of victory. Harshit Rana, who had sparkled in the first innings, too, produced a crafty slower ball to castle the stumps of Alex Carey to trigger celebrations. By the time stand-in captain Bumrah could get to the stumps at the non-striker’s end, KL Rahul, whose partnership with Yashasvi Jaiswal in the second innings had set up a huge target, had plucked out two stumps, and he gave one to his skipper. Rana had by then gone on to hug Virat Kohli, who later walked away with Bumrah with their hands around each other’s shoulders. It was a job well done. On the fourth day, only Tra",
    "description2": "vis Head offered resistance with a fine 89, even as India rammed through the rest to seal a special win. Last time around in 2021, they had taken the first-innings lead in the opening Test at Adelaide but collapsed for 36 in the second innings to lose that game. No such mistakes this time around. It’s one thing to hang in there, slowly claw back, grit out a bruising fight-back after being down by tea on opening day, but India decided against that old romantic sporting cliche; instead, they chose to boss and own Australia. Time will tell how the rest of the series goes but this performance has now cancelled out all pre-series fears of a one-sided contest. Josh Hazlewood had given up the ghost on the third evening itself when instead of any brave talk of fightback, he said he hoped a couple of batsmen would get to 80 or 100, and tire down the Indian bowlers a bit. One of those batsmen, and a very important one for Australia if they are to bounce back in the series, was Steve Smith. Especially after Usman Khawaja went early, trying to pull a Mohammed Siraj short delivery from outside off, top-edging it to Rishabh Pant. Smith was sorted out by Bumrah for a first-ball duck in the first innings when he had pressed back far too early, and couldn’t get his wrists to effect the jail-break for him. On Monday, on a track that was playing up-and-down, his task was that much more arduous. He did try gamely, trying to play straight. As his innings progressed though, he began to get stuck at the crease, and his hands were doing all the contortions to keep him out there. But then came a length ball from Mohammad Siraj in the off-stump channel and Smith, not only stuck at crease but on his toes almost jammed together, and pushed out his bat to snick it behind. Head did what he usually does to India: slash, carve, smash, swat. And Bumrah brought himself back to end his stay with a straightener outside off that caught the outside edge of an attempted forcing punch shot and flew through to Rishabh Pant. With it, the Australian fight faded out of the arena rather quickly but not before Dhruv Jurel produced the catch of the game, plucking one out of thin air at short-leg to get rid of Mitch Starc. A little later, when the victory was sealed, a digital advertisement flashed around on the first tier of the stadium: \"Do Great Things\" . They could have added \"like India\" – to capture some ground reality.",
    "image": "https://images.indianexpress.com/2024/11/India-vs-Australia.jpg",
    "image1": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
    "date": "25/11/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-25T13:53:11+05:30",
    "dateModified": "2024-11-25T13:53:11+05:30"
  },
  {
    "title": "Manchester United manager Ruben Amorim’s game plan needs dynamic and younger players for its success",
    "link": "http://localhost:3000/sports/manchester-united-manager-ruben-amorim-s-game-plan-needs-dynamic-and-younger-players-for-its-success",
    "siteurl": "http://localhost:3000/sports/manchester-united-manager-ruben-amorim-s-game-plan-needs-dynamic-and-younger-players-for-its-success",
    "description": "Ruben Amorim was pragmatic after the 1-1 draw against Ipswich Town; “We are going to suffer for a long period,” he said after the game.",
    "thumbnail": "https://images.indianexpress.com/2024/11/Ruben-Amorim-2.jpg",
    "description1": "In his first show as Manchester United manager, a draw at Ipswich Town, Ruben Amorim didn’t shed too many emotions. He smiled faintly when United scored just 82 seconds into the game, a goal that owed to his tactical rejig. With brown brooding eyes he watched his team fluctuate between energetic and erratic, bouts of purposeless possession dotted with spells of confusion. His reactions on the touchline were mild, no frantic gesturing, no guttural carnage of instructions, no pacing up and down the technical area, or no busy jot-notes. How long the facade of calm would last, or how long before his nerves begin to snap has to be seen. The reeling, flailing club could make Mahatma Gandhi take up arms; or Mother Teresa lose her patience. Even before joining the club, he would have realised the extent of his task, the burden he has embraced. He would have sized up his team’s defects in the training sessions during the international break and by talking to the support staff, but watching them in a full, live match would have offered a clearer, broader picture of the unforgiving mission he had signed up for. “We are going to suffer for a long period,” he said after the game, matter-of-factly and not with grimness. The refreshing bit of the admission was his honesty. He is not delusional enough to project himself as a miracle healer. He has not promised titles and trophies, he has not proclaimed to knock Pep Guardiola off his perch, a verbal faux pas of his predecessor Erik Ten Hag. A tenacious midfielder in his playing days, he sounded realistic and pragmatic. Instead, he dwelled on his “idea” of playing the game. “I think you will see an idea. You would like it or not, I don’t know, but you will see an idea. We will have problems, the players will be confused sometimes but we have to address the new idea and try to be better for this stage next year,” he explained. The new “idea” is a back three, two wingbacks lurking on the touchline, a staggered central midfield pair, two No 10s pulling the string behind a classical No 9. The formation, when employed with the right men could be both dynamic and sturdy, offer goals and defensive stability. But United don’t have the men to make this system work. It requires untiring legs and lungs at the heart of the midfield. Amorim paired Cristian Eriksen and Casemiro, both ageing and slow, their best days long gone. Once Kobbie Mainoo returns fully fit from his injury and Manuel Ugarte internalises the tune and tempo of the league, they could form a more potent duo. The Eriksen-",
    "description2": "Casemiro duet was never going to work against an aggressively pressing Ipswich Town. They cut swathes through the United midfield. But Amorim didn’t flinch from his trusted methods, even though he knew the inherent risks. He didn’t possess the right men in his three-man defence. It made Jonny Evans, 36, look his age. He was slow and ponderous, culpable for Ipswich’s equaliser, a couple of mistakes redeemed by the reflexes of goalkeeper Andre Onana. Matthias de Lit is not the quickest around. Neither are the back-ups Harry Maguire and Victor Lindelöf. Apart from the injury-savvy Lisandro Martinez, none of them possess the bark and bite that Amorim loves in his back-line. “It is not a system or formation, it’s like the character of the players, the way they see the club that matters the most,” he said. Striking the balance would be key in the first season, where he has to work with the men at his disposal, even though they don’t blend in with his formula. The incoherence at Portman Road thus was understandable. But there were green shoots of promise too. When rhyme and rhythm sync, their forward line could be exhilarating to watch. Two-touch passing was marvellous at times, Bruno Fernandes relished his newfound freedom, the wingbacks Amad Diallo and Diogo Dalot buzzed and channeled their creative forces. Diallo could emerge as the most important player in his side. For the opening goal, his deft and precise passing with Fernandes freed up space upfront, he was so quick that he took out two defenders, freeing up Dalot, Garnacho and Rashford, who eventually scored. It was a glimpse into the bright, brave world Amorim promises. There were other positives too. The short, slick quick passes in the buildup were effective when they came off. The press was aggressive to start with. Two-touch passes were delicious at times. But United could sustain none of these throughout the 90 minutes. With refinement, their passing could be top-notch; with fitter players, their press could be relentless. Amorim has been emphasising on physicality, and deeper into the season, United could shed their soft-as-pudding disposition, especially when defending. The coordination would also improve once they get used to the new conductor. But most importantly, they have a gaffer who is not deluded by the past glories; realistic enough to admit that his team is in for a tough time in the coming months of flux; humble enough to not shout war-cries and wise enough to offer hollow promises, but brave enough to stick to his ideas and convictions.",
    "image": "https://images.indianexpress.com/2024/11/Ruben-Amorim-2.jpg",
    "image1": "https://indianexpress.com/wp-content/themes/indianexpress/images/default-ie.jpg",
    "date": "25/11/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-25T12:49:55+05:30",
    "dateModified": "2024-11-25T12:49:55+05:30"
  },
  {
    "title": "SA20's next decade: Predictions from Graeme Smith, Dinesh Karthik, Mark Boucher",
    "link": "http://localhost:3000/sports/sa20-s-next-decade-predictions-from-graeme-smith-dinesh-karthik-mark-boucher",
    "siteurl": "http://localhost:3000/sports/sa20-s-next-decade-predictions-from-graeme-smith-dinesh-karthik-mark-boucher",
    "description": "SA20's next decade: Predictions from Graeme Smith, Dinesh Karthik, Mark Boucher",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202083428.jpg",
    "description1": "\n\n\nJohannesburg [South Africa], December 2 (ANI): As the SA20 league continues to grow, prominent cricket figures Graeme Smith, Dinesh Karthik, and Mark Boucher share their perspectives on where they see the league in the next decade. Their insights highlight the potential and ambition driving the tournament forward.\nGraeme Smith, the League Commissioner of SA20, reflects on the league's future with cautious optimism at SA20 India Day.\n\n\"I think 10 years is always tough to predict. But I think if we can follow at a level the same curve as IPL, that would be amazing,\" he said, as quoted by a release from SA20.\nSmith emphasized the importance of captivating fans in a competitive entertainment landscape.\n\"There's a lot of options for fans in today's world. We want to make sure that in our window that people are excited and tune in every year to see what SA20 is doing like they do with IPL, Premier League, football and others. We want to be one of the most established leagues and biggest outside India,\" he noted at SA20 India Day.\n\n\nIndian cricketer Dinesh Karthik envisions greater involvement from Indian players in the SA20 league over the next decade. He acknowledges the current BCCI policy but expresses hope for future participation. He is also the India Ambassador of SA20.\n\"In 10 years down the line, I can say that o",
    "description2": "bviously there is a policy in BCCI and everyone is adhering to that policy. But I hope I'm the first number to come out and play this league because I can definitely share my experience post the league how it was on a personal front,\" Karthik stated, as quoted by a release from SA20.\nHe highlighted the league's potential to enhance players' skills and financial stability.\n\"At the end of the day, all active players are looking for two things. A) How do I get better as a player? B) Financially, how is it viable? And on both fronts, I can confidently say that this segment is at a place which is definitely helping every player who is part of it,\" he said at SA20 India Day.\nMark Boucher, who is also the ambassador of SA20 league, also sees a bright future for the tournament. He draws parallels with the IPL's successful model, suggesting that SA20 could expand in a similar manner.\n\"I think to answer that as well, the template there and what the IPL has done. And you've got IPL owners involved in SA20 as well. So 10 years down the line, who used to say that there won't be another 4 or 5 teams? The template is there and it has certainly worked. So as long as SA20 carry on the same template, following the IPL, with the IPL owners, who's to know, I think it's going to be very successful,\" Boucher said, as quoted by SA20. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202083428.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 12:10:36 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  }
  
]