[
  {
    "title": "India don’t fear pitches, pace or bounce… have found a way to win in Australia, says former fast bowler Ryan Harris",
    "link": "https://worldsnews24.vercel.app/sports/india-don-t-fear-pitches-pace-or-bounce-have-found-a-way-to-win-in-australia-says-former-fast-bowler-ryan-harris",
    "siteurl": "https://worldsnews24.vercel.app/sports/india-don-t-fear-pitches-pace-or-bounce-have-found-a-way-to-win-in-australia-says-former-fast-bowler-ryan-harris",
    "description": "Ryan Harris also says that speculation of factions in the Australia team is 'just garbage'. \"I have all the respect for Mr Gavaskar but he's just throwing a little grenade over here and the media are having a feast.\"",
    "thumbnail": "https://images.indianexpress.com/2024/12/New-Project-2024-12-05T004202.976.jpg",
    "description1": "Former Australia fast bowler and South Australia coach Ryan Harris believes the current generation of batsmen are not as technically sound in Test cricket because of T20s but says the shorter version of the game has contributed to teams trying to make runs faster. The 45-year-old also talks about the paucity of openers in Australia, why India has done well in Australia and dismisses speculation that the Australian team is faction-ridden. Excerpts. That ball to Alastair Cook in Perth (2013). Do you still watch it? Yes it still pops up on my TV now and then. mostly every year around October for my birthday. To this day I am not sure how I bowled that ball. I've been trying to bowl one of those balls for probably 15 years before that. It was just unique in how it sort of pitched and then moved a bit after it pitched and was able to just hit that bail. It's very nice that people still remember it. As good as it gets! 🔥Ryan Harris&#039; wonderball to Alastair Cook is the worthy No.1 in our countdown of the best #Ashes deliveries in Australia since 1990. pic.twitter.com/FgcNdCozJM&mdash; cricket.com.au (@cricketcomau) December 7, 2021 Pink ball, how is it different from red? The way I understand it, it's more of an artificial colouring. So it's not known to last as long as, say, the red ball. We just completed a South Australia versus Western Australia game at Adelaide Oval last week. And it was a day-night game. And the ball didn't seem to go as soft as it probably has in the past. So there's been a lot more work done on the pink ball. It used to flake off with the colouring. That didn't happen last week. For us it swung around and nipped around for around 15-20 overs. But after that it did flatten out a little bit. The middle overs is where the batters can definitely cash in. What the wicket looks like and how much grass is kept on it will be determining factors. Are the current batsmen less competent than they were in your days? Yes. I believe the techniques of batters probably aren't as good. There seems to be the mentality of hit out or get out and not stick around. I think T20 has probably caused that. In a good and a negative way. The Virats, the Smiths, they'll dig in because they're that good. Whereas the younger guys will probably go, 'I might as well try and hit one before it gets me'. T20 has helped the game of Test cricket because we've seen the scoring rates go up and we've seen 350 to 400 scored in a day. But I think technical stuff is not as good. And I see it probably in the Australian youngsters. Whacking the ball is probably more of a priority over trying to master a good technique or a good defence. Was it unfair on Nathan McSweeney that being a middle-order batsman all his life he had to open the innings at Perth? I think he's got the game to be at the top. He is technically sound and has the temperament and mindset to excel at this level. I've seen it first-hand. He can handle Test cricket. Is there a lack of openers in Australia? Yes, to an extent. We've got two openers that have been making runs for a number of years — Marcus Harris and Cameron Bancroft. And the selectors seem to have given them a go and aren't happy. So they're obviously not really keen to go back to them. So the idea now is to try to find the next opening pair. Hopefully, Uzzy (Usman Khawaja) will go through this series and gets onto the Ashes. We've got another young kid Sam Konstas in New South Wales who has scored a century for PM XI. I don't believe he's ready yet. Everyone's saying, throw him in. But once they throw him in and he fails twice, then they'll say, 'oh no, now we put him in too soon'. Let Sam make four or five hundreds in two seasons. I think he's not going to do that when he's worrying about his place and worrying about who's bowling at him in Test cricket. How do you rate the quality of fast bowl",
    "description2": "ing in this series? I think it's the battle of the bowlers in this series, Obviously, the batsmen have got to get runs, but it's the battle between the bowling units. Bumrah stood up in the first Test. Will Australia be able to bounce back? You don't like being upstaged in your own country. Pat Cummins is a fighter. He's a perfectionist. And you know, he'll be asking his players to step up in this Test match. So, there's no doubt that Cummins will be looking to bounce back and make sure that the plans are a bit better and tighter. Do you think India has cracked the code of how to win in Australia? They have, no doubt. I mean West Indies drew the series last year but we haven't lost any other series except to India. So there's no doubt that India have found a way to win. They don't fear the pitches. They don't fear the pace. They don't fear the bounce. And they've obviously done a lot of homework. Is there a faction in the Australian cricket team? Look, there are no factions. That's just all garbage. I've even heard Mr (Sunil) Gavaskar coming out and saying there's some faction. That doesn't happen in Australia. I know it happens in India. I've lived there. The Australian media have jumped on it, because we went so bad in Perth. But you're allowed to be outplayed. What the Australian media and people have got to realise is that India have won here the last couple of times and they're a very good team. I have all the respect for Mr Gavaskar but he's just throwing a little grenade over here and the media are having a feast. Is wrist position more important for a swing bowler than the sideway action? That's a good question. For me, it was the wrist position. Trying to get my wrist as much behind the ball as possible. And then also, if my swing gets down, I can live with it. When I jump in my action, I cock my wrist back so I can give that ball a really good flick. That, for me, was the main thing. How did you develop a wobble seam? For me, it was more about trying to keep the seam as straight as possible or on a slight angle to get the ball moving where I want it to go. I wasn't a big fan of the wobble seam. We see Mitchell Starc and Josh Hazelwood do a lot of that (wobble seam). My wobble seam was. I didn't grip my wrist right so the ball would come out wobbly. I wasn't trying to bowl a wobble seam at all. Ultimately, I'm trying to swing the ball as much as I can both ways. Who has the most beautiful seam position in modern day? Mohammad Shami has this beautiful upright seam position, wrist position. I've spent a year with Shami at Kings XI Punjab (now Punjab Kings), played against him, and to me, he's unreal. He runs in fast and delivers the ball as fast as he can, but he's able to do it with a beautiful seam, beautiful wrist. It's a beautiful length. Do you think you, at some point in your career, you've achieved the ideal wrist position? Yeah, I think I did. With the risk of sounding arrogant, the majority of my Test career, I felt as though my action and my wrist and my arm and everything felt really good. I was able to execute a lot of the balls that I was trying to bowl. For that to happen, you have to be in a really good place with your action.It was probably only in the last six months of my career that I was struggling with my body a bit. I felt as though I was losing a bit of that. But then I had a second wind when I went away and had a bit of a break, and then did some training and found that again. You have played only 27 Tests. Do you have any regrets? I wish I had probably trained a little bit harder, a little bit earlier in my career, to allow me to play longer. Playing 27 Tests was still an unbelievable thing for me. I thought I would never play Test cricket, if I was ever going to play for Australia, it was always going to be probably ODI, or T20 cricket, but playing 27 Tests is fantastic.",
    "image": "https://images.indianexpress.com/2024/12/New-Project-2024-12-05T004202.976.jpg",
    "image1": "",
    "date": "5/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-05T08:05:54+05:30",
    "dateModified": "2024-12-05T08:05:54+05:30"
  },
  {
    "title": "What happened to Virat Kohli’s nameplate during 2011-12 series? At Adelaide Oval, century-old scoreboard tells glorious cricketing tales",
    "link": "https://worldsnews24.vercel.app/sports/what-happened-to-virat-kohli-s-nameplate-during-2011-12-series-at-adelaide-oval-century-old-scoreboard-tells-glorious-cricketing-tales",
    "siteurl": "https://worldsnews24.vercel.app/sports/what-happened-to-virat-kohli-s-nameplate-during-2011-12-series-at-adelaide-oval-century-old-scoreboard-tells-glorious-cricketing-tales",
    "description": "Simon Crompton, in charge of the iconic scoreboard at the South Australian ground, relives glorious stories of cricketing legends and explains how he identifies cricketers based on their gait to manually update the board",
    "thumbnail": "https://images.indianexpress.com/2024/12/veera.jpg",
    "description1": "“The old lady doesn’t miss a beat!” Simon Crompton is referring to the 100-year-old Adelaide Oval scoreboard that still functions at the refurbished stadium. “That’s what we call her: old lady.” The only scoreboard in the world that has bulbs that light up to point out the fielder who has taken a blinder, dropped a catch or stopped a ball. Crompton and his five-man team’s hard work is mind-boggling: from being able to identify the fielders based on their gait to shuffling up and down four flights of stairs to change the names in the board, cramped in a space that is barely three-foot wide and seven-foot tall. But before we detail his painstaking work, the glorious stories about the cricketers from Don Bradman, Keith Miller, Joel Garner or what happened to Virat Kohli’s nameplate after the 2011-12 series in Australia is perhaps the best place to start. It begins with a 12-year-old Simon who had just walked from church into the Oval along with his parents to watch a game. As he sat and looked up, he saw Ian Chappell drop his pants and “moon” Bradman who was at the ground. It was the time when Chappell was the Australian captain and was warring with the establishment figure Bradman over player wages and such. “My father immediately covered my eyes!” Simon became friends with the Test cricketer Rodney Hogg, a “mad fast bowler”, and through him entered the world of cricketers. “I remember walking to a hotel and every Australian player from Allan Border to others sitting in rapt attention around a handsome man. It was the flamboyant all-rounder Keith Miller, telling stories about his friendship with the royal family in England, and other stories from his cricketing tours. Unfortunately, I can’t share those colourful tales,” Simon says with a laugh, “You understand, don’t you? Will tell you this one time though, decades after he retired and when he was in his 70s, Keith came to a Test match. Probably, against Pakistan. Keith loved his drinks, mingled socially with the club members, and thought it best to stay here overnight. So, right through that Test, there was actually a caravan inside the ground, not far from the scoreboard, where he would wear off long nights at the bar and sleep off. The next morning, a change of clothes, and he was at the cricket! For no other cricketer, I can imagine the authorities doing that at Adelaide Oval.” Through Hogg, Simon became the designated driver of the West Indian pacer Joel Garner when he came to play for South Australia in the Sheffield Shield cricket. “Hoggy told me that he can’t go out with Joel; his marriage would end!” Simon laughs. “And I found out why, as Joel loved to party all night. Many nights. Forget the women, even the cops were in love with him. The only time Joel ever drove the car, we were stopped by the cops who saw him as he rolled down the window, and mumbled out, ‘Oh Mr Garner! Carry on please!’ No breath analyser, nothing! Joel came to Australia recently and came to visit me. It felt good. No parties this time, though!” Simon is still in awe of that great West Indies team. “I know Australia won 16 Tests in a row under Steve Waugh and were a tough-as-nails team under Chappell earlier, but no team came close to the aura, swagger, style, and personas of that West Indies team. They were quite something.” He gets a vantage point via a small opening at the scoreboard to peer through his binoculars. B",
    "description2": "ut it’s not an easy job; whether the cricket, not just international but domestic too, is interesting or not, he has to watch every ball, keep flicking the bulb switch to light up the fielder’s name. Crompton doesn’t trust anyone with the job of recognising the fielder. “I don’t look at their faces so much, I watch their gait.” He does furious homework and shows his notes about the current Indians. Nitish Reddy has an identifiable gait? “Yes of course. With some Indians, I look at the soles of the shoes, there is a flash of a logo or something. Or the tattoos if any. You can’t rely on numbers on the back as a jumper or a wrong jersey can also be worn. So, I focus on the gait. I watch their training closely, watch YouTube videos of visiting teams these days, spot little things, keep it in memory.” Even the change of scores of batsmen is counter-intuitive. “If Kohli hits a four on 47, I am not changing them to 51. But actually, I am doing 15. You see, from where we sit, it’s all in the reverse. 47 is what the spectators see, so every number we are calculating in reverse!” It’s a tiring job that the youngsters find difficult to do. “I have had many young people try out, but give up quickly. We are all old men right now manning her.” He isn’t sure how long he will carry on and what will happen once he leaves. “I will do the next year’s Ashes for sure. After that, I am not sure. I will be 63 then, and frankly, it’s going to be difficult to find someone to handle it. Perhaps, we might have to stop lighting up the fielders, that kind of focus and concentration on every ball, all day for five days is not going to be easy.” Perhaps, Simon's love affair with cricket was almost destined, considering the cricket-tragic father, who had retired as a domestic umpire. \"There was this one time when he was driving my mother and my newborn sister from the hospital back home. He was crossing the Oval when he spotted a South Australia game was on. He stopped the car, saying he would check the score and come back. The match must have been interesting as he wanted to see the full game. But my mother had to breast-feed the baby and it wasn't legal to do it in cars and in public in those days. So, he actually takes her to a corner of the hill, in the stands, and as the baby is being fed, he continues to see Bill Lawry-led Victoria team vs SA,\" Simon shakes his head and laughs. \"He would have loved to see this Indian team packed with such superstars like Virat Kohli.\" For the Australian home public, Kohli first hit arc lights in the 2011-12 tour here, the series where he flipped the middle finger at the crowd rallying against him in Sydney. Simon cues up a tale about Kohli from the last Test at Adelaide. “All through that game, there was enough drama and heat between him and the Australian players. Relentless sledging from both sides; in particular a couple of Aussie players and him. I watched it all closely through my binoculars. It was the last Test of the series and Australia retained the Border-Gavaskar Trophy. “At the end of it, the Australian players came over to scoreboard space to celebrate with a few drinks and sing their team song of ‘Under the Southern Cross’. I left them alone. A few hours later, when I returned, I saw the nameplate of Kohli away from the rest of the pile, at a distance, and let’s say, a bit roughed up!” The old lady never misses a beat, indeed.",
    "image": "https://images.indianexpress.com/2024/12/veera.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T13:37:59+05:30",
    "dateModified": "2024-12-04T13:37:59+05:30"
  },
  {
    "title": "Why Scott Boland will be a massive threat for Indian batsmen in pink-ball Test",
    "link": "https://worldsnews24.vercel.app/sports/why-scott-boland-will-be-a-massive-threat-for-indian-batsmen-in-pink-ball-test",
    "siteurl": "https://worldsnews24.vercel.app/sports/why-scott-boland-will-be-a-massive-threat-for-indian-batsmen-in-pink-ball-test",
    "description": "Pink-ball Test, IND vs AUS: Former Australian fast bowler Ryan Harris on the strengths of his ilk, who are battling it out in the ongoing Border-Gavaskar Trophy.    \n",
    "thumbnail": "https://images.indianexpress.com/2024/12/New-Project-2024-12-05T011100.049.jpg",
    "description1": "Former Australian fast bowler Ryan Harris on the strengths of his ilk, who are battling it out in the ongoing Border-Gavaskar Trophy. Pat Cummins: His strength is being relentless at the batsman. Being consistent in execution. He leads his bowling group and leads his team very well. You know, he had a bit of time off. I think he'd only played one game heading into the Perth Test. He looked a little bit rusty, he wasn't as consistent and didn't execute as well. But I think now having those overs under his belt, we'll see the world-class Pat Cummins that we know. Mitchell Starc: He started off really well in the first Test. Australia just let it slip with the bat. I think Starc was really good. He bowled fast. When he is bowling in the mid 140s and he's swinging the ball. That tells me Starc is in a really good position and if he's in that position he's very dangerous. He's made a career out of it. Josh Hazlewood: A few people have said that he is very close to what I was. But he's a little bit taller than me. His strength is being able to hit the off stump line, a bit like Glen McGrath. He's very good at just hitting the same spot over and over again. And with that height, he generates that steep bounce as well. Scott Boland: Scotty is really good with the pink ball. He'll come in and test the Indian batters. He hits the right length, the ideal length in Australian con",
    "description2": "ditions. He has got that nip-backer as well. He will be a massive threat for the Indian batters. Jasprit Bumrah: With that kind of an awkward action, he is a menace. But there's a couple of other things as weLL. I think another unique part. just watching some analysis from that first Test and a lot of batters were talking about the release point. His release point is a lot further forward. I don't know, it might be 40 centimetres, it's a lot later than a traditional bowler's and it makes a huge difference. While releasing the ball, he's almost in front of the front crease. When you've got a guy bowling in the high 140s and he's so skillful with moving the seam in and out, swinging it, that extra split second of time, it creates doubt in the batter's mind. It's not only the unique action, but the release point makes a big difference. Mohammed Siraj: I was impressed with Siraj, he's developed significantly. I've watched him over time. Over the last year, he's developed into a quality Test match bowler. He's obviously hanging out and spending some time with Jasprit Bumrah. Harshit Rana: He was surprising to me. He was quite sharp. He was a bit quicker than I thought he was. Haven't really seen a lot of him coming into that Test. And you know, he didn't probably get a lot of wickets in the second innings, but he did his job and kept the pressure on the Australian batters.",
    "image": "https://images.indianexpress.com/2024/12/New-Project-2024-12-05T011100.049.jpg",
    "image1": "",
    "date": "5/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-05T08:21:05+05:30",
    "dateModified": "2024-12-05T08:21:05+05:30"
  },
  {
    "title": "KL Rahul has an opportunity to put Test career back on track, a decade after his debut in Australia",
    "link": "https://worldsnews24.vercel.app/sports/kl-rahul-has-an-opportunity-to-put-test-career-back-on-track-a-decade-after-his-debut-in-australia",
    "siteurl": "https://worldsnews24.vercel.app/sports/kl-rahul-has-an-opportunity-to-put-test-career-back-on-track-a-decade-after-his-debut-in-australia",
    "description": " \"Australia is where it started for me 10 years ago and hopefully, this is a start for something great in the next half of my career,\" says KL Rahul  ",
    "thumbnail": "https://images.indianexpress.com/2024/12/express.jpg",
    "description1": "It’s still not clear whether KL Rahul will open in the Adelaide Test. “I know but I have been told to not tell,” he would tell the media. But it’s certain that he is going to get a tattoo at the end of the tour. “I have already fixed it after Sydney”. He knows what design he wants, doesn’t want to share yet, and it is becoming a bit of tradition. “I had done a tattoo on my first tour, and again (my) second tour.” That first Australian tattoo was 10 years ago. “Feels like 25, honestly,” Rahul says with a smile. Sometimes years can flash by in a blur, especially in good times, but Rahul’s career has seen so many ups-and-downs. It has been a journey where he has felt every stumble deeply. “With the amount of injuries I've had, time away from the sport, yeah, feels long.” And lots of trolling and criticism. For someone who has played over 50 Tests, hit 6 of his 8 hundreds outside Asia and is a captain in IPL, he hasn’t received unequivocal love from the public or consistent trust from the different team managements over the years. He doesn’t even have a regular spot in the team. A floater in the line-up, who has drifted here and there through his career. It couldn’t have been easy. His most famous celebration has been him closing his ears with his fingers to suggest he is cutting out “external noise”. And the din has been pretty loud about nearly every facet of his game: his strike rate in white-ball cricket, his batting foibles in Test cricket, his wicketkeeping. Even when he is a near mute-witness with Hardik Pandya on Koffee with Karan, his name has been dragged through the mud. 'Grateful for everything' “I learned a lot in these 10 years and really grateful for everything that I've had to go through, the ups and downs, the good, the bad, everything. Australia is where it started for me 10 years ago and hopefully, this is a start for something great in the next half of my career.” It does seem so, but it’s difficult to confidently tell that with KL for such has been the stormy past. One can’t think of many batsmen who have hundreds in South Africa, England, Australia and still not get a befitting stature. Or adequate respect, if not love from the fans. But this series has certainly started promisingly with his knocks in Perth in both innings, and in particular how he mentored Yashasvi Jaiswal through a nervy phase in the second innings. Jaiswal had publicly spoken about the help he received from Rahul - how he was told to breathe deeply to calm himself down, and little suggestions through that phase. On Wednesday, Rahul ",
    "description2": "would say all he did then was to pass on the same suggestions his opening partner M Vijay had given him all those years back. “I could see a bit of myself in Jaiswal from when I was here 10 years ago, opening the batting for the first time. A lot of doubts, a lot of nerves. You keep doubting your own game and there's a lot that happens in your head. So the only thing that you can do is to slow things down, try and take a few deep breaths and focus on one thing. And that's what was passed on to me by my fellow opening partner back then, Murali Vijay. So I just passed that on to him. Once he got past those first 30-40 balls, he started to feel a little bit more confident and he was seeing the ball really well and he batted beautifully.” Rahul admitted that he still faces those self-doubts and nerves. “I do still have all of these thoughts. But having been there, you know what you need to do to get past that or get over those doubts and get over those thoughts you have in your head. So whatever I told Jaiswal is what I practice.” Balance in stance In the knocks thus far, his bat has been held closer to the body, one of the faults in the past that had led to him being dropped from the team. He had had a problem against the incoming ball, as the bat would be held a touch away, and would leave a bat-and-pad gap. He worked a lot on it with his friend David Mathais, a former Ranji teammate and a close friend. “It comes from good hard work on balance in the stance. The alignment at the crease,” Mathias said. “That balance is the key for Rahul. He doesn’t commit to any one shot. He is in a very neutral but strong position. The flaws against incoming balls disappeared, his judgement of the off stump became good and since he loves batting so much and faced failure, his patience has improved. He now preys on the bowlers’ patience. The whole game reversed, basically. He is tremendously strong mentally. Once the technique thing kicked in – as in felt comfortable with the head position and the bat flow, that was it. The rest he sorted out mentally.” The way he guided Jaiswal said a lot about his confidence in his own game. That he could see beyond himself, despite being pressed as an opener only because Rohit Sharma couldn’t make the tour in time, spoke volumes of the space he is in. If it continues for the rest of the Tests, Australia, the place where it started for him, might yet provide him not just his newest tattoo but the impetus to stop his old celebration. He can then take the fingers off his ears, and hear some love pouring in.",
    "image": "https://images.indianexpress.com/2024/12/express.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T15:26:42+05:30",
    "dateModified": "2024-12-04T15:26:42+05:30"
  },
  {
    "title": "IPL Auction 2025: Meet 13-year-old Vaibhav Suryavanshi, rated highly by VVS Laxman, set to play for Rahul Dravid’s Rajasthan Royals",
    "link": "https://worldsnews24.vercel.app/sports/ipl-auction-2025-meet-13-year-old-vaibhav-suryavanshi-rated-highly-by-vvs-laxman-set-to-play-for-rahul-dravid-s-rajasthan-royals",
    "siteurl": "https://worldsnews24.vercel.app/sports/ipl-auction-2025-meet-13-year-old-vaibhav-suryavanshi-rated-highly-by-vvs-laxman-set-to-play-for-rahul-dravid-s-rajasthan-royals",
    "description": "IPL Auction: Aged 13 years, 243 days, Vaibhav Suryavanshi became the youngest player to be signed in IPL history as he cut a bidding war between the Royals and Delhi Capitals, the former ultimately securing him for Rs 1.1 crore.",
    "thumbnail": "https://images.indianexpress.com/2024/11/New-Project-63.jpg",
    "description1": "Vaibhav Surayvanshi was in an India U-19 team meeting ahead of their Asia Cup preparation when a member of the coaching staff broke the news to the 13-year-old that he had been picked by Rajasthan Royals in the IPL mega auction on Monday. Aged 13 years, 243 days, Vaibhav became the youngest player to be signed in IPL history following a bidding war between the Royals and Delhi Capitals, the former ultimately securing him for Rs 1.1 crore. \"I am speechless.I don't know what to say. It's a massive thing for our family. I had a gut feeling that he would get picked but never in my wildest dreams would I have thought that there would be a bidding war,\" Vaibhav's father Sanjeev Suryavanshi tells The Indian Express. The youngster grabbed eyeballs recently when he became the youngest batter (13 years, 288 days) to record an international century, scoring 104 off 62 balls in a Youth Test for India Under-19 against Australia U-19 in Chennai. The left-hander’s century came in 58 balls, making it the fastest Youth Test hundred by an Indian and the second-fastest overall in the world. \"Everything is coming as a flashback to me. I was a cricket tragic myself. But had to kill that dream when I moved to Mumbai at the age of 19 to earn money. I did a lot of jobs. I worked as a bouncer in a nightclub in Colaba, worked at a Sulabh toilet,\" recollects an emotional Sanjeev. \"All those 12 years I spent in Mumbai, I used to think when my luck would change. Now my son has made it a reality. I don't know what the future holds but after this, I won't have to borrow money from anyone for his cricket,\" he adds. Watch 13 year old vaibhav suryavanshi&#039;s quick fire 82 runs against Australia u19RR picks him for 1.10 Cr pic.twitter.com/7mMvKHtbvv&mdash; ICT Fan (@Delphy06) November 25, 2024 Suryavanshi first made headlines earlier this year when he made his Ranji Trophy debut for Bihar, aged 12, making him one of the youngest ever to play in India’s premier First-Class tournament. \"Cricket",
    "description2": " is coming back to Bihar. Ranji Trophy has returned. A budget of Rs 450 crore has already been passed to renovate Moin-ul-Haq stadium in Patna. And now Vaibhav has burst onto the scene. He will play for India in the future for sure,\" BCA President Rakesh Tiwari tells this newspaper. Sanjeev is happy that his son will be under the wings of his favourite player Rahul Dravid, who is now at the helm in Rajasthan Royals. \"Over the years, Royals have groomed the youngsters. Be it Sanju Samson, Yashasvi Jaiswal, Dhruv Jurel or Riyan Parag, all are products of the Rajasthan Royals franchise. I sincerely hope that Vaibhav will also follow the same path,\" says Sanjeev, who hails from Bihar's Samstipur district. Vaibhav's childhood coach Manoj Ojha, echoes the sentiments of Sanjeev: \"Perfect for Vaibhav. There is no better franchise for a youngster than Rajasthan Royals.\" \"VVS Laxman rates him very highly and monitors his development. He said last year that the next two years are going to be very crucial for Vaibhav. If someone like VVS Laxman is praising him, then there must be something special in the kid,\" says Ojha. In five Ranji Trophy matches Vaibhav has played, he is yet to set the stage on fire. He has managed only 100 runs with a highest score of 41 against Madhya Pradesh. However, on Saturday, making his debut in the Syed Mushtaq Ali Trophy in Rajkot, he smoked Rajasthan's left-arm pacer Aniket Choudhary for two sixes before being dismissed for 13 off six deliveries. The one thing that worried Sanjeev was how his son would deal with all this price tag pressure. \"Money is good. Whatever I get, it will go in his fix-deposit. But my biggest fear is how he will deal with this situation. I am yet to have a word with him. I will talk to him and will make sure that this IPL auction doesn't get into his head, he still has a long way to go,” the father says. Vaibhav will be in action for India U-19 in their Asia Cup match against arch-rivals Pakistan on Saturday in Dubai.",
    "image": "https://images.indianexpress.com/2024/11/New-Project-63.jpg",
    "image1": "",
    "date": "25/11/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-25T23:03:57+05:30",
    "dateModified": "2024-11-25T23:03:57+05:30"
  },
  {
    "title": "India vs Australia: Why the Perth Test win be remembered as a triumph of India’s youth",
    "link": "https://worldsnews24.vercel.app/sports/india-vs-australia-why-the-perth-test-win-be-remembered-as-a-triumph-of-india-s-youth",
    "siteurl": "https://worldsnews24.vercel.app/sports/india-vs-australia-why-the-perth-test-win-be-remembered-as-a-triumph-of-india-s-youth",
    "description": "India vs Australia: Kohli, Bumrah and Rahul performed their roles, but as significant were the contributions of Jaiswal, Reddy, Rana and Jurel, who showed they belonged to this level",
    "thumbnail": "https://images.indianexpress.com/2024/11/IND-AUS-3.jpg",
    "description1": "India vs Australia: Sometime in the afternoon at Perth, Fox Sports showed a split-screen visual. On the right side of the frame was Nitish Reddy running into bowl. On the left was one of the world’s greatest fast bowlers Dennis Lillee steaming in. Perhaps, they saw some similarity in the load-up of the left leg. Or perhaps Australia has gone all soft in lionising India. “What the hell is that? Why is that kid shown with Dennis; he is not even India’s main-line bowler, is he?,” an elderly lady scorer, who has seen Lillee terrorising batsmen, exclaimed in shock. In some ways, the visuals were apt: the question before the series was whether India’s youngsters can perform in alien and hostile Australian conditions. Within four days, one of them has been propped up next to a pace legend. How quickly can things change? Nothing went against the script on the final day, with India downing Australia, overnight on 12 for 3, for 238. Only Travis Head crossed 50; he made an attacking 89 before Jasprit Bumrah, the man of the match, ended his stay. “When you lose a Test like this, there is a lot of hurt in the change room,” Pat Cummins said at the end. Conversely, when a team wins after being bowled out for 150, the feeling is one of pride. “I am very proud,” Bumrah talked about how he enjoyed being a captain and about his team. Everything that India wished went in their favour, after that 150 all out at tea on the first day. The youngsters showed they belonged: be it Harshit Rana, who possibly produced the ball of the match when he knocked down the off stump of Travis Head, a game-turning moment in the first innings. Be it Nitish Reddy whose plucky 41 in the first innings gave the Indian bowlers something to work with, and whose breezy 38 in the second allowed Virat Kohli the room to not worry about doing it on his own when declaration was around the corner. Be it Jaiswal, not a debutant but whose second-innings hundred reflected such maturity in the way he took his time (when he crossed his fifty, it was the slowest he had ever taken off 123 balls), that Bumrah too made a point to mention about that initial phase he kept leaving the ball. Or be it KL Rahul, who showed such reassuring form in both innings and in the way he mentored Jaiswal in the se",
    "description2": "cond. Even the relative non-performances with the bat of Dhruv Jurel, who took the catch of the game with a stunning reflex pouch at short-leg to dismiss Mitch Starc in the second innings, and Devdutt Padikkal who wasn’t too bad, means selection headaches for India with Rohit Sharma, who had a batting stint at Perth nets against the pink ball, and Shubman Gill returning for the second Test. Discipline and thinking On Monday, yet again India’s discipline and thinking stood out. They tailored their bowling according to the demands of the up-and-down pitch, and according to the batsmen. Usman Khawaja, who likes to pull off the front foot, was thrown a sucker short ball but outside off by Mohammad Siraj. Perhaps the ball didn’t come on at the pace he expected and allied with the fact that he was fetching it from outside off, a top edge resulted which was taken by Rishabh Pant. India also didn’t allow Steve Smith to return to form before the second Test. After initially looking confident, he was slowly nailed to the crease, and Siraj induced an edge with a straightener outside off stump. Mitch Marsh was made to sweat hard for his 47 as Bumrah hit his body a few times with carefully curated slower cutters. In the end, Nitish Reddy took him out, again the pitch playing a part with an inside-edge on to the stumps. It was during that spell that he found himself alongside Lillee on international coverage. Nathan Lyon was foxed with a lovely straightener on the off stump from Washington Sundar and lost his off stump. Even the end was noteworthy. Rana, who had impressed many with his pace, bouncers, and control, slipped in a cool slower ball to take out a stubborn Alex Carey. Bumrah and KL Rahul picked stumps and just when it seemed there might be big celebrations, Indians turned quiet. Gentle handshakes, hands around each other’s shoulders, taps on the back - and they were off. Almost as if it was just another day in the office, and not one of the biggest days in Australian soil. In 2021, they bounced back from the depths of 36 all out with a memorable win in Melbourne. But here, in 2024 Perth, they have bounced back in the same Test they were tottering after the nightmarish first innings. There is nothing ordinary about this extraordinary triumph.",
    "image": "https://images.indianexpress.com/2024/11/IND-AUS-3.jpg",
    "image1": "",
    "date": "25/11/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-25T16:45:55+05:30",
    "dateModified": "2024-11-25T16:45:55+05:30"
  },
  {
    "title": "Perth Test: India’s winning (in Australia) habit continues",
    "link": "https://worldsnews24.vercel.app/sports/perth-test-india-s-winning-in-australia-habit-continues",
    "siteurl": "https://worldsnews24.vercel.app/sports/perth-test-india-s-winning-in-australia-habit-continues",
    "description": "The turnaround from Day 1 wasn't about clinging on and clawing back, but a resounding stomp of intentful aggression as the home side capitulated by 295 runs.",
    "thumbnail": "https://images.indianexpress.com/2024/11/India-vs-Australia.jpg",
    "description1": "On the eve of the series-opener in Perth, just before the Border-Gavaskar trophy unveiling, Jasprit Bumrah was excitedly chatting about his son with Australian captain Pat Cummins. He would return to his kid at the end of a sensational come-from-behind win. “My young son was in the stands. He was also there at the T20 World Cup win. He won’t know anything now, but I now have stories to tell him when he grows up; how he was there during special Indian wins.” For a particular generation of older fans, to experience India playing cricket in Australia in the last decade has been a sweet erasure of a torrid past. In 2014, they stood up to Australia; in 2018, they knocked down Australia; in 2021, they seemed on the mat, but conjured a triumph for a lifetime. This 2024 series started like a bad dream, a whitewash at home, absences of key players, doubts about the new management’s working relationship with players. On the first day in Perth India crashed and burned — 150 all out in four hours on a bright sunny Australian day. Yet, within that day, the turnaround had begun, and that was not just consolidated over the next three days but an utter domination was achieved as India wrapped up the first Test in Perth in some style: a 295-run win, India's biggest in terms of runs in Australia. Bumrah would nail down the turning point moment as the one that came after the lowest moment in the Test. “The most positive thing was when we were out for 150. There was no one in the dressing room who was down. They believed that if we could get out like that, we could do the same to them. My only message to the team was not to get too desperate as sometimes bowling teams can do that after getting bowled out cheaply. I told them there was enough on the pitch if we hit the right areas.” Aptly, a debutant helped apply the final seal of victory. Harshit Rana, who had sparkled in the first innings, too, produced a crafty slower ball to castle the stumps of Alex Carey to trigger celebrations. By the time stand-in captain Bumrah could get to the stumps at the non-striker’s end, KL Rahul, whose partnership with Yashasvi Jaiswal in the second innings had set up a huge target, had plucked out two stumps, and he gave one to his skipper. Rana had by then gone on to hug Virat Kohli, who later walked away with Bumrah with their hands around each other’s shoulders. It was a job well done. On the fourth day, only Tra",
    "description2": "vis Head offered resistance with a fine 89, even as India rammed through the rest to seal a special win. Last time around in 2021, they had taken the first-innings lead in the opening Test at Adelaide but collapsed for 36 in the second innings to lose that game. No such mistakes this time around. It’s one thing to hang in there, slowly claw back, grit out a bruising fight-back after being down by tea on opening day, but India decided against that old romantic sporting cliche; instead, they chose to boss and own Australia. Time will tell how the rest of the series goes but this performance has now cancelled out all pre-series fears of a one-sided contest. Josh Hazlewood had given up the ghost on the third evening itself when instead of any brave talk of fightback, he said he hoped a couple of batsmen would get to 80 or 100, and tire down the Indian bowlers a bit. One of those batsmen, and a very important one for Australia if they are to bounce back in the series, was Steve Smith. Especially after Usman Khawaja went early, trying to pull a Mohammed Siraj short delivery from outside off, top-edging it to Rishabh Pant. Smith was sorted out by Bumrah for a first-ball duck in the first innings when he had pressed back far too early, and couldn’t get his wrists to effect the jail-break for him. On Monday, on a track that was playing up-and-down, his task was that much more arduous. He did try gamely, trying to play straight. As his innings progressed though, he began to get stuck at the crease, and his hands were doing all the contortions to keep him out there. But then came a length ball from Mohammad Siraj in the off-stump channel and Smith, not only stuck at crease but on his toes almost jammed together, and pushed out his bat to snick it behind. Head did what he usually does to India: slash, carve, smash, swat. And Bumrah brought himself back to end his stay with a straightener outside off that caught the outside edge of an attempted forcing punch shot and flew through to Rishabh Pant. With it, the Australian fight faded out of the arena rather quickly but not before Dhruv Jurel produced the catch of the game, plucking one out of thin air at short-leg to get rid of Mitch Starc. A little later, when the victory was sealed, a digital advertisement flashed around on the first tier of the stadium: \"Do Great Things\" . They could have added \"like India\" – to capture some ground reality.",
    "image": "https://images.indianexpress.com/2024/11/India-vs-Australia.jpg",
    "image1": "",
    "date": "25/11/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-25T13:53:11+05:30",
    "dateModified": "2024-11-25T13:53:11+05:30"
  },
  {
    "title": "Manchester United manager Ruben Amorim’s game plan needs dynamic and younger players for its success",
    "link": "https://worldsnews24.vercel.app/sports/manchester-united-manager-ruben-amorim-s-game-plan-needs-dynamic-and-younger-players-for-its-success",
    "siteurl": "https://worldsnews24.vercel.app/sports/manchester-united-manager-ruben-amorim-s-game-plan-needs-dynamic-and-younger-players-for-its-success",
    "description": "Ruben Amorim was pragmatic after the 1-1 draw against Ipswich Town; “We are going to suffer for a long period,” he said after the game.",
    "thumbnail": "https://images.indianexpress.com/2024/11/Ruben-Amorim-2.jpg",
    "description1": "In his first show as Manchester United manager, a draw at Ipswich Town, Ruben Amorim didn’t shed too many emotions. He smiled faintly when United scored just 82 seconds into the game, a goal that owed to his tactical rejig. With brown brooding eyes he watched his team fluctuate between energetic and erratic, bouts of purposeless possession dotted with spells of confusion. His reactions on the touchline were mild, no frantic gesturing, no guttural carnage of instructions, no pacing up and down the technical area, or no busy jot-notes. How long the facade of calm would last, or how long before his nerves begin to snap has to be seen. The reeling, flailing club could make Mahatma Gandhi take up arms; or Mother Teresa lose her patience. Even before joining the club, he would have realised the extent of his task, the burden he has embraced. He would have sized up his team’s defects in the training sessions during the international break and by talking to the support staff, but watching them in a full, live match would have offered a clearer, broader picture of the unforgiving mission he had signed up for. “We are going to suffer for a long period,” he said after the game, matter-of-factly and not with grimness. The refreshing bit of the admission was his honesty. He is not delusional enough to project himself as a miracle healer. He has not promised titles and trophies, he has not proclaimed to knock Pep Guardiola off his perch, a verbal faux pas of his predecessor Erik Ten Hag. A tenacious midfielder in his playing days, he sounded realistic and pragmatic. Instead, he dwelled on his “idea” of playing the game. “I think you will see an idea. You would like it or not, I don’t know, but you will see an idea. We will have problems, the players will be confused sometimes but we have to address the new idea and try to be better for this stage next year,” he explained. The new “idea” is a back three, two wingbacks lurking on the touchline, a staggered central midfield pair, two No 10s pulling the string behind a classical No 9. The formation, when employed with the right men could be both dynamic and sturdy, offer goals and defensive stability. But United don’t have the men to make this system work. It requires untiring legs and lungs at the heart of the midfield. Amorim paired Cristian Eriksen and Casemiro, both ageing and slow, their best days long gone. Once Kobbie Mainoo returns fully fit from his injury and Manuel Ugarte internalises the tune and tempo of the league, they could form a more potent duo. The Eriksen-",
    "description2": "Casemiro duet was never going to work against an aggressively pressing Ipswich Town. They cut swathes through the United midfield. But Amorim didn’t flinch from his trusted methods, even though he knew the inherent risks. He didn’t possess the right men in his three-man defence. It made Jonny Evans, 36, look his age. He was slow and ponderous, culpable for Ipswich’s equaliser, a couple of mistakes redeemed by the reflexes of goalkeeper Andre Onana. Matthias de Lit is not the quickest around. Neither are the back-ups Harry Maguire and Victor Lindelöf. Apart from the injury-savvy Lisandro Martinez, none of them possess the bark and bite that Amorim loves in his back-line. “It is not a system or formation, it’s like the character of the players, the way they see the club that matters the most,” he said. Striking the balance would be key in the first season, where he has to work with the men at his disposal, even though they don’t blend in with his formula. The incoherence at Portman Road thus was understandable. But there were green shoots of promise too. When rhyme and rhythm sync, their forward line could be exhilarating to watch. Two-touch passing was marvellous at times, Bruno Fernandes relished his newfound freedom, the wingbacks Amad Diallo and Diogo Dalot buzzed and channeled their creative forces. Diallo could emerge as the most important player in his side. For the opening goal, his deft and precise passing with Fernandes freed up space upfront, he was so quick that he took out two defenders, freeing up Dalot, Garnacho and Rashford, who eventually scored. It was a glimpse into the bright, brave world Amorim promises. There were other positives too. The short, slick quick passes in the buildup were effective when they came off. The press was aggressive to start with. Two-touch passes were delicious at times. But United could sustain none of these throughout the 90 minutes. With refinement, their passing could be top-notch; with fitter players, their press could be relentless. Amorim has been emphasising on physicality, and deeper into the season, United could shed their soft-as-pudding disposition, especially when defending. The coordination would also improve once they get used to the new conductor. But most importantly, they have a gaffer who is not deluded by the past glories; realistic enough to admit that his team is in for a tough time in the coming months of flux; humble enough to not shout war-cries and wise enough to offer hollow promises, but brave enough to stick to his ideas and convictions.",
    "image": "https://images.indianexpress.com/2024/11/Ruben-Amorim-2.jpg",
    "image1": "",
    "date": "25/11/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-25T12:49:55+05:30",
    "dateModified": "2024-11-25T12:49:55+05:30"
  },
  {
    "title": "TPL: Hyderabad Strikers rise to top, Yash Mumbai Eagles in second place on Day 2",
    "link": "https://worldsnews24.vercel.app/sports/tpl-hyderabad-strikers-rise-to-top-yash-mumbai-eagles-in-second-place-on-day-2",
    "siteurl": "https://worldsnews24.vercel.app/sports/tpl-hyderabad-strikers-rise-to-top-yash-mumbai-eagles-in-second-place-on-day-2",
    "description": "TPL: Hyderabad Strikers rise to top, Yash Mumbai Eagles in second place on Day 2",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241205022517.jpg",
    "description1": "\n\n\nMumbai (Maharashtra) [India], December 5 (ANI): The second day of the Tennis Premier League (TPL) Season 6 saw another round of pulsating contests between the eight teams taking place at the Cricket Club of India in Mumbai on Wednesday.\nAccording to a release from TPL, Hyderabad Strikers moved to the top of the table after an excellent outing, while Yash Mumbai Eagles secured second place at the end of day two. Rohan Bopanna's Rajasthan Rangers sit in third place with the Chennai Smashers completing the top four.\n\nBengaluru SG Pipers and Bengal Wizards got the action underway on Wednesday with Gabriela Knutson taking on Kamilla Rakhimova. Bengal Wizards' Kamilla Rakhimova prevailed with a scoreline of 14-11 in the Women's Singles category.\nThe Men's Singles category saw Niki Poonacha and Bernabe Zapata battle it out, with the former clinching that encounter with a scoreline of 13-12.\nBengaluru SG Pipers' pairing of Gabriela Knutson and Anirudh Chandrasekar got the better of Kamilla Rakhimova and Sriram Balaji of Bengal Wizards, winning 14-11 in the Mixed Doubles category.\nIn the Men's Doubles category, Anirudh Chandrasekar and Bernabe Zapata Miralles defeated Niki Poonacha and Sriram Balaji with a scoreline of 15-10, helping Bengaluru SG Pipers win a closely contested match 52-48.\n\n\nThe second match of the day saw Punjab Patriots and Gujarat Panthers go head-to-head. Ekaterina Kazionova gave the Gujarat Panthers the perfect start, cruising to a 19-6 victory against Akanksha Nitture in the Women's Singles category. Mukund Sasikumar won the Men's Singles against Sumit Nagal with a scoreline of 15-10.\nIn the Mixed Doubles category, Ekaterina Kazionova and Vijay Sundar Prashanth of Gujarat Panthers won their match against Akanksha Nitture and Saketh Myneni by a scoreline of 15-10. Even though the Punjab Patriots won the Men's Doubles category with Saketh Myneni and Mukund Sasikumar overcoming Sumit Nagal and Vi",
    "description2": "jay Sundar Prashanth by a scoreline of 15-10, the Gujarat Panthers won the match 54-46.\nThe third match saw Hyderabad Strikers and Chennai Smashers facing each other. Harriet Dart got the better of Conny Perrin in the Women's Singles category, winning 14-11 in a hard-fought contest. The Men's Singles contest was another nail-biter as Hugo Gaston prevailed against Benjamin Lock with a scoreline of 14-11.\nHarriet Dart and Vishnu Vardhan of the Hyderabad Strikers won against Conny Perrin and Rithvik Choudary Bollipalli with a scoreline of 16-9 in the Mixed Doubles category. In the Men's Doubles category, Hugo Gaston and Rithvik Choudary Bollipalli lost 14-11 to Benjamin Lock and Vishnu Vardhan. Hyderabad Strikers came out on top in the match with a scoreline of 55-45.\nRajasthan Rangers played against the Yash Mumbai Eagles in the final match of day two. Zeynep Sonmez secured a convincing win against Cristina Dinu with a scoreline of 17-8 in the Women's Singles category. Arthur Fery got the better of Karan Singh in the Men's Singles game, winning the game 14-11.\nYash Eagles Mumbai's Zeynep Sonmez and Jeevan Nedunchezhiyan won their game against Cristina Dinu and Rohan Bopanna, sealing a 15-10 victory in the Mixed Doubles category. In the Men's Doubles game, Rohan Bopanna and Arthur Fery clinched a 14-11 win against Karan Singh and Jeevan Nedunchezhiyan. However, it was the Yash Mumbai Eagles that triumphed in the game with a scoreline of 54-46.\nAfter another exhilarating day of tennis action, Hyderabad Strikers are at the top of the table with 112 points. Yash Mumbai Eagles sit in second place with 109 points, followed by Rajasthan Rangers in third place with 103 points. Chennai Smashers are in fourth place with 99 points, while Bengaluru SG Pipers and Gujarat Panthers are right behind them with 98 and 97 points respectively. Bengal Wizards and Punjab Patriots are tied for seventh place with 91 points each. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241205022517.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 12:41:15 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "Two-time Olympic medalist PV Sindhu to get married on December 22",
    "link": "https://worldsnews24.vercel.app/sports/two-time-olympic-medalist-pv-sindhu-to-get-married-on-december-22",
    "siteurl": "https://worldsnews24.vercel.app/sports/two-time-olympic-medalist-pv-sindhu-to-get-married-on-december-22",
    "description": "Two-time Olympic medalist PV Sindhu to get married on December 22",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204174015.jpg",
    "description1": "\n\n\nHyderabad (Telangana) [India], December 5 (ANI): India's star shuttler and two-time Olympic medalist PV Sindhu is set to get married on December 22.\n\n\n\"Yeah, I think, it's all over social media. Yes, I am getting married on the 22nd,\" Sindhu told ANI on Wednesday.\nRecently, Sindhu ended her Badminton World Federation (BWF) World Tour drought of over two years by defeating China's Wu Luo Yu in the finals of the Syed Modi India International badminton tournament in Lucknow.\n\n\nIn the title clash lasting for 47 minutes, Sindhu defeated Luo Yu by 21-14, 21-16, within two straight games.\nThis was Sindhu's first BWF World Tour title since the Singapore Open title in July 2022, which was a BWF Super 500 tournament, as compared to Syed Modi India International, which is a BWF Super 30",
    "description2": "0 tournament. In 2023 and this year, she had reached the finals of the Spain Masters and Malaysia Masters but failed to win the title.\nThroughout her illustrious career, Sindhu has amassed five medals at the BWF World Championships, joining China's Zhang Ning as one of only two women to achieve this feat. At the 2016 Rio Olympics, she became the first Indian badminton player to reach the Olympic final, earning a silver medal after a hard-fought match against Spain's Carolina Marin. She continued to make history at the 2020 Tokyo Olympics, where she won a bronze medal, becoming the first Indian woman to win two Olympic medals.\n\nSindhu's achievements have cemented her status as a prominent figure in badminton, inspiring countless young athletes in India and around the world. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204174015.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 12:41:15 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "Hockey India announces cash prize after India's triumph in Men's Junior Asia Cup",
    "link": "https://worldsnews24.vercel.app/sports/hockey-india-announces-cash-prize-after-india-s-triumph-in-men-s-junior-asia-cup",
    "siteurl": "https://worldsnews24.vercel.app/sports/hockey-india-announces-cash-prize-after-india-s-triumph-in-men-s-junior-asia-cup",
    "description": "Hockey India announces cash prize after India's triumph in Men's Junior Asia Cup",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204180901.jpg",
    "description1": "\n\n\nMuscat (Oman), December 4 (ANI): The Indian junior men's hockey team defeated arch-rival Pakistan with a 5-3 scoreline in the high-scoring final of the Men's Junior Asia Cup in Muscat, Oman on Wednesday to successfully defend their title.\nHockey India has announced a cash reward of Rs 2 lakh for each player and Rs 1 lakh to each support staff for their impeccable title defence and dominating performances in the Men's Junior Asia Cup.\n\nAraijeet Singh Hundal (4', 18', 47', 54') showed top form for India and Dilraj Singh (19') scored a brace to join him on the scoresheet. On the other hand, Pakistan's Captain Shahid Hannan (3') and Sufyan Khan (30', 39') tried their utmost to keep their team in the final for the majority of the game.\nIndia has now lifted the trophy in this tournament a record five times, including their previous triumphs in 2023, 2015, 2008 and 2004.\nWhile India were settling into the game, Pakistan's Captain Shahid Hannan pounced on a stray ball in the shooting circle and beat Bikramjeet Singh in a one-on-one to steal a goal for Pakistan.\n\n\nIndia responded immediately by earning a penalty corner (PC) and Araijeet Singh Hundal unleashed a powerful drag flick to the right top corner to restore parity in the final. Both teams went on to trade circle entries but couldn't find the back of the net till the end of the first quarter.\nWithin three minutes of the second quarter, India were awarded another penalty corner and Araijeet stepped up again, finding the gap between Pakistan's goalkeeper Muhammad Janjua and the post-man with a thunderous drag flick to give India the lead",
    "description2": ".\nFollowing this, the Indian forwards relentlessly pressured Pakistan's defence. Soon, Dilraj weaved past two defenders on the left wing and struck the board, extending India's lead to 3-1. Although Pakistan mounted occasional attacks on the Indian goal and earned a penalty corner as the first half came to a close, Sufyan Khan showcased his drag-flicking skills, beating Bikramjit Singh in goal to make it 3-2.\nAraijeet created two chances in quick succession as the third quarter began but Pakistan's goalkeeper Muhammad Janjua pulled out amazing saves on both occasions to keep Pakistan in the match. Both teams went back and forth until Sufyan Khan, with six minutes left in the quarter, flicked the ball into the Indian goal from a penalty corner and ensured Pakistan headed into the last quarter, level on score.\nAs soon as the last quarter began, India seized the initiative. Manmeet Singh skillfully manoeuvred past his marker and found an unmarked Araijeet in front of the goal, who deflected the ball into the goal to restore India's lead and complete his hat-trick. With ten minutes to go, Zikriya Hayat embarked on a counter-attack, but Indian goalie Prince Deep Singh rushed out to avert any further danger.\nWith six minutes left in the game, India earned a penalty corner and employed a variation to free up Araijeet, who smashed the ball into the top right corner with his flick, making it 5-3 for India. As the game headed to a close, Hannan Shahid carved out a significant goal-scoring opportunity, but Prince Deep stood firm in goal, swatting away the attempt and sealing India's victory. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204180901.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 12:41:15 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "Men's Junior Asia Cup: India hockey team lift title for record fifth time, defeat Pakistan 5-3",
    "link": "https://worldsnews24.vercel.app/sports/men-s-junior-asia-cup-india-hockey-team-lift-title-for-record-fifth-time-defeat-pakistan-5-3",
    "siteurl": "https://worldsnews24.vercel.app/sports/men-s-junior-asia-cup-india-hockey-team-lift-title-for-record-fifth-time-defeat-pakistan-5-3",
    "description": "Men's Junior Asia Cup: India hockey team lift title for record fifth time, defeat Pakistan 5-3",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204180130.jpg",
    "description1": "\n\n\nMuscat (Oman), December 4 (ANI): The Indian junior men's hockey team defeated arch-rival Pakistan with a 5-3 scoreline in the high-scoring final of the Men's Junior Asia Cup in Muscat, Oman on Wednesday to successfully defend their title.\nAraijeet Singh Hundal (4', 18', 47', 54') showed top form for India and Dilraj Singh (19') scored a brace to join him on the scoresheet. On the other hand, Pakistan's Captain Shahid Hannan (3') and Sufyan Khan (30', 39') tried their utmost to keep their team in the final for the majority of the game.\n\nIndia has now lifted the trophy in this tournament a record five times, including their previous triumphs in 2023, 2015, 2008 and 2004.\nWhile India were settling into the game, Pakistan's Captain Shahid Hannan pounced on a stray ball in the shooting circle and beat Bikramjeet Singh in a one-on-one to steal a goal for Pakistan.\nIndia responded immediately by earning a penalty corner (PC) and Araijeet Singh Hundal unleashed a powerful drag flick to the right top corner to restore parity in the final. Both teams went on to trade circle entries but couldn't find the back of the net till the end of the first quarter.\n\n\nWithin three minutes of the second quarter, India were awarded another penalty corner and Araijeet stepped up again, finding the gap between Pakistan's goalkeeper Muhammad Janjua and the post-man with a thunderous drag flick to give India the lead.\nFollowing this, the Indian forwards relentlessly pressured Pakistan's defence. Soon, Dilraj weaved",
    "description2": " past two defenders on the left wing and struck the board, extending India's lead to 3-1. Although Pakistan mounted occasional attacks on the Indian goal and earned a penalty corner as the first half came to a close, Sufyan Khan showcased his drag-flicking skills, beating Bikramjit Singh in goal to make it 3-2.\nAraijeet created two chances in quick succession as the third quarter began but Pakistan's goalkeeper Muhammad Janjua pulled out amazing saves on both occasions to keep Pakistan in the match. Both teams went back and forth until Sufyan Khan, with six minutes left in the quarter, flicked the ball into the Indian goal from a penalty corner and ensured Pakistan headed into the last quarter, level on score.\nAs soon as the last quarter began, India seized the initiative. Manmeet Singh skillfully manoeuvred past his marker and found an unmarked Araijeet in front of the goal, who deflected the ball into the goal to restore India's lead and complete his hat-trick. With ten minutes to go, Zikriya Hayat embarked on a counter-attack, but Indian goalie Prince Deep Singh rushed out to avert any further danger.\nWith six minutes left in the game, India earned a penalty corner and employed a variation to free up Araijeet, who smashed the ball into the top right corner with his flick, making it 5-3 for India. As the game headed to a close, Hannan Shahid carved out a significant goal-scoring opportunity, but Prince Deep stood firm in goal, swatting away the attempt and sealing India's victory. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204180130.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 12:41:15 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "Guwahati Masters Super 100: Top seed Priyanshu Rajawat made to work hard, Tanvi Sharma upsets seventh seed Tanya Hemanth",
    "link": "https://worldsnews24.vercel.app/sports/guwahati-masters-super-100-top-seed-priyanshu-rajawat-made-to-work-hard-tanvi-sharma-upsets-seventh-seed-tanya-hemanth",
    "siteurl": "https://worldsnews24.vercel.app/sports/guwahati-masters-super-100-top-seed-priyanshu-rajawat-made-to-work-hard-tanvi-sharma-upsets-seventh-seed-tanya-hemanth",
    "description": "Guwahati Masters Super 100: Top seed Priyanshu Rajawat made to work hard, Tanvi Sharma upsets seventh seed Tanya Hemanth",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204175516.jpg",
    "description1": "\n\n\nGuwahati (Assam)[India], December 4 (ANI): Top seed Priyanshu Rajawat was made to sweat by compatriot Arya Bhivpathki in men's singles second round while the young Tanvi Sharma packed off seventh seed Tanya Hemanth to advance to the women's singles pre-quarters in Guwahati Masters Super 100 badminton tournament here on Wednesday.\nRajawat fought back from 11-16 and then saved a game point in the opening game to beat Bhivpathki 22-20, 21-14 in 35 minutes, while Tanvi defeated Tanya 21-18, 21-14 to advance.\n\nIn the paired event, mixed doubles top seeds Satish Kumar Karunakaran and Adya Variyath along with fifth seeds Dhruv Kapila and Tanisha Crasto stayed on course for a possible showdown in the quarterfinals.\nThe top seeds defeated Nithin HV and Anagha Pai 21-14, 21-10 while Dhruv and Tanisha got the better of the Chinese combination of Liao Pin Yi and Huang ",
    "description2": "Ke Xin 22-20, 21-19.\n\n\nThis is the second edition of the competition, organised jointly by the Badminton Association of India and the Assam Badminton Association with the view of providing much-needed exposure to young Indian shuttlers.\nAnd just like Tanvi, up-and-coming youngster Shriyanshi Valishetty also grabbed the opportunity to impress with a 21-19, 21-14 win over Unnati Hooda.\nLocal hope Isharani Baruah, seeded eight, played her heart out against India's Asian Championship star player Anmol Kharab but ended up on the wrong side of the 21-10, 18-21, 21-18 score line.\nIn the day's other matches, Tasnim Mir squandered two match points and then saved two herself before defeating compatriot Ira Sharma 21-13, 19-21, 24-22 in just under an hour.\nShe will now face defending champion Lalinrat Chaiwan of Thailand, who comfortably beat Tanishq MP 21-5, 21-7. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204175516.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 12:41:15 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "Woods hopeful of coming to India, Munjal thrilled at three players of Indian origin in the field",
    "link": "https://worldsnews24.vercel.app/sports/woods-hopeful-of-coming-to-india-munjal-thrilled-at-three-players-of-indian-origin-in-the-field",
    "siteurl": "https://worldsnews24.vercel.app/sports/woods-hopeful-of-coming-to-india-munjal-thrilled-at-three-players-of-indian-origin-in-the-field",
    "description": "Woods hopeful of coming to India, Munjal thrilled at three players of Indian origin in the field",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204174153.jpg",
    "description1": "\n\n\nAlbany [US], December 4 (ANI): Tiger Woods is still hopeful of coming to India for a competitive event, something he has not been able to do for the 10 years.\nThen, there is Pawan Munjal, a close friend of Woods, who is thrilled to have extended his partnership with the star-studded World Challenge for another six years till 2030 and with Woods to continue as their global partner till 2030.\n\nA third thing that brought a big smile to Munjal's face was that he was able to bring to the field three players of Indian origin - Sahith Theegala, Akshay Bhatia and Aaron Rai.\nMunjal said, \"If you remember, we had Anirban one time here, which was a great thing to happen. He was in the Top 30 then. To have three boys of Indian origin in a field of the best and Top 20 is a huge, huge thing for India,\" as quoted from a release.\n\"As you know, me and many of you included have been looking for an Indian star on the golfing map to really grow the game of golf in India. I'm sure even if they're not Indians but they are of Indian origin, I'm sure the whole nation is going to be very, very excited and very proud about this fact,\" he said.\nIndian-American Sahith is 12th in the world rankings, Indo-British Rai is 21st and Indian American Akshay Bhatia is 31st as the entire field of 20 comprises players inside Top-40 in the world.\nOn the extension of their relationship, Munjal said, \"It was easy. We've had, as I said, 10 years of an incredible journey together which has benefited both of us, the foundation, Hero's brand globally. There were no two thoughts about it.\"\n\n\nWoods commented, \"Well, this is exciting news for all of us at the foundation to be able to have Hero MotoCorp who have supported us here for the last 10 years and to have this relationship and our partnership continue until 2030 is truly amazing. We're able to help and serve so many more youth because of it. All the players who come down here over the years have supported this event, some of them have started their own foundations because of the impact that Pawan and I have had on this event and our various charities.\"\nHe added, \"We've had a great relationship and great partnership for the last 10 years, so I think it was a very natural thing for us to continue this relationsh",
    "description2": "ip going forward through 2030 and hopefully we can make it better in the next five or so years, better than it was the first 10 and then hopefully even bigger into the future.\"\nHero and Tiger Woods Foundation and Woods came together for the HWC in 2014 and will now be together till at least 2030, making it one of longest relationships on the PGA Tour.\nWoods, who has often chosen HWC, which he hosts, as an event to test his fitness and preparation ahead of the following season, admitted, \"Yeah, I am disappointed. I'm not physically ready yet to compete at this level. The times I have come back here, I was ready to start competing and playing again. Unfortunately, not this time. I still need to keep training to give myself the best chance going into next year and the events ahead.\"\nOn the issue of the PGA Tour and the Public Investment Fund of Saudi Arabia, which funds the LIV series, Woods said, \"I think all of us who have been a part of this process would have thought it would have happened quicker than this. Even if it did, we're still at the regulations of the DOJ (Department of Justice) saying it's giving us hominus dominus that it will go through. Even if we had gotten a deal done by now, it's still in the DOJ's hands, but we wish we would have had something more concrete and further along than we are right now. But things are very fluid, we're still working through it, it's happening daily. From a policy board standpoint or from an enterprise standpoint, things are moving and they're constructive. But yes, definitely moving.\"\nOn his own return to golf and competing, Woods is still desirous and hopeful. He said, \"The fire still burns to compete. The difference is the recovery of the body to do it is not what it used to be. I still love doing it, I love competing, I love competing in anything whether we're playing cards or we're playing golf. No matter what it is, I love competing,\" as quoted by a release.\nThe World Challenge will be held from December 5-8 with 20 players, all of whom figure in Top-40 of the world competing.\nThe field is led by World No.1 Scottie Scheffler, who is also the FedEX champion, two-time Masters champion, who won in 2022 and 2024, and also the defending champion of the World Challenge. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204174153.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 12:41:15 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "ISL: High-flying Odisha FC host Mumbai City FC in high stakes match",
    "link": "https://worldsnews24.vercel.app/sports/isl-high-flying-odisha-fc-host-mumbai-city-fc-in-high-stakes-match",
    "siteurl": "https://worldsnews24.vercel.app/sports/isl-high-flying-odisha-fc-host-mumbai-city-fc-in-high-stakes-match",
    "description": "ISL: High-flying Odisha FC host Mumbai City FC in high stakes match",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204174100.jpg",
    "description1": "\n\n\nBhubaneswar (Odisha) [India], December 4 (ANI): Mumbai City FC are all set to take on Odisha FC at the Kalinga Stadium in Bhubaneswar as the two teams battle it out in the reverse fixture, for bragging rights in their Indian Super League (ISL) 2024-25 fixture on Thursday.\nThe two sides played out a 1-1 draw in their previous encounter that was played in Mumbai in October, but with the competition intensifying, they will have their eyes on all three points in the forthcoming encounter.\n\nOdisha FC, buoyed by consecutive wins, will look to make it three on the bounce, while Mumbai City FC are aiming to extend their unbeaten run against Odisha FC to seven games in the competition.\nOdisha FC have found the back of the net in each of their last 10 home games in the ISL. A goal in this fixture will equal their record of scoring in 11 consecutive home matches, set between December 2019 and December 2022.\nWith 23 goals this season from an expected goals (xG) total of 12.68, Odisha FC boast the highest xG differential (+10.32) in the league, reflecting their exceptional finishing ability.\n\n\nMeanwhile, Mumbai City FC are unbeaten in their last six games against Odish",
    "description2": "a FC (W4 D2). Only against FC Goa (13 games) and Chennaiyin FC (9 games) do they have a longer active streak.\nBipin Singh has an outstanding record in this fixture, contributing to nine goals (7 goals and 2 assists), which is the highest by any Mumbai City FC player against a single opponent in ISL history.\nIn 11 ISL encounters, Mumbai City FC have won six matches, whereas Odisha FC have emerged victorious thrice. Two matches resulted in a draw.\nOdisha FC head coach Sergio Lobera expressed that the Juggernauts will stay true to their playing philosophy and will not be swayed by Mumbai City FC's strengths.\n\"We know our style of play. We know our strengths and we have to play according to that. If we don't do that, we won't be strong. The team is ready for tomorrow's game,\" Lobera said as quoted from ISL press release.\nMumbai City FC head coach Petr Kratky quipped that they need to be defensively strong to halt Odisha FC's goal-scoring spree.\n\"Odisha FC have scored 10 goals in their last two matches. We need to find a way to stop this. Because, they have found a way to out-score the oppositions. We have to stay true to our style of play too,\" Kratky said. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204174100.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 12:41:15 pm",
    "courtesy": "ANI News",
    "datePublished": "THU, DEC 05, 2024 |UPDATED 09:37 IST",
    "dateModified": "THU, DEC 05, 2024 |UPDATED 09:37 IST"
  },
  {
    "title": "Will Rohit Sharma open or not? Sunil Gavaskar on India's playing XI for Adelaide Test",
    "link": "https://worldsnews24.vercel.app/sports/will-rohit-sharma-open-or-not-sunil-gavaskar-on-india-s-playing-xi-for-adelaide-test",
    "siteurl": "https://worldsnews24.vercel.app/sports/will-rohit-sharma-open-or-not-sunil-gavaskar-on-india-s-playing-xi-for-adelaide-test",
    "description": "Will Rohit Sharma open or not? Sunil Gavaskar on India's playing XI for Adelaide Test",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115988480/115988480.jpg",
    "description1": "NEW DELHI: A buoyant Indian cricket team is set to face Australia in the second match of the ongoing Border-Gavaskar Trophy at the Adelaide Oval, starting Friday. Leading 1-0 in the five-match series after a dominant 295-run victory in Perth, India are looking to extend their lead in the Pink Ball Test. India's squad received a significant boost with the arrival of skipper Rohit Sharma, who missed the first Test due to the birth of his second child. In Rohit's absence, KL Rahul and Yashasvi Jaiswal opened the innings in Perth, putting together a record 201-run partnership in the second innings, a key factor in India's triumph. Border-Gavaskar TrophyWith Rohit's return, the Indian think tank now faces a dilemma over the batting order.  115978582During a discussion on Star Sports, former Indian captain Sunil Gavaskar shared his thoughts on the potential XI and where Rohit Sharma should bat. \"He [Rohit Sharma] opens the batting. Short square boundaries will suit his kind of batting,\" Gavaskar stated. \"Rahul drops down to No.6, in place of Jurel. And ",
    "description2": "at No.3, Shubman Gill comes in place of Devdutt Padikkal. That would be my XI.\"  115959532Gavaskar also weighed in on the bowling combination, suggesting changes based on the pitch conditions in Adelaide. \"I would maybe look at Washington Sundar's place. Nitish Reddy will have to stay because it's a pink-ball Test; he will be your fourth seamer, fourth bowler. Whether you want to bring in Ashwin or Jadeja, that's the call they have to take once they go and see what the pitch has on offer.\" When asked about concerns over Rohit Sharma's form, Gavaskar dismissed any apprehensions. \"No, not at all. Somebody of his class and calibre - it doesn't matter at all. The first time he comes in, he can get a hundred just like that. No worries.\" WATCH:&mdash; StarSportsIndia (@StarSportsIndia) With Rohit Sharma and Shubman Gill potentially making a return, India's playing XI in Adelaide will be closely watched as they look to solidify their lead in the series. The Pink Ball Test promises to be an exciting contest under the lights at the Adelaide Oval. 115931658",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115988480/115988480.jpg",
    "image1": "",
    "date": "5/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-05T06:30:00+05:30",
    "dateModified": "2024-12-05T06:30:00+05:30"
  },
  {
    "title": "'Who cares?': Travis Head brushes off Sunil Gavaskar's comments on Josh Hazlewood injury as 'funny'",
    "link": "https://worldsnews24.vercel.app/sports/who-cares-travis-head-brushes-off-sunil-gavaskar-s-comments-on-josh-hazlewood-injury-as-funny",
    "siteurl": "https://worldsnews24.vercel.app/sports/who-cares-travis-head-brushes-off-sunil-gavaskar-s-comments-on-josh-hazlewood-injury-as-funny",
    "description": "'Who cares?': Travis Head brushes off Sunil Gavaskar's comments on Josh Hazlewood injury as 'funny'",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115991493/115991493.jpg",
    "description1": "NEW DELHI: Australia's Travis Head has dismissed Indian legend Sunil Gavaskar's remarks about Josh Hazlewood's side strain injury, calling them “pretty funny” and suggesting they were an attempt to stir controversy after Australia's heavy defeat in the first Test against India in Perth. Hazlewood was ruled out of the second Test in Adelaide due to a side strain, but Gavaskar questioned the injury's timing in his column, hinting that the fast bowler might have been dropped for comments critical of the Australian batters during a media conference. Border-Gavaskar TrophyGavaskar labeled the development \"strange\" and \"a mystery,\" drawing parallels to controversies from Indian cricket's past.  115988011Speaking on the Willow Talk podcast, Head downplayed the comments. \"I was surprised at Sunny's comments. They were pretty funny,\" he sa",
    "description2": "id. \"He's in the entertainment business as a few teams around the world would say. He's in the commentary team. If that makes it more fun for him, then go for it.\"  115978582Head brushed off the suggestion of any internal divide in the Australian team, adding, \"Dropping 'Hoff' (Hazlewood) and throwing a couple of daggers and shooting across the bow, but who cares? It is what it is. Everyone is paid to have an opinion.\" Gavaskar had previously speculated that Hazlewood's absence might be linked to fallout from his remarks following Australia's dismal batting display in Perth, where they were bowled out for 104 in the first innings despite dismissing India for 150. After the match, Hazlewood had pointedly said, \"You probably have to ask one of the batters that question,\" when queried about the team's failure to capitalise. 115959532",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115991493/115991493.jpg",
    "image1": "",
    "date": "5/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-05T09:25:00+05:30",
    "dateModified": "2024-12-05T09:25:00+05:30"
  },
  {
    "title": "'Jay Shah has the opportunity to take cricket to another level but without making it under the yoke of India': Outgoing ICC chair Greg Barclay",
    "link": "https://worldsnews24.vercel.app/sports/jay-shah-has-the-opportunity-to-take-cricket-to-another-level-but-without-making-it-under-the-yoke-of-india-outgoing-icc-chair-greg-barclay",
    "siteurl": "https://worldsnews24.vercel.app/sports/jay-shah-has-the-opportunity-to-take-cricket-to-another-level-but-without-making-it-under-the-yoke-of-india-outgoing-icc-chair-greg-barclay",
    "description": "'Jay Shah has the opportunity to take cricket to another level but without making it under the yoke of India': Outgoing ICC chair Greg Barclay",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115989790/115989790.jpg",
    "description1": "Greg Barclay, who made way for Jay Shah as the International Cricket Council (ICC chairperson on December 1, believes the former Board of Control for Cricket in India (BCCI) secretary has it in him to help the sport grow and reach the “another level”. However, he added that Shah must take all members together on this journey and not keep it \"under the yoke of India.\"Barclay, who was ICC chair for four years from 2020, said the Indian cricket team and BCCI under Shah’s leadership can use their influence to grow the game globally and benefit growing nations. https://www.youtube.com/watch?v=NNTy-IyRX4I“I think he (Shah) has got a great opportunity to use what he’s got in his background to help India take the game to another level, but without making it sort of under the yoke of India as well,” Barclay was quoted as saying by The Telegraph.“We’re really lucky to have India, they’re a massive contributor to the game across all the measures, but one country having that amount of power and influence does distort a whole lot of other outcomes, which is not necessarily helpful in terms of that global growth.”“There are a number of things that India could do to help unite and grow the game, including commercially helping to pool off-shore rights, using their teams to give opportunity to smaller full members and emerging countries, using their clout to open new territories and markets, collaborating closely with the ICC to help benefit members, as examples,” he said.On congested calendarBarclay, who stepped down from his role on December 1, in the midst of an ongoing crisis over the 2025 ICC Champions Trophy, admitted there was plenty of cricket being played that he had lost track of the calendar.In his tenure of two terms of two years each, three major franchise-based T20 leagues popped up, in the USA, the UAE and South Africa, further busying a",
    "description2": "n already packed calendar. He blamed the members' self-interest for the situation.\"I reckon, gee, I'm at the apex of the game and I can't tell you who's playing around the world. In fact, I didn't realise that Sri Lanka were in South Africa until I read about Marco Jansen's seven wickets this morning,\" Barclay said. \"So we've lost perspective. It's not great for the game at all. It's a mess. The calendar is incredibly congested and self-interest is such that it's almost impossible to untangle all of that, because no one's going to give up their content.\"'Not the Afghanistan board's fault'The Canadian-New Zealand sports administrator also defended the governing body's decision not to sanction Afghanistan’s Full Membership status for Afghanistan Cricket Board not fielding a women's team. Fielding a women's team is integral to getting Full Membership with the ICC.\"It is not the Afghanistan board's fault. They used to have women's cricket. I think our approach has been right,\" he said. \"It would be easy to kick Afghanistan out, but their board haven't done anything wrong. They're just working under a decree and a series of laws that says this is what you have to do. I don't think it would make a jot of difference to the ruling party there to kick them out.\"Maybe I'm a little naïve, but I think cricket is such a force for good there, and it brings a lot of joy to a lot of people. It is better to leave it there and hope that it can foster a bit of a change.\"He did point to the double standards of the national cricket boards, such as Cricket Australia, who have cancelled multiple bilateral series with Afghanistan but have played them at ICC events.\"If you really want to make a political statement, don't play them in a World Cup. Sure, it might cost you a semi-final place, but principles are principles. It's not about having half a principle.\"",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115989790/115989790.jpg",
    "image1": "",
    "date": "5/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-05T08:38:00+05:30",
    "dateModified": "2024-12-05T08:38:00+05:30"
  },
  {
    "title": "Pink venom: Can D/N Test break trend of early finishes?",
    "link": "https://worldsnews24.vercel.app/sports/pink-venom-can-d-n-test-break-trend-of-early-finishes",
    "siteurl": "https://worldsnews24.vercel.app/sports/pink-venom-can-d-n-test-break-trend-of-early-finishes",
    "description": "Pink venom: Can D/N Test break trend of early finishes?",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115989664/115989664.jpg",
    "description1": "ADELAIDE: Damian Hough offers a sheepish smile when asked about the drop-in pitch debacle in New York during the T20 World Cup earlier this year.The Adelaide Oval curator, whose team was in charge of preparing those fresh surfaces, now has an even more important task at hand -he must ensure the second Test between India and Australia doesn't end in a heap of quick wickets and lead to similar accusations of farce.Border-Gavaskar Trophy\"Both the drop-in pitches are challenging, we'll leave it at that,\" he offered. \"New York was a great opportunity to get over there and learn. Anything you do in such a short time keeps you awake at night. But there's nothing bigger than India and Australia in a Test match.\"The brief sample size of pink-ball Tests, played only since Nov 2015, makes it difficult for the experienced curator to offer an educated guess on the expected duration of the game. One thing, though, is clear: these games, cooked up to draw in the evening crowd to the longer format, tend to finish quicker. https://www.youtube.com/watch?v=HVa6iv9TwpYThe general perception that pink-ball affairs are a nightmare for batters is spot on, since of the 22 pink-ball Tests played, only six have lasted the full distance of five days. Seven have ended within four days, seven within three days and two games within two days, in Ahmedabad (2021) and Port Elizabeth (2017).Maybe it's because the seam, or the ball itself, can be difficult for batters to spot, or perhaps because it jags around in the in-between twilight hours with the lights on, or even because of the early swing. Also, the jury is still out on the lacquer on the ball.It's also clear truncated pink-ball Tests are not limited to the hard and bouncy surfaces of Australia, or Adelaide in particular. In fact, Adelaide isn't particularly notorious - out of seven games, two have lasted the duration. There have also been two three-day finishes and three four-day affairs.Of the last seven pink-ball Tests played across the world, only the 2021 Adelaide game between Australia and England has been played across five days. But it was also here that Aus",
    "description2": "tralia rolled India over for 36 in Dec 2020, with fast bowler Josh Hazlewood, who is sitting this game out, taking 5/8 in India's second innings.Sold-out seats, and 6 mm grass\"Back in the day, Adelaide was known for bat-a-thons and draws,\" Hough said. \"Do you want a five-day draw out of it? Obviously not. But do you want a two-and-a-half-day game? No, you don't. Wickets falling can be exciting, but 10 wickets and 300 runs would be ideal. You've got to get that balance right. The fans come (tickets are sold out at the 53,500-seat stadium). We play our role, but the players play the game at the end of the day.\"Nearly 6 mm of grass has been left on the pitch, the same as in the '36 all out' Test. A recent Shield game between South Australia and Western Australia saw the quicks call the shots. \"The preparation is the same,\" Hough said. Pacers have picked up 106 of the 134 wickets to fall in the day-night Tests here, with spinners picking up 28.Spin factor and other tricks, and thunderstorms too!In fact, spin could even come into play later on, according to Hough, because of the 30% clay content, which tends to break up. \"Also, if you don't get a new ball under lights and you have set batters out there, you could see through the night-time period,\" he said.\"It's a pretty standard wicket,\" lamented Australia's star spinner Nathan Lyon. \"I didn't expect this from Damian. We're going to challenge the defence for a long period of time. I really enjoy bowling here, with the spin and the bounce. Red ball, pink ball, white ball, definitely my favourite ground. It's a great venue to bowl spin. If you're good with the bat, you'll score runs.\"KL Rahul, for one, wasn't so sure about that. \"The ball seems a bit harder than the red ball. While fielding, you can feel the ball hit your hands a lot quicker and harder. Same while batting. It seems to get to you much quicker and seams around a bit more than the red ball. There'll be a lot of seam movement. Picking the ball from the hand can be tricky.\"There are also thunderstorms predicted on the opening day, adding to the great unknowns of the pink-ball contest.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115989664/115989664.jpg",
    "image1": "",
    "date": "5/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-05T08:21:00+05:30",
    "dateModified": "2024-12-05T08:21:00+05:30"
  },
  {
    "title": "The new KL Rahul, open to modification",
    "link": "https://worldsnews24.vercel.app/sports/the-new-kl-rahul-open-to-modification",
    "siteurl": "https://worldsnews24.vercel.app/sports/the-new-kl-rahul-open-to-modification",
    "description": "The new KL Rahul, open to modification",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115989310/115989310.jpg",
    "description1": "India's eternal floater doesn't worry about his batting position anymore. Make him open or slot him in the middle, Rahul's ready to roll. Australia is where it all began for him, all he needs now is a chance to contribute...ADELAIDE: As Rohit Sharma and Yashasvi Jaiswal sweated it out under the blazing South Australian sun, batting as a pair in the pace nets, a composed KL Rahul took fresh guard against the sidearm throwers alongside. Minutes earlier, Rahul had been reminiscing about Australia being the place where it all began for him as a Test opener. Border-Gavaskar TrophyBack on the 2014-15 tour - made famous by Virat Kohli's twin Adelaide tons and MS Dhoni's shock retirement from the format - the then-22-year-old Rahul's Test debut in Melbourne had been a forgettable one.He was slotted in at No. 6 first up and managed three off eight balls, falling to a streaky attempt at slog sweeping Nathan Lyon and managing only a top edge. In his second dig he was pushed up to No. 3 and fell in equally horrifying fashion, another top edge to a short one from Mitchell Johnson costing him his wicket. Luckily, by the next Test in Sydney, his nerves had started to settle. 115959532Pushed up to open, Rahul came up with a composed 262-ball 110, keeping the demons at bay with discipline and verve to announce his arrival. And this has been his rollercoaster story ever since, with crests following troughs and long absences in-between some stellar performances, especially away from home in challenging conditions.Even a decade on, he remains the eternal floater in India's batting order, with even the disciplined and match-winning contribution in Perth in the first Test of this series offering no guarantee of a settled spot.\"Luckily for me, I've batted in different positions. Early on, it was a bit of a challenge mentally, how to play those first 20-25 balls. Not so much technique, but what shots to play, how early I can attack, how cautious I n",
    "description2": "eed to be. 115989334Those were a bit tricky early on. But now that I've played in ODIs, Tests and all over the place, it's given me a little bit of an idea how I need to manage my innings. It's the start that's important, whether I'm batting at the top or middle. The first 30-40 balls. If I can manage that, everything else starts to seem like regular batting.\"Ten years ago, it was my first Test series. It was a bit surreal. There was a lot going on in my head. I've learnt a lot. I'm looking forward to the next 10 years and Australia is where it all started for me,\" Rahul said. 115989337In India's remarkable Perth win a few days ago, Rahul - opening for the first time since Feb 2023 - chewed up 74 balls as India collapsed for 150 in 298 balls in their first innings. He then stayed put for 176 balls in a 201-run opening stand as Jaiswal scored 161.\"I was told quite early (to open). I missed out in the New Zealand series, so I was told to be ready. I had enough time to prepare. I've batted enough at the top of the order and know what processes I need to follow,\" Rahul said.However, with captain Rohit back and No. 3 Shubman Gill having recovered from his finger injury, could Rahul be shoved down the order again? If yes, it's only to be expected, since Rohit has ruled the opening slot since 2019. If not, it may well be the start of a fresh chapter again in Australia. 115989339\"This is my first pink-ball Test, so I'll try and face up to whatever comes my way,\" he said. \"I just want to go out there, bat and play for the team. I just want to be in the playing XI. Fit me in wherever.\"The person holding the key is captain Rohit, who batted at No. 4 in the practice game in Canberra, keeping Jaiswal and Rahul's opening slots intact. So maybe Rahul has been told where he'll bat? The answer was equivocal. \"I've been told, but I've also been told not to share it. You'll have to wait for Day One or maybe when the captain comes here tomorrow.\"",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115989310/115989310.jpg",
    "image1": "",
    "date": "5/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-05T08:01:00+05:30",
    "dateModified": "2024-12-05T08:01:00+05:30"
  },
  {
    "title": "'You have to grab': Rohit Sharma’s tips for fans ahead of the Adelaide Test match",
    "link": "https://worldsnews24.vercel.app/sports/you-have-to-grab-rohit-sharma-s-tips-for-fans-ahead-of-the-adelaide-test-match",
    "siteurl": "https://worldsnews24.vercel.app/sports/you-have-to-grab-rohit-sharma-s-tips-for-fans-ahead-of-the-adelaide-test-match",
    "description": "'You have to grab': Rohit Sharma’s tips for fans ahead of the Adelaide Test match",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115989983/115989983.jpg",
    "description1": "Indian captain Rohit Sharma, who recently joined the team after missing the first Test in Perth, shared a moment with fans ahead of the crucial pink-ball day-night Test match in Adelaide.In a viral video, Rohit Sharma can be seen posing for photographs with a smile while interacting with his fans. Rohit, accompanied by T. Dilip, was entering a building when fans noticed the skipper and surrounded him for photos and autographs.Fans wished him luck, and the captain, with his cheerful nature, responded with a \"thank you.\"One fan, struggling to get the angle right for a selfie, was met with a playful remark from the skipper: \"Life mein ek hi opportunity milta hai, you have to grab it.\"The second ",
    "description2": "Test of the Border-Gavaskar Trophy is set to begin on 6th December in Adelaide. This will be a pink-ball, day-night Test match. India has haunting memories of the day-night Adelaide Test, as the last time they played at this venue, they recorded their lowest-ever innings score—just 36 runs.After their dominant performance in the first Test in Perth, India will be high on confidence. However, Australia will be looking to bounce back in the series. In this five-match Test series, India is leading, making the second Test crucial for Australia to remain in contention. Australia will aim to avoid falling too far behind, especially after suffering defeats in their previous home series against India.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115989983/115989983.jpg",
    "image1": "",
    "date": "5/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-05T08:41:00+05:30",
    "dateModified": "2024-12-05T08:41:00+05:30"
  },
  {
    "title": "Virat Kohli's fitness secret revealed by wife Anushka Sharma: 'Sleep is non-negotiable'",
    "link": "https://worldsnews24.vercel.app/sports/virat-kohli-s-fitness-secret-revealed-by-wife-anushka-sharma-sleep-is-non-negotiable",
    "siteurl": "https://worldsnews24.vercel.app/sports/virat-kohli-s-fitness-secret-revealed-by-wife-anushka-sharma-sleep-is-non-negotiable",
    "description": "Virat Kohli's fitness secret revealed by wife Anushka Sharma: 'Sleep is non-negotiable'",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115987823/115987823.jpg",
    "description1": "NEW DELHI: Virat Kohli's incredible fitness and consistency continue to be the cornerstone of his cricketing success. He recently ended his long century drought by scoring his 30th Test century in India's commanding 295-run victory over Australia in the first match of the Border-Gavaskar Trophy in Perth. While fans marvel at the 36-year-old's ability to maintain peak performance, his wife, actor Anushka Sharma, has shed light on the secret behind his remarkable fitness. Border-Gavaskar TrophyIn a video that has gone viral on social media ahead of the Pink Ball Test in Adelaide, Anushka spoke about Kohli's unwavering commitment to his health and lifestyle. \"Let me be very honest about it, Virat is incredibly disciplined about his health and fitness. I think this is also happening in our industry now,\" she said, emphasizing his role as a trailblazer in healthy living.  115978582Anushka revealed the daily habits that have helped Kohli sustain his level of excellence over the years. \"Every morning without fail, he is up early doing cardio or HIIT, and practicing cricket with me. His diet is c",
    "description2": "lean - no junk food or sugary drinks. Can you believe he hasn't eaten butter chicken in almost 10 years?\" She also stressed how essential rest is in Kohli's routine. \"Sleep is non-negotiable for him. He ensures he gets enough rest. It's the key to staying sharp and performing at his best. He always says - that is something you have control over.\" Anushka concluded by highlighting what sets Kohli apart. \"His commitment to every aspect of his lifestyle is what makes him not just a world-class athlete, but also an inspiration to everyone around him.\" WATCH:&mdash; HeyNoorr (@HeyNoorr) Kohli's discipline has been instrumental in bouncing back from a recent dip in form. His century in Perth marked his tenth against Australia Down Under, placing him just one short of Sir Donald Bradman's record for centuries against the same opposition away from home - 11 vs England. As India prepare for the crucial Pink Ball Test starting Friday in Adelaide, Kohli's fitness and form will play a pivotal role in the team's quest to secure a spot in the World Test Championship final at Lord's next year. 115692621",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115987823/115987823.jpg",
    "image1": "",
    "date": "5/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-05T05:42:00+05:30",
    "dateModified": "2024-12-05T05:42:00+05:30"
  },
  {
    "title": "Prominent Indian cricketers who are not on talking terms with MS Dhoni",
    "link": "https://worldsnews24.vercel.app/sports/prominent-indian-cricketers-who-are-not-on-talking-terms-with-ms-dhoni",
    "siteurl": "https://worldsnews24.vercel.app/sports/prominent-indian-cricketers-who-are-not-on-talking-terms-with-ms-dhoni",
    "description": "Prominent Indian cricketers who are not on talking terms with MS Dhoni",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115980221/115980221.jpg",
    "description1": "MS Dhoni, one of the most respected figures in Indian cricket, has had a stellar career both as a player and captain. Known for his calm demeanour and strong leadership, Dhoni’s relationships with his teammates have generally been amicable, but it has been come to notice that a few Indian cricketers might not be on talking terms with him due to professional differences.After former spinner Harbhajan Singh revealed that he is no longer on talking terms with Dhoni, here's a look at other Indian players who have had differences with MSD in the past and no longer communicate with him.115978582Gautam GambhirOne prominent name often linked to this speculation is Gautam Gambhir. The explosive left-handed opener who played crucial roles in India’s World Cup victories in 2007 and 2011, has publicly criticised Dhoni on several occasions, particularly over decisions made during the latter stages of his captaincy. Gambhir’s strong opinions have fuelled speculation of a strained relationship.Another point of contention for Gambhir has been the perception that Dhoni is often credited for hitting the iconic six that secured India’s 2011 World Cup victory. This has reportedly irked Gambhir, who firmly believes the win was a collective team effort rather than the result of individual brilliance.A serious and outspoken figure in the dressing room, Gambhir has also been vocal about his displeasure with the controversial rotational policy introduced by Dhoni during the 2012 CB Series in Australia. The policy aimed to rotate senior players like Gambhir, Virender Sehwag, and Sachin Tendulkar to make room for younger talent, including Rohit Sharma, as part of long-term planning for the 2015 World Cup in Australia. Gambhir criticised this approach, as it disrupted team balance and",
    "description2": " appeared to sideline experienced players.115959532Yuvraj SinghYuvraj Singh, one of India’s greatest all-rounders, is also believed to have had differences with Dhoni. Despite playing a key role in India’s 2011 World Cup triumph, Yuvraj felt he didn’t receive adequate backing during his return to international cricket after recovering from cancer.During the Ranveer Allahbadia podcast released last year, Yuvraj revealed that his friendship with Dhoni was primarily due to cricket, as their vastly different lifestyles meant they wouldn’t have been friends otherwise.Another significant factor contributing to their strained relationship was Yuvraj’s father, Yograj Singh, who frequently made disparaging remarks about Dhoni in public, often criticising the legendary captain’s decisions and leadership.Harbhajan SinghHarbhajan Singh, one of India’s greatest off-spinners with 417 wickets in 103 Tests, enjoyed immense success under Dhoni's captaincy, including victories in the 2007 T20 World Cup, the 2011 ODI World Cup, and his stint with Chennai Super Kings (CSK) in the IPL. However, Harbhajan recently revealed that he no longer speaks to Dhoni.While the veteran spinner chose not to delve deeply into the reasons behind their differences, he did mention that their interactions during his time with CSK were limited to on-field conversations.The former off-spinner also revealed that Dhoni does not respond to his calls, hinting at a lack of communication between the two. Despite their shared successes, Harbhajan’s remarks suggest that their relationship has grown distant over the years.While these speculations have made headlines, it’s important to note that none of these players have confirmed outright hostility, and such dynamics are often a part of competitive sports.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115980221/115980221.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-04T22:12:00+05:30",
    "dateModified": "2024-12-04T22:12:00+05:30"
  },
  {
    "title": "Sachin Tendulkar reunites with childhood friend Vinod Kambli, watch viral video",
    "link": "https://worldsnews24.vercel.app/sports/sachin-tendulkar-reunites-with-childhood-friend-vinod-kambli-watch-viral-video",
    "siteurl": "https://worldsnews24.vercel.app/sports/sachin-tendulkar-reunites-with-childhood-friend-vinod-kambli-watch-viral-video",
    "description": "Sachin Tendulkar reunites with childhood friend Vinod Kambli, watch viral video",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115945115/115945115.jpg",
    "description1": "Sachin Tendulkar and Vinod Kambli reunited at the unveiling of a memorial for their childhood coach, Ramakant Achrekar, at the historic Shivaji Park on Tuesday. The visuals of their meeting quickly went viral on social media, capturing the attention of cricket enthusiasts worldwide. 115931965While the audio of their conversation was unclear, the meeting appeared to end on an awkward note, with Kambli seemingly wanting to sit with Tendulkar before being asked to leave. This incident raised concerns among fans about Kambli's well-being.Watch:&mdash; ANI (@ANI) The reunion brought back memories of their legendary partnership in a Harris Shield match, where they scored a staggering 664 runs together for their school, Shardashram Vidyamandir, against St Xavier's. Kambli scored 349 ru",
    "description2": "ns, while Tendulkar amassed 326 runs, both remaining not out, cementing their status as prodigies at a young age.Tendulkar's illustrious international career spanned over two decades, during which he played 200 Tests and 463 ODIs for India.  115931391He holds the record for the most runs scored in both formats and is the only player in cricket history to score 100 international centuries, solidifying his reputation as one of the greatest players of all time.Kambli, on the other hand, had a relatively shorter international career, playing 17 Tests and 104 ODIs for India. He scored 1084 runs in Tests, including four centuries (two of which were double centuries), at an impressive average of 54.20. In ODIs, he amassed 2477 runs at an average of 32.29, with two centuries to his name.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115945115/115945115.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-03T23:13:00+05:30",
    "dateModified": "2024-12-03T23:13:00+05:30"
  },
  {
    "title": "Vaibhav Suryavanshi, 13 years old, stars as India march into U-19 Asia Cup semifinals with 10-wicket win over UAE",
    "link": "https://worldsnews24.vercel.app/sports/vaibhav-suryavanshi-13-years-old-stars-as-india-march-into-u-19-asia-cup-semifinals-with-10-wicket-win-over-uae",
    "siteurl": "https://worldsnews24.vercel.app/sports/vaibhav-suryavanshi-13-years-old-stars-as-india-march-into-u-19-asia-cup-semifinals-with-10-wicket-win-over-uae",
    "description": "Vaibhav Suryavanshi, 13 years old, stars as India march into U-19 Asia Cup semifinals with 10-wicket win over UAE",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115974653/115974653.jpg",
    "description1": "India secured a dominant 10-wicket victory over the United Arab Emirates in their final Group A match of the U-19 Asia Cup in Sharjah on Wednesday. This win propelled them into the semi-finals.India will face Group B toppers Sri Lanka in the semi-finals. The other semi-final will see Group A leaders Pakistan take on Bangladesh on Friday.Pakistan and Sri Lanka came through the group stage undefeated, setting the stage for an exciting last-four clash.Thirteen-year-old Vaibhav Suryavanshi showcased his remarkable talent, living up to the expectations surrounding him.The UAE batted first but struggled, regularly losing wickets and ultimately being bowled out for a mere 137 runs in 44 overs.&mdash; ACCMedia1 (@ACCMedia1) Yudhajit Guha, India's right-arm medium pacer, led the bowling attack with impressive figures of 3/15. Chetan Sharma and all-rounder Hardi",
    "description2": "k Raj also contributed significantly, each taking two wickets for 27 and 28 runs, respectively.India comfortably chased down the target in just 16.1 overs, thanks to unbeaten half-centuries from openers Suryavanshi and Ayush Mhatre. Suryavanshi scored a quickfire 76 off 46 balls, while Mhatre contributed a steady 67 off 51 balls.Suryavanshi's recent acquisition by Rajasthan Royals at the IPL auction for Rs 1.10 crore, making him the youngest player ever in the IPL, added to the excitement surrounding his performance.The left-handed Suryavanshi's innings included three fours and six impressive sixes. Mhatre also displayed his power-hitting abilities, smashing four boundaries and four sixes.India's U-19 Asia Cup campaign began with a disappointing 43-run loss to arch-rivals Pakistan. They then bounced back strongly, thrashing Japan by a massive 211 runs.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115974653/115974653.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 12:41:15 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-04T17:50:00+05:30",
    "dateModified": "2024-12-04T17:50:00+05:30"
  },
  {
    "title": "Cricket Australia is battle-ready to fight racism and prevent a Mohammed Siraj-like incident during the Border-Gavaskar Trophy",
    "link": "https://worldsnews24.vercel.app/sports/cricket-australia-is-battle-ready-to-fight-racism-and-prevent-a-mohammed-siraj-like-incident-during-the-border-gavaskar-trophy",
    "siteurl": "https://worldsnews24.vercel.app/sports/cricket-australia-is-battle-ready-to-fight-racism-and-prevent-a-mohammed-siraj-like-incident-during-the-border-gavaskar-trophy",
    "description": "Michael Napper, who has been the driving force behind Cricket Australia’s Multicultural Action Plan, explains the roadmap of what they have done to tap the sub-continent students to be present at all types of cricket games and also educating immigrants about Australian culture.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Siraj_d431ae.jpg",
    "description1": "In the final game between India and Australia of the Benson &amp; Hedges World Championship of Cricket at the Melbourne Cricket Ground, a local cricket fan was holding a banner titled: “Bus Conductors vs Taxi Drivers.” In 2020-21, India pacer Mohammed Siraj was called a “Brown Dog” and “Big Monkey” in a series of racist slurs hurled by a group of Australian spectators. To combat racism, Cricket Australia has come up with the Multicultural Action Plan, whose sole aim is to battle racism. “I think first and foremost, we have to acknowledge that racism still exists in society and hasn’t gone away. It’s still there. And it’s going to be there for some time, unfortunately,” Michael Napper, who has come up with Cricket Australia’s initiative to engage with multicultural audiences, tells The Indian Express from Melbourne. “We recognize that sport should be free of that. And it should just be a place where everyone can come and celebrate, feel welcome, and be part of that. So I’m really hopeful that we have moved beyond all those infamous incidents,” he says. Napper explains the roadmap that they have made to ensure that there is no place for racism in Australian cricket at any level. Be it grassroots or at the highest level and there would be steps that will ensure a due process is followed. “It’s very simple. If we can identify and know who has done an act like that, whatever that act might be, they would immediately be asked to leave. I’m saying that politely, they’ll be removed. And that will happen within the venue itself. They would then be part of… call it a legal process where we would look at a potential banning order. And so they can’t come to cricket going forward. If it happened in grassroots and playing cricket, it would be a similar thing, we would go through a tribunal process, there’d be an investigation. And likewise, if they were found to have made racist remarks or comments, there would be some sort of sanction, whether that be a ban, a fine or something like that. It’s something we are taking very seriously.\" Napper, who has been the driving force behind Cricket Australia’s plan to reach out to the sub-continent audience, explains why they want to tap the rapidly increasing South Asian population in Australia, and when they came up with the plan. “I think it probably started over the last, call it 10 years or so. There is a high level of migration that’s coming over. You know, within cricket, we’ve been seeing more and more South Asian heritage or ancestry or even people who were born in South Asia coming to our games, following cricket, and being part o",
    "description2": "f the Australian cricket family. So for us, it’s really about making sure that they feel included in everything we do. “When COVID hit really, and when we were redesigning our new strategic plan. So a key focus for us was, right, how can we better engage with the multicultural and South Asian audience within Australia to really make them feel part of the sport. And so that was where the Multicultural Action Plan came from,” he says. Cricket Australia has also tapped into the sub-continent students studying in universities across Australia. “We know the student population in Australia is massive, particularly in Melbourne. We have reached out to them, and you’ve seen the impact that had in the recent Pakistan game, the ODI that we had over at the MCG. That crowd was so young, so vibrant, making so much noise, a huge amount of that comes down to the work we’ve done in contacting universities. “We’ve got a WhatsApp group or a mailing list of 40,000 students now from a South Asian background. So yeah, spot on. It’s a key audience for us and someone who we want to continue connecting with, not just for international cricket, because obviously, you know, Pakistan or India might come once every few years. But we want to make sure that you’re also coming to the Big Bash and being part of Australian cricket. We want to make sure that they can enjoy cricket regardless of the year,” says Napper. “Potentially, we might end up with a sea of blue at certain Test matches this summer, where we’re seeing lots of Indian fans. And that could be contentious for some Australians. But we’re hoping that we’re going to have a really good festival and party atmosphere,” says Napper. There is also the very important aspect of educating immigrants about Australian culture. “And it’s a two-way thing. We actually are trying to do that in all forms to get right. So we know that if you’re attending games, it’s about understanding that, you know, Australian fans will typically visit the game with their friends, have fun, drink alcohol, and celebrate. And it’s much more of that more laid-back affair where you see it in the sun, you watch the game, and there’s that constant buzz. “Then you have the Indian fans coming in who want to bring instruments, they want to shout, they want to make noise, they want to have that festival-like atmosphere. And it’s making sure both of those things can coexist. And then similarly, when you’re talking about grassroots cricket, or you’re talking about watching cricket, it’s about making sure those cultures can all come together and enjoy it in a way that suits them.”",
    "image": "https://images.indianexpress.com/2024/12/Siraj_d431ae.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T08:15:50+05:30",
    "dateModified": "2024-12-04T08:15:50+05:30"
  },
  {
    "title": "India vs United Arab Emirates U19 Asia Cup 2024, LIVE Cricket Score: UAE wins toss and opts to bat first in Sharjah",
    "link": "https://worldsnews24.vercel.app/sports/india-vs-united-arab-emirates-u19-asia-cup-2024-live-cricket-score-uae-wins-toss-and-opts-to-bat-first-in-sharjah",
    "siteurl": "https://worldsnews24.vercel.app/sports/india-vs-united-arab-emirates-u19-asia-cup-2024-live-cricket-score-uae-wins-toss-and-opts-to-bat-first-in-sharjah",
    "description": "India vs United Arab Emirates (IND-U19 vs UAE-U19) U19 Asia Cup 2024 Live Cricket Score Online Updates: Both teams have won one game and lost one game. However, UAE is above in the table at the second position on the virtue of their superior run rate",
    "thumbnail": "https://images.indianexpress.com/2024/12/indian-team.jpg",
    "description1": "India U19 vs United Arab Emirates U19 (IND-U19 vs UAE-U19) U19 Asia Cup 2024 Live Cricket Score Updates: UAE 19 skipper Ayan Afzal Khan won the toss and opted to bat first against Mohamed Amaan's India U19 in ACC U19 Asia Cup on Wednesday Both teams have won one game and lost one game. However, UAE is above in the table at the second position on the virtue of thei",
    "description2": "r superior run rate. While Pakistan at the top of the table and Japan has been eliminated from the competition. Indian skipper Aman has been in great form in the tournament and will be hoping to continue it going forward in the game against UAE. In two games so far he scored 138 runs including a ton. FOLLOW LIVE SCORES AND UPDATES OF THE GAME BETWEEN IND VS UAE U19",
    "image": "https://images.indianexpress.com/2024/12/indian-team.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-04T09:30:42+05:30",
    "dateModified": "2024-12-04T09:30:42+05:30"
  },
  {
    "title": "Border-Gavaskar Trophy: Thousands come to watch Indians practise; Rohit Sharma puts in extra time at the nets",
    "link": "https://worldsnews24.vercel.app/sports/border-gavaskar-trophy-thousands-come-to-watch-indians-practise-rohit-sharma-puts-in-extra-time-at-the-nets",
    "siteurl": "https://worldsnews24.vercel.app/sports/border-gavaskar-trophy-thousands-come-to-watch-indians-practise-rohit-sharma-puts-in-extra-time-at-the-nets",
    "description": "Security finding it tough to deal with massive crowds rushing in to see the away team while there's hardly anyone to watch the Australians train.",
    "thumbnail": "https://images.indianexpress.com/2024/12/IND-NETS-2.jpg",
    "description1": "“They told me it will be busy, but this busy, huh!” The elderly lady at the entrance of the Adelaide Oval says with a smile. Around her, utter chaotic joy prevails as at least 3,000 fans storm through just to see the Indian team practise. Dhol beats, cries of ‘jeetega bhai jeetega’, ‘Kohli Kohli’ and ‘Rohit Rohit’ ring in the air. It was an open session for fans to watch the Australian and Indian teams training. There were hardly any people to watch the Australians train in the afternoon but around 5 pm, they blew in like a storm to see the Indians, shocking the lady at the gate. Around 6 pm - the Indians had a long training session that started even before 5 pm and ended nearly three-and-a-half hours later - a group of at least 20 Australian schoolkids in uniform ran in to see them. There was no such group for the Australians training. They weren't kids of Indian origin either, such is the attraction of this Indian team Down Under. The official training was supposed to start at 5:30 pm local time, and it did, but two Indians were at nets an hour earlier: captain Rohit Sharma and Rishabh Pant, who hit the batting nets straightaway, before the crowd came in. Rohit’s training in particular was interesting.“Yaar, gaddha hai idhar! (There is a hole/dent)” he said about an area of the ground at the popping crease of the first net he went into bat. There are four nets at the Adelaide Oval, and he chose to carry on in that particular one as it didn’t upset his rhythm. The skipper stood carefully, his back leg cutting the popping crease line. The dent was particularly bad just behind the crease. Even as a support staff suggested rather naively that he could perhaps stand a touch ahead, Rohit replied, “arre! I want to stand here”. And so he stood, back leg on the crease line. His first movement was opening that front leg that pressed forward at an angle towards the bowler. Rohit has a rather visible twitch of both feet as the bowler is about to enter the delivery stride, his knees flexing, and the front foot opening out a touch. This was his main focus in the nets. He was seen discussing with assistant coach Abhishek Nayar if he was getting the stance and movement right. In his first stint, before the other players came, Rohit faced new shiny balls. Does that mean he might yet open the innings in the Adelaide Test or was it to just ensure that he face",
    "description2": "d deliveries that seamed a bit - as new balls tend to do. Once the rest of the team joined him at the batting nets after warm-up and catching practice, he faced old balls. Possible pointers In each of the four nets, two batsmen were together. If the pairings are anything to go by, Rohit was paired with Pant. One batsman facing a few balls, and another at the non-striker’s end. KL Rahul and Yashasvi Jaiswal; Virat Kohli and Shubman Gill; Rohit and Pant; Washington Sundar and Nitish Reddy. That indicates Jaiswal and Rahul as the openers, Gill and Kohli the no.3 and no.4 respectively and so on. But all that's speculation. Either way, suffice to say Indians practised long, hard, and rather intensely, with at least 3,000 people hollering around them. Incidentally, head coach Gautam Gambhir, who had gone to India after the Perth Test and missed the warm-up game in Canberra, was back and stood behind the stumps at one of the four nets. Arms crossed, face as intense as ever, he was almost motionless watching proceedings. Now and then, when Rohit was between his stints from one net to another, they would have a short chat, but for the main part, Gambhir stood there like a statue, observing everything quietly. Just like the statue of Clem Hill, who played in the early 1900s, that stands outside the arena, near the road across the river that shimmered in the afternoon sun. Inside though, the Indians, and for that matter Australians, were smashing the ball. Even Marnus Labuschagne, who has been under fire for batting without intent in the middle. At the nets in the afternoon, he was making an obvious effort to play shots. In Perth, he was trying to defend or leave- even in the nets – in Adelaide, he was more intent on hitting. The pink ball's effect on cricketers is rather fascinating. Never mind Labuschagne, who probably has his own poor form to overcome, the general feeling among batsmen about the pink ball is that it doesn’t do much under sun in the afternoon, but can unleash trickery under lights. And so, it's better to try and score as many runs as possible before it unleashes its devilry on them. The last word, however, goes to that security lady. “How many people turn up for nets for the Indians in your country?!” Oh, it’s not open to the public there. And she goes, “Makes sense, I can see 10,000 landing up. How will people like me manage, then?!”",
    "image": "https://images.indianexpress.com/2024/12/IND-NETS-2.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T20:45:30+05:30",
    "dateModified": "2024-12-03T20:45:30+05:30"
  },
  {
    "title": "Ding Liren ‘outplayed’ by Gukesh, but salvages draw in absolute rollercoaster at World Chess Championship",
    "link": "https://worldsnews24.vercel.app/sports/ding-liren-outplayed-by-gukesh-but-salvages-draw-in-absolute-rollercoaster-at-world-chess-championship",
    "siteurl": "https://worldsnews24.vercel.app/sports/ding-liren-outplayed-by-gukesh-but-salvages-draw-in-absolute-rollercoaster-at-world-chess-championship",
    "description": "At 5 hours and 20 minutes, this was the longest game of the match so far between Gukesh and Ding Liren at the 2024 World Chess Championship. ",
    "thumbnail": "https://images.indianexpress.com/2024/12/Gukesh-Liren-2.jpg",
    "description1": "For about five hours on Tuesday, world champion Ding Liren was scrambling. He ducked threats on the board. He evaded time trouble. He walked on the edge of traps that would have led to uncomfortable pins. For five hours — to reference the popular meme — Ding was not chilling. But eventually, Ding managed to salvage a draw out of a precarious situation in Game 7 after a 72-move defensive masterclass at the World Chess Championship to keep the contest at a level pegging. At 5 hours and 20 minutes, this was the longest game of the match so far between Ding and D Gukesh. The world champion’s troubles on the board started early. In the past six games, Ding has emerged as the better-drilled combatant, replying on opening prep to catch his teenage opponent off guard. On Tuesday, it was his turn to fight his way out of his opponent’s best-laid plans. Ding had just returned to his chair after a break in his private lounge when he spotted a novelty on the board from his young opponent in a line that is well known. Gukesh’s 7.Re1 (moving his rook sideways to the left by a square, rather than capturing the d5 pawn or advancing his b file pawn) was a move that caught the Chinese off guard. It took the champion 28 minutes to even fashion a response (7.dxc4, where Ding picked off an undefended pawn from Gukesh). “When I saw this move, I had just come back from the toilet. I was totally shocked. That’s why I spent a lot of time on my response,” said Ding. That was just the start of his troubles. At some stage in the middle game, Ding’s queen was trapped like a beached whale after making a daring breach past Gukesh’s defensive lines. For about 10 moves, it shuffled around, not doing much before finally a trade of queens put it out of its misery. Shortly afterwards, the bishops too got traded. On the move when Gukesh captured Ding’s queen, the engine later suggested that had Gukesh brought his bishop back (32.Bg5 instead of 32.Qxf5) and let Ding take his queen instead of the other way round, he could have had a significant advantage. “Before the queen exchange and even after it, I thought I should be winning the ga",
    "description2": "me,” said Gukesh. In the nick of time While trying to extricate himself out of trouble, Ding spent so much time on the clock that he played his 40th move — after which players get an additional 30 minutes on the clock — with just seven seconds left. That move was a huge blunder as well (instead of 40.Ke5 which he played, the world champion should have opted for 40.Nc8-b6 which would have earned him a chance to draw.) “I was beaten many times. Firstly in the opening. Then the middle game,” Ding admitted in the post-game press conference. “I thought I was totally inferior during the game. I was getting outplayed. But like many other times, maybe the position was not so bad. And I need to have more confidence in my moves. Today’s game was an absolute rollercoaster. I was satisfied that I was not knocked out and will live to fight another day.” Ding had been scrambling to not lose on time for the second time at the World Chess Championship after going down in similar circumstances in Game 3. Winning Tuesday’s game would have been strategically important, as it was the halfway mark of the world chess championship. After seven games, both players have 3.5 points each. For Gukesh, there were a few inaccuracies that allowed his grip on the game to slip. Two of those moves came close to each other: 44.Ke1 (where the computer suggested 44.Ra6) and 46.Bd1 (the computer's suggestion 46.Ke2). These two moves allowed Ding to cling on for a draw. While Gukesh realised he had missed his best shot at taking the lead in the best-of-14 game match, he was not too dejected that his opponent had pulled a draw out of thin air. “Today was a missed chance. Bit of a disappointment. But he also missed some chances earlier in the match. So it’s fair we’re here,” Gukesh said before pointing out the positives from Game 7, “Obviously outplaying him from the start. The most positive thing for today was that I felt good on the board.” For the Chinese world champion, it was a draw that was as good as a psychological win. “It was hard to believe. I made many mistakes. Fortunately, I saved the game,” said the Chinese GM with a smile.",
    "image": "https://images.indianexpress.com/2024/12/Gukesh-Liren-2.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T20:51:51+05:30",
    "dateModified": "2024-12-03T20:51:51+05:30"
  },
  {
    "title": "Why is Pat Cummins’ Australian team not unequivocally loved in Australia?",
    "link": "https://worldsnews24.vercel.app/sports/why-is-pat-cummins-australian-team-not-unequivocally-loved-in-australia",
    "siteurl": "https://worldsnews24.vercel.app/sports/why-is-pat-cummins-australian-team-not-unequivocally-loved-in-australia",
    "description": "It has won the Test, ODI and T20 world titles but still this exceptional team gets called as soft, woke and UnAustralian.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Cummins.jpg",
    "description1": "Early morning, a chat bubbles up at the central market, couple of kilometres from the Adelaide Oval cricket stadium. Established in the late 1800’s, it’s a large indoor market for fresh produce - vegetables, cheese, spices, fruits, cafes, and whatever else one can think of eating. The talk starts about weather as Friday, the opening day of the second Test, is supposedly set to see some rains. Archie, possibly in his 60’s, isn’t too happy. Not with the forecast but with the Australian team. “Don’t worry, even if two days gets washed out, this Australian team will lose in just three days. Too bloody soft. Too woke. And now they are in-fighting also.” And he is off poking at what seems a rather oversized cabbage. It’s not a random cabbage-loving fan that is talking on those terms. For a while now, Pat Cummins’s Australian team has been copping it amongst a certain section of fans, media, and even former cricketers. ‘Captain Woke’, 'UnAustralian', 'Too soft', 'Too friendly' and such. And this is a team that has won nearly everything under the sun: Test championship, ODI World Cup, T20 World Cup. The loss at Perth Test has already kicked up such talk again from the former cricketers and fans. Bizarrely, a stray comment from Josh Hazlewood - he said before the final day’s play at Perth that “it’s now upto the batters” - has been blown out of proportion. Media interpreted it as a hint to a full-scale divide in the team. Player after player have been forced to refute it in media interactions. But the damage has been done. Why is this Australian team not so loved at home but liked more outside the country? That question is posed to Greg Rowell, a Cricket Australia board member involved in strategising and a former first-class player who had taken Sachin Tendulkar’s wicket in a Prime Ministers XI game in 1991. Rowell takes a measured pause and corrects the question. “By a certain section of older fans and older former cricketers here,” he tell The Indian Express. “They are used to the old Australian way of playing. And what goes with it: the hard sledging, being not just tough but seen as being tough and there is a difference there, a touch abrasive to the opponents that’s defined as not giving a quarter to the other team. To be fair to that generation of cricketers, it was the way cricket was played here. Snarl more, less smiles, and reserve the nicer side after stumps. “It’s part of the Australian cricket identity. It comes from our past, the weather - we had to prove to the English in those years, the hot sun comes into it too, and it was how, not just international cricket, but first-class and backyard cricket too was played even between brothers. Cricketing fans outside the country might have misconstrued it because cricket perhaps in say India or West Indies was more fun, a sport - we Australians saw it a bit differently. I would say it was a cultural difference,” Rowell says. And now even as Australia is striving to be more diverse and if possible be inclusive in that diversity, Pat Cummins’ team probably should be poster boys of that brave new world. But they aren’t. “True. This team does play differently and I would say Australia as a cricketing country needed to. In the past, cricketers had gone a bit too far and alienated even some parts of the cricketing world,” Rowell says. He doesn’t mention the incidents but that straying too far was reflected in the sandpaper gate, too much unsavoury sledging, and a certain roughness about the teams. “We had to pull back and this team does it naturally, organically. Pat is really that sort of a guy.” Cummins in particular has copped a lot from many Australians for questioning the sponsorship of the Australian team by a coal-powered energy company Alinta. As it happenned Cricket Australia’s deal with them ended and even",
    "description2": " though the company said it was a move decided before Cummins’s statements; media and fans had piled on the Australian captain. “Climate catastrophist clown with far-left views,” screamed Sky News Australia and social media called him “Captain Woke”. Australia Advance, a far-right media, snarled in a piece, “Shut up Cummins, and focus on winning a few games”. It propped up again when Cummins and his team took the knee for ‘Black Lives Matter’. Not that he was flustered. “I don’t even know what Woke means. If anything some people would say it’s a good thing. It’s a label, means nothing. If anyone thinks it (taking knee for black lives matter) is a bad thing, then those five minutes out of our lives is the worst thing that can happen to them, we don’t care.” In Perth, the former cricketers went after the team for their “body language” on the second day’s play during India’s second innings. “This team plays as hard as any,” says Rowell. “They just do it differently, quietly, that’s all. Some of the Indian greats like Tendulkar or Dravid, they weren’t at opponent’s face all the time, were they?” A Australian player who has copped a bit for that “quietness” on the field is Alex Carey, the wicketkeeper. For a country that has seen dynamic glovesmen like Rod Marsh, the embodiment of the quintessential Aussie cricketer, doughty Ian Healy, the swashbuckling Adam Gilchrist, or even the eccentrics like Tim Zoehrer; Carey can come across as quiet as mouse behind the stumps. Or in his rather earnest schoolboyish image. Never mind that he was the man who ran out Jonny Bairstow, who had stepped out to gardening the pitch in an Ashes Test, his relationship with the irate section of Aussies hasn’t really warmed up. On Tuesday, he was asked what’s his relationship with the Australian fans. “I really don’t know. There were some who patted me and wished me luck here in Adelaide. I know I am not liked in England,” he says with a smile. “But I don’t know how to answer that question. I am just myself. The team knows me, I am not that sort of the guy (referring to whether he feels the need to chirp more from behind the stumps). So, I just cut out the external noise and do my thing. Iam just being myself.” That’s exactly what Cummins has been trying: to make his players be themselves. If that means the vegan Adam Zampa is uncomfortable about being a face for KFC or if someone in the team has an opinion about climate change. A soft team wouldn’t have done what Carey did to run out Bairstow, a soft leader won’t have the courage to bowl first in a World cup final in Ahmedabad. Australians of the past used to impose their ego on the opponents. Australians, under Cummins, try to use the ego of the opponents, sucking them into mistakes. “This is a smart team which has won so many titles, but I fear the old generation of players, and perhaps fans from that era, might not warm up to this team,” Rowell says. “But as I said the teams had overstepped in the past. We had to pull back. And this team does it. This Australian team is more loved around the cricketing world, and that’s important. Australianism is not a fixed concept. It keeps changing. The world is changing. The older Australian cricketers who have a problem with the team would hopefully realise it.” Considering they haven’t even when this Australian team has been winning everything, it does seem rather optimist. But to leave the definitions of Australianism or the Australian way to an older section of people, be it fans or cricketers, is not ideal. Cummins knows it as he once put pithily, “What is this supposed Australian way, I don’t know”. The problem is that the cabbage-hunter in the old Adelaide market thinks he knows it, and so this tussle between the new and old is likely to continue in this sun-burnt country for a while yet.",
    "image": "https://images.indianexpress.com/2024/12/Cummins.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T19:27:51+05:30",
    "dateModified": "2024-12-03T19:27:51+05:30"
  },
  {
    "title": "FIDE World Chess Championship: About glances at the opponent and pre-game rituals",
    "link": "https://worldsnews24.vercel.app/sports/fide-world-chess-championship-about-glances-at-the-opponent-and-pre-game-rituals",
    "siteurl": "https://worldsnews24.vercel.app/sports/fide-world-chess-championship-about-glances-at-the-opponent-and-pre-game-rituals",
    "description": "In the middle of Game 1, the Chess24 broadcast pointed out that Gukesh had spent some part of the morning solving puzzles on the chess.com app with a feature called Puzzle Rush.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Gukesh-Ding.jpg",
    "description1": "As the tension mounted on him in Game 7, Ding Liren sneaked a couple of glances at D Gukesh as he contemplated his next move. The 18-year-old in front of the world champion has not noticed Ding’s furtive looks. He is in a meditative trance with his eyes shut. It’s become something of a tic for the boy from Chennai on the board. Each time he finds himself on the board with his opponent’s clock running, he tends to shut his eyes and calculate. “I’m in a room where there’s nothing else to see. So I close my eyes,” Gukesh had said after the previous game. “I close my eyes quite often during games. Sometimes, it is just that it’s easier to calculate with your eyes closed. So mostly just thinking about the position.” A couple of games back, the FIDE broadcast started calculating how much time Gukesh spends with his eyes shut on the board and how much time the players are spending away from their playing chairs. Grandmaster David Howell, a regular in the commentary booth, informed that this data is collected using Artificial Intelligence. Just then, Ding steals another glance at his zen-like opponent. Ukrainian grandmaster Anna Muzychuk, the special guest during the FIDE broadcast on Tuesday, chuckled as she suggested that the organisers of the 2024 World Ch",
    "description2": "ess Championship use AI to calculate how much time Ding has spent eyeing his opponent. “In the first game (of the world championship), the better Ding’s position was, the more often he started to stare at Gukesh. That was my impression. Sometimes, you just do it without thinking. Other times we do it on purpose,” she said with a glint in her eye. When asked if there were other tricks grandmasters use to psych out their opponents, she said: “When I was a kid, there were many tricks. Looking at one part of the board and pretending that the most important thing is happening there. But creating a threat on the other side.” Pre-game rituals In the middle of Game 1, the Chess24 broadcast pointed out that Gukesh had spent some part of the morning solving puzzles on the chess.com app with a feature called Puzzle Rush. Apparently, the 18-year-old had hit a score of 53 in the three-minute puzzle rush in the morning, just short of his record of 58. Gukesh was asked if he had a specific pre-game routine and if he had any rituals. “Not much. I just try to follow a specific routine. Puzzle Rush is always nice to do to warm up my mind,” said Gukesh. Ding is then asked if he has any pre-game routines. “I get up. I shower. I then have some coffee,” he grins awkwardly.",
    "image": "https://images.indianexpress.com/2024/12/Gukesh-Ding.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-03T23:37:29+05:30",
    "dateModified": "2024-12-03T23:37:29+05:30"
  },
  {
    "title": "\"We've seen the quality Zak has\": Woakes reflects on Crawley's recent Test performance",
    "link": "https://worldsnews24.vercel.app/sports/we-ve-seen-the-quality-zak-has-woakes-reflects-on-crawley-s-recent-test-performance",
    "siteurl": "https://worldsnews24.vercel.app/sports/we-ve-seen-the-quality-zak-has-woakes-reflects-on-crawley-s-recent-test-performance",
    "description": "\"We've seen the quality Zak has\": Woakes reflects on Crawley's recent Test performance",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204043308.jpg",
    "description1": "\n\n\nWellington [New Zealand], December 4 (ANI): Ahead of the second Test match against New Zealand, England bowling all-rounder Chris Woakes while reflecting on opener Zak Crawley's recent Test performance said that everyone has seen the quality the 26-year-old has.\nEarlier in the first Test in Christchurch, England clinched an eight-wicket win which helped them to take a 1-0 lead in the Test series against the Kiwis.\n\nCrawley made his Test debut in 2019 against New Zealand, following that, he has played 51 long format matches and scored 2848 runs at a strike rate of 65.47 and an average of 31.3.\nIn the Christchurch Test, the 26-year-old displayed a sluggish performance. In the first innings he was dismissed for a 12-ball duck and in the second innings, the English opener scored just one run from eight balls.\nSpeaking ahead of the second match, Woakes said that most of the time stats that come out are pure coincidence.\n\"A lot of the time I think these stats that come out are pure coincidence. I don't think it's anything to do with anything. New Zealand have some very good opening bowlers. He faces the new ball when they are their freshest and best, so he's probably got some good balls in there,\" Woakes was quoted by ESPNcricinfo as saying.\n\n\nThe bowling all-rounder talked about Crawley's opening role in the batting lineup and said that it's a tough job.\n\"We've seen the quality Zak has",
    "description2": ". Opening the batting is such a difficult job to do, that you will have occasions where you get low scores. We've seen what Zak can do. When he gets in, he's one of the worst batters to be bowling at in international cricket. I'm sure that will change,\" he added.\nRecapping the first Test match, Jacob Bethell's debut fifty and Brydon Carse's dominance with the ball helped England secure an eight-wicket victory over New Zealand at Hagley Oval in Christchurch.\nNew Zealand started Day 04 at 155/6 at Hagley Oval, with a four-run lead against England. The Kiwis added 99 runs to their overnight total. Daryl Mitchell (84) displayed a stunning performance with the bat and had support from Nathan Smith (21) and other tailenders on the way.\nHowever, Brydon Carse, who picked three of the four remaining wickets helping himself to career-best figures of 6/42, ensured that England had to chase only 104 to secure a win in the Christchurch Test.\nThe chase wasn't a problem for the Three Lions as New Zealand bowling failed to create any threat on the fourth day at Hagley Oval. Jacob Bethell led the English batting lineup during the chase and slammed a scintillating unbeaten fifty on his debut, with just 37 balls.\nEngland Playing XI for 2nd Test: Zak Crawley, Ben Duckett, Jacob Bethell, Joe Root, Harry Brook, Ollie Pope (WK), Ben Stokes (C), Chris Woakes, Gus Atkinson, Brydon Carse, Shoaib Bashir. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204043308.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 1:09:04 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "L&T Technology Services Secures $50 Million Deal as a Strategic Partner From a Global Network Provider",
    "link": "https://worldsnews24.vercel.app/sports/l-t-technology-services-secures-50-million-deal-as-a-strategic-partner-from-a-global-network-provider",
    "siteurl": "https://worldsnews24.vercel.app/sports/l-t-technology-services-secures-50-million-deal-as-a-strategic-partner-from-a-global-network-provider",
    "description": "L&T Technology Services Secures $50 Million Deal as a Strategic Partner From a Global Network Provider",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204054154.jpg",
    "description1": "\n\n\nBusinessWire India\nBengaluru (Karnataka) [India], December 4: L&T Technology Services Limited (BSE: 540115, NSE: LTTS), a global leader in engineering and technology services, announced its selection by a leading global network solutions firm to provide Product Integration Services in North America, ensuring seamless deployment and support for customers across the region.\n\n\n\n\nThe multi-year agreement, estimated at USD 50 million, will enable the company to provide comprehensive support for the client's advanced networking solutions, ensuring seamless integration and success for customers across the region. LTTS will leverage its capabilities in AI and automation frameworks for the project deployment and execution.\n\nThe partnership combines LTTS' deep expertise in engineering and R&D services with the client's cutting-edge wireless networking solutions. Additionally, the companies aim to offer secure LTE an",
    "description2": "d 5G private networks across industries, unlocking new opportunities and enabling future-ready operations. The partnership will address current market demands while positioning itself for upcoming 5G advancements under 3GPP standards.\n\"This strategic engagement represents a significant milestone for LTTS, marking our first sizable breakthrough in global markets by leveraging the deep expertise of our Smart World & Communication (SWC) division in managing communication networks. By integrating a GLOCAL services model, cutting-edge automation and AI-driven frameworks, we will deliver value and reliability to our customer. This will help us elevate our partnership with the client further,\" said Amit Chadha, CEO & Managing Director, L&T Technology Services.\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by BusinessWire India. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204054154.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 1:09:04 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "CCI approves subscription of optionally convertible debentures of GMR infra enterprises by Platinum Stone A 2014 Trust",
    "link": "https://worldsnews24.vercel.app/sports/cci-approves-subscription-of-optionally-convertible-debentures-of-gmr-infra-enterprises-by-platinum-stone-a-2014-trust",
    "siteurl": "https://worldsnews24.vercel.app/sports/cci-approves-subscription-of-optionally-convertible-debentures-of-gmr-infra-enterprises-by-platinum-stone-a-2014-trust",
    "description": "CCI approves subscription of optionally convertible debentures of GMR infra enterprises by Platinum Stone A 2014 Trust",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204051356.jpg",
    "description1": "\n\n\nNew Delhi [India], December 4 (ANI): The Competition Commission of India (CCI) has given its nod for the subscription to optionally convertible debentures (OCDs) of GMR Infra Enterprises Private Limited (Target SPV) by Platinum Stone A 2014 Trust, acting through its trustee, Platinum Rock B 2014 RSC Limited (Acquirer).\nAccording to the Competition Commission of India, the proposed combination involves the issuance of unlisted and unrated OCDs by GMR Infra Enterprises to Platinum Stone A 2014 Trust.\n\nThis transaction is linked to the Target SPV acquiring approximately 9 per cent of the fully diluted shareholding of GMR Airports Limited (GAL) from its promoter, GMR Enterprises Private Limited (GEPL), both before and after the subscription of OCDs.\n\n\nThe acquired shares of GAL will be pledged to the Acqu",
    "description2": "irer as collateral for the OCD subscription amount.\nPlatinum Stone A 2014 Trust is a trust established under the Abu Dhabi Global Market, with its sole beneficiary being the Abu Dhabi Investment Authority (ADIA).\nADIA is an independent investment institution established by the Government of the Emirate of Abu Dhabi.\nGMR Airports Limited, the focus of this transaction, is a publicly listed company actively engaged in the development, management, and operation of airports in India and globally. GAL operates three major airports in India: Delhi International Airport, GMR Hyderabad International Airport, and GMR Goa International Airport.\nThe Target SPV, GMR Infra Enterprises, is presently non-operational. A detailed order from the CCI is expected to follow, outlining further specifics of the approval. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204051356.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 1:09:04 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "LTIMindtree Announces Partnership and Strategic Investment in Voicing.AI, An Agentic AI Solution for Customer Engagement Processes",
    "link": "https://worldsnews24.vercel.app/sports/ltimindtree-announces-partnership-and-strategic-investment-in-voicing-ai-an-agentic-ai-solution-for-customer-engagement-processes",
    "siteurl": "https://worldsnews24.vercel.app/sports/ltimindtree-announces-partnership-and-strategic-investment-in-voicing-ai-an-agentic-ai-solution-for-customer-engagement-processes",
    "description": "LTIMindtree Announces Partnership and Strategic Investment in Voicing.AI, An Agentic AI Solution for Customer Engagement Processes",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204053052.jpg",
    "description1": "\n\n\nBusinessWire India\nWarren (New Jersey) [US]/ Mumbai (Maharashtra) [India], December 4: LTIMindtree USA Inc., a wholly owned subsidiary of LTIMindtree [NSE: LTIM, BSE: 540005], a global technology consulting and digital solutions company, announced a partnership, including a strategic investment in Voicing.AI, a next-generation start-up. This partnership aligns with LTIMindtree's strategy, AI in everything, Everything for AI and AI for Everyone. Voicing.AI's proprietary technology brings human-like voice capability across more than 20 languages with conversational, contextual, and emotional intelligence, in what is typically referred to as 'agentic AI'.\n\nLTIMindtree aims to reshape the future of Business Processes by leveraging AI-led platforms. This will enable their clients to optimize costs, reduce risk, enhance user experience, address revenue leakages, and enhance upsell opportunities. LTIMindtree will help clients integrate Voicing.AI with their custom tools, knowledge bases - both structured or unstructured, CRM systems, and leading call management platforms and systems. This Agentic AI technology is fully compliant with SOC2, HIPAA, and multi-layered data ",
    "description2": "security protocols.\n\n\nYou can view the demo video here.\n\"Our investment with Voicing.AI aims to redefine how businesses interact with their customers through intelligent automation and AI,\" said Debashis Chatterjee, CEO and Managing Director, LTIMindtree. \"This partnership and investment not only underscore our commitment to innovation but also ensures that LTIMindtree is an early mover in capitalizing on the disruption expected across platform operations.\"\n\"Voicing.AI is fundamentally disrupting the massive customer engagement market by powering new revenue growth, personalizing customer connections, and fostering a human dialogue between a business and its customers. LTIMindtree presented us with a deeply focused comprehensive vision for this Responsible AI transformation and we are excited to partner with them,\" said Abhi Kumar, Co-Founder - Voicing.AI. \"We look forward to working with LTIMindtree's global clients to fulfill the growing demand as more enterprises look to automate their platform operations.\"\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by BusinessWire India. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204053052.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 1:09:04 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "Quantum AMC launches the Quantum Ethical Fund NFO (New Fund Offer) opens for subscription till December 16",
    "link": "https://worldsnews24.vercel.app/sports/quantum-amc-launches-the-quantum-ethical-fund-nfo-new-fund-offer-opens-for-subscription-till-december-16",
    "siteurl": "https://worldsnews24.vercel.app/sports/quantum-amc-launches-the-quantum-ethical-fund-nfo-new-fund-offer-opens-for-subscription-till-december-16",
    "description": "Quantum AMC launches the Quantum Ethical Fund NFO (New Fund Offer) opens for subscription till December 16",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204052452.jpg",
    "description1": "\n\n\nPRNewswire\nMumbai (Maharashtra) [India], December 4: Quantum AMC announced the launch of a new fund offer (NFO) with Quantum Ethical Fund. It closes on Monday, December 16, 2024. The Fund is an open-ended Equity Fund that invests in companies meeting an Ethical Set of Principles, with the objective of achieving long-term capital appreciation. The Fund will be managed by Chirag Mehta - Chief Investment Officer, Quantum AMC.\n\nIts investment objective is to achieve long-term capital appreciation by investing in Equity & Equity Related Instruments of companies following an Ethical Set of Principles.\nThe scheme will have a Direct and Regular Plan. The Fund Managers will allocate 80%-100% to the Equity & Equity related instruments of Companies following an Ethical set of Principles and 0%- 20% to the Debt & Money Market Instruments in compliance with Ethical Principles. The Scheme will follow an active investment strategy. The corpus of the scheme will invest in shares of companies meeting an Ethical set of Principles including of Shariah, Jainism and other ethical principles, encompassing a broad Ethical Framework.\nEthical investing allows investors to align their investments to their values, beliefs and ethical ideologies. There are many ideologies and there seems to be a large overlap between them alongside subtle differences. For e.g.: Shariah investing has unique approach in that financial transactions should be fair and equitable, financial rewards are correlated with the level of risk, efforts and responsibility and prohibits interest, excessive uncertainty / speculation, gambling and harmful businesses. Jainism also has a unique approach to economic development which is strongly centered on sincerity and integrity' around Ahimsa and Karma, which 'encourages a light footprint in life. To follow such principles while investing the fund will exclude sector and industry such as Alcohol, gambling, tobacco, vulgar entertainment, animation content provider, exhibition of films, media-broadcasting ,media-content, production and distribution of films, mainstream or conventional financial services, non-halal food and beverages, narcotics substance or anything largely harmful to society, Meat & Animal Products, Pharmaceutical involving Animal Testing, Weapon & Defense, & Betting.\nCommenting on the fund launch, Chirag Mehta, Chief Investment Officer & Fund Manager, Quantum AMC, said, \"The Quantum Ethical Fund will enable investors to align their investments to their beliefs, values and ",
    "description2": "ideologies. While encouraging ethical business practices, the robust integrity and financial checks will ensure investments reflect less risk and high quality which would drive long term performance. 'Responsibility and profitability are complementary traits' and thereby 'good ethics is good business'. The Quantum Ethical Fund will allow investors to generate wealth through equity investments with a clear conscience. By investing in this fund, thoughtful investors have an opportunity undertake investments aligned to their values.\"\nAdding to this, I. V. Subramaniam, MD & Group Head- Equities, Quantum Advisors - Sponsor to Quantum Mutual Fund, said, \"If you are an investor, for whom where a fund invests is as important as how much fund is invested, with this fund, you can be more intentional with your investments. Ethical investing is an investment approach in which investors invest in businesses that align with their religious or social values and generate financial returns. Sometimes, some businesses are involved in activities which are not good in terms of social values. As an individual investor it can be difficult to identify businesses that conduct their operations in accordance with the social values followed by the investor and at the same time remain profitable. That's where the Ethical Fund is a good fit.\"\n\n\nAbout Quantum AMC\nQuantum Mutual Fund was established in 2006 with the launch of its first fund. Quantum Mutual Fund nurtures a partnership culture with investors, business partners, and employees to spread the goodness of investing.\nQuantum Mutual Fund is committed to providing simple Investment Solutions with simplicity, transparency, and integrity.\n- Investment options to convert savings to wealth.\n- Simple products that are easy to understand.\n- Dependable standards of service.\n- Sensible, risk-adjusted returns over the long term through a disciplined research and investment process\nWe now offer 14 simple and easy-to-understand products for achieving different financial goals. Our tried and tested research-oriented process gives a channel to receive risk-adjusted returns that outperform the market in the long term. Quantum's continued relevance is a product of its reputation as trailblazer in the realm of mutual fund investing. With a solid track record and a commitment of providing progressive investment strategies.\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by PRNewswire. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204052452.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 1:09:04 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "\"I don't think the players are mentally down\": Sri Lanka batting coach ahead of 2nd Test against Proteas",
    "link": "https://worldsnews24.vercel.app/sports/i-don-t-think-the-players-are-mentally-down-sri-lanka-batting-coach-ahead-of-2nd-test-against-proteas",
    "siteurl": "https://worldsnews24.vercel.app/sports/i-don-t-think-the-players-are-mentally-down-sri-lanka-batting-coach-ahead-of-2nd-test-against-proteas",
    "description": "\"I don't think the players are mentally down\": Sri Lanka batting coach ahead of 2nd Test against Proteas",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204043020.jpg",
    "description1": "\n\n\nGqeberha [South Africa], December 4 (ANI): Batting coach Thilina Kandamby said that the Sri Lanka players are not mentally down after a massive 233-run defeat against South Africa in the first match Test of the series.\nSouth Africa secured vital World Test Championship points that elevated them to second place in the standings after a dominant victory in the first Test against Sri Lanka.\n\nThilina Kandamby said that Sri Lanka have an experienced squad and they have been in situations like this before as well. He added that team management is constantly motivating the players.\n\"We have a very experienced unit, and they have been in situations like this before. We have given comebacks before as well. I don't think the players are mentally down. We give them lot of confidence. We started off in a similar fashion in England this year. We came from behind to win a game. We have identified that and we need to be at our best from day one,\" Kandamby was quoted by ESPNcricinfo ",
    "description2": "as saying.\n\n\nThe batting coach added that there is \"no point\" for the Sri Lankan players to become too aggressive in the upcoming match of the series.\n\"We had a chat, and the key here is to see off the new ball. There is no point being too aggressive, but we do have to put the loose balls away. Once we get past the first hour, it gets a lot easier,\" he added.\nEarlier in the Test, Sri Lanka opted to bowl first after winning the toss. South Africa posted a modest 191 in their first innings, with skipper Temba Bavuma's 70 leading the effort.\nSri Lanka's batting collapse in reply proved decisive. Marco Jansen's fiery pace devastated their lineup, as they folded for 42 in just 13.5 overs. Capitalising on the advantage, South Africa declared their second innings at 366/5, thanks to Bavuma's aggressive 113 and Tristan Stubbs' solid 122 (221).\nWith a 1-0 lead in the series, South Africa will aim to secure the series in the second Test, beginning on December 5 in Gqeberha. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204043020.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 1:09:04 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "\"I didn't see any aggression....\": Vaughan on Australia's poor show during Perth Test against India",
    "link": "https://worldsnews24.vercel.app/sports/i-didn-t-see-any-aggression-vaughan-on-australia-s-poor-show-during-perth-test-against-india",
    "siteurl": "https://worldsnews24.vercel.app/sports/i-didn-t-see-any-aggression-vaughan-on-australia-s-poor-show-during-perth-test-against-india",
    "description": "\"I didn't see any aggression....\": Vaughan on Australia's poor show during Perth Test against India",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204043613.jpg",
    "description1": "\n\n\nMelbourne [Australia], December 4 (ANI): Former England captain Michael Vaughan said that the Australian team lacked aggression during their loss to a \"dangerous\" India at Perth during the first Border-Gavaskar Trophy Test and their batting is nowhere near what it used to be during their peak years.\nAs Australia prepares for the second Test at Adelaide Oval, a pink-ball, day-night affair, they would no doubt be bothered heavily by the 295-run loss that transpired at Perth. The star-studded, glorious Australian batting line-up was exposed big time, especially Steve Smith and Marnus Labuschagne.\n\nAlso, the centuries by Yashasvi Jaiswal and Virat Kohli were among many batting highlights in the second innings that left Aussie players exhausted mentally and physically by the time they stepped on the pitch to chase a gigantic 534 runs.\nVaughan, who had the experience of competing against legends like Ricky Ponting, Shane Warne, Glenn McGrath, Brett Lee, Adam Gilchrist etc during his playing days during the fiercely-contested Ashes series, noted that India gets extremely dangerous once they start feeling confident and it was visible in Perth as their body language and playing style was aggressive and in-your-face. On the other hand, Australia just looked like a \"nice team to play against.\"\n\"India are a very dangerous side, particularly when they start to get confidence and I think we saw that in Perth,\" Vaughan told SEN.\n\"They have got that energy and that aggressive nature, and that is the one thing that surprised me in Perth. I know India was on top, but India looked like a more aggressive team and a little bit more in-your-face in terms of playing cricket the way that Australia used to play.\"\n\"Australia just looked like a team that was just going - not through the motions - but they just looked like a nice team to play against.\"\n\"I did not see any aggression. I did not see the bouncer theory coming to Yashasvi Jaiswal. I did not see any kind of confrontation out in the middle,\" he concluded.\nVaughan also said that maybe the Aussies missed out on the presence of retired batter David Warner, who brought a lot of energy and aggression through both his batting and on-field confrontations, sledging and banter.\n\n\nThe former England captain also said that it is Australian batting which is letting them down m",
    "description2": "ore as compared to their bowling as the Pat Cummins-led quartet of Mitchell Starc, Josh Hazlewood and Nathan Lyon still can get top sides bowled out.\n\"I think the bowling attack is without any question that quartet of bowlers are up there with the best, but the batting is nowhere near,\" Vaughan said.\n\"I think that is where teams can really target this Australian batting lineup. If you can bowl them out quickly, which India did in that first Test, the bowlers have to go back out there and bowl a little bit too soon because they've not had the rest.\n\"The only way that Australia can put it right is by winning, and that is very simple terms. The batters can only put it right by putting a number on the board, your job as a bat is to score runs, your currency is runs. But it would not be easy,\" he concluded.\nVaughan could very well be right in his observation, with Mitchell Marsh (44.61) and Usman Khawaja (38.20) being the only batters averaging in late 30s or 40s since the team's ICC World Test Championship title win against India last year. Premier batters like Smith (32.82), Labuschagne (27.41) and Travis Head (30.45) have been facing a lean patch.\nThe Adelaide Test, starting on December 6, sees India entering with both a mental and physical edge, following a dominant performance in the first Test led by Jasprit Bumrah's bowling and captaincy.\nHowever, the visitors will also aim to exorcise the memories of the infamous 2020 Adelaide pink-ball Test, where they were dismissed for their lowest Test score of 36 runs. On that occasion, Pat Cummins (4/21) and Josh Hazlewood (5/8) dismantled the Indian batting line-up, giving Australia a straightforward target of 90 runs to chase.\nAustralia squad (for second Test): Pat Cummins (c), Scott Boland, Alex Carey (wk), Josh Hazlewood, Travis Head, Josh Inglis, Usman Khawaja, Marnus Labuschagne, Nathan Lyon, Mitch Marsh, Nathan McSweeney, Steve Smith, Mitchell Starc, Beau Webster\nIndia squad: Rohit Sharma (C), Jasprit Bumrah (VC), Yashasvi Jaiswal, KL Rahul, Abhimanyu Easwaran, Devdutt Padikkal, Shubman Gill, Virat Kohli, Rishabh Pant, Sarfaraz Khan, Dhruv Jurel, Ravichandran Ashwin, Ravindra Jadeja, Mohammed Siraj, Akash Deep, Prasidh Krishna, Harshit Rana, Nitish Kumar Reddy, Washington Sundar.\n\nReserves: Mukesh Kumar, Navdeep Saini, Khaleel Ahmed, Yash Dayal. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204043613.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 1:09:04 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "6 mm of grass on Adelaide pitch for 2nd Test, reveals head curator",
    "link": "https://worldsnews24.vercel.app/sports/6-mm-of-grass-on-adelaide-pitch-for-2nd-test-reveals-head-curator",
    "siteurl": "https://worldsnews24.vercel.app/sports/6-mm-of-grass-on-adelaide-pitch-for-2nd-test-reveals-head-curator",
    "description": "6 mm of grass on Adelaide pitch for 2nd Test, reveals head curator",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204041750.jpg",
    "description1": "\n\n\nAdelaide [Australia], December 4 (ANI): Ahead of the pink-ball Adelaide Test between India and Australia in the ongoing Border-Gavaskar Trophy, Damian Hough, the head curator of the pitch at the venue, said that six millimetres of grass will be used on the pitch.\nThe Adelaide Test, starting on December 6, sees India entering with both a mental and physical edge, following a dominant performance in the first Test led by Jasprit Bumrah's bowling and captaincy.\n\nHowever, the visitors will also aim to exorcise the memories of the infamous 2020 Adelaide pink-ball Test, where they were dismissed for their lowest Test score of 36 runs. On that occasion, Pat Cummins (4/21) and Josh Hazlewood (5/8) dismantled the Indian batting line-up, giving Australia a straightforward target of 90 runs to chase.\nSpeaking at the pre-match press conference about the pitch and grass cover, Hough said, \"Everything seems to stay the same. So it is of course matter grass, even grass cover, good deep moisture, but dry and hard. So something where the quicks will get a bit out of it, spinners will be able to get some bite and turn and bounce. But also important for us to get some partnerships in the players and the players to be able to play their shots. Should be around six. Right now we are at seven, but I reckon it will be six millimetres.\"\nHough said that though the ground staff is trying to produce a pitch that could offer a fine contest between bat and ball, it could get hard to bat under the lights with the new ball, especially with both teams having quality bowling attacks.\nOn the possibility of pitch changing with progress of the match like it changed from challenging to easy-to-",
    "description2": "bat on during the Perth Test, Hough said that while he cannot predict the pitch will change, one always wants pitches to change in Test cricket.\nHe also said that the pitch in Adelaide should be able to do enough with the new ball for pacers and spinners alike, but also aid batters once the ball gets older.\n\n\n\"Do you want it to change? Of course you do. Test matches should see it change throughout the course of the four or five days. Drop-in pitches are a bit more challenging.\"\n\"There is no doubt about that because they (drop-in pitches) hold together so well. Traditionally in Adelaide, it should do enough with the new ball for the whole game and it still should grip into that grass and bounce and spin for the whole game. But as the ball gets older, hopefully, the players or the batters can build partnerships and score some runs,\" he added.\nIndia are currently 1-0 up in the BGT series following their record-shattering 295-run victory in Perth. The second Test will be played in a day-night format in Adelaide, beginning from Friday.\nAustralia squad (for second Test): Pat Cummins (c), Scott Boland, Alex Carey (wk), Josh Hazlewood, Travis Head, Josh Inglis, Usman Khawaja, Marnus Labuschagne, Nathan Lyon, Mitch Marsh, Nathan McSweeney, Steve Smith, Mitchell Starc, Beau Webster\nIndia squad: Rohit Sharma (C), Jasprit Bumrah (VC), Yashasvi Jaiswal, KL Rahul, Abhimanyu Easwaran, Devdutt Padikkal, Shubman Gill, Virat Kohli, Rishabh Pant, Sarfaraz Khan, Dhruv Jurel, Ravichandran Ashwin, Ravindra Jadeja, Mohammed Siraj, Akash Deep, Prasidh Krishna, Harshit Rana, Nitish Kumar Reddy, Washington Sundar.\n\nReserves: Mukesh Kumar, Navdeep Saini, Khaleel Ahmed, Yash Dayal. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204041750.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 1:09:04 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "\"Finished the game with 10 hours....\": Stokes hits back at ICC following England's WTC points deduction",
    "link": "https://worldsnews24.vercel.app/sports/finished-the-game-with-10-hours-stokes-hits-back-at-icc-following-england-s-wtc-points-deduction",
    "siteurl": "https://worldsnews24.vercel.app/sports/finished-the-game-with-10-hours-stokes-hits-back-at-icc-following-england-s-wtc-points-deduction",
    "description": "\"Finished the game with 10 hours....\": Stokes hits back at ICC following England's WTC points deduction",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204034917.jpg",
    "description1": "\n\n\nChristchurch [New Zealand], December 4 (ANI): England Test captain Ben Stokes hit back at the International Cricket Council (ICC) following a slow-over-rate penalty on his team after the first Test against New Zealand at Christchurch, claiming that the match was finished with \"10 hours of play still left\".\nThe race to the ICC World Test Championship (WTC) final gained a lot of spice and intensity as New Zealand and England were docked three points each for maintaining a slow over-rate in the opening Test of their three-match series.\n\nOn Tuesday, the International Cricket Council (ICC) announced sanctions against New Zealand and England for failing to maintain the required over-rate during the series opener in Christchurch.\nAs a result, both teams were fined 15 per cent of their match fees and penalised three crucial WTC competition points, adding another layer of intrigue to the race for the final.\nTaking to Instagram, Stokes said, \"Good on you ICC (accompanied by three shrugging emojis). \"Finished the game with 10 hours of play still left.\"\n\n\n\nThe ICC stated, \"New Zealand and England were both found to be three overs short of the target after time all",
    "description2": "owances were taken into consideration, with sides penalised one point for each over they were found short.\"\nEngland skipper Stokes and New Zealand captain Tom Latham accepted the charges and the proposed sanctions, negating the need for a formal hearing.\nThe charges were levelled by on-field umpires Ahsan Raza and Rod Tucker, third umpire Adrian Holdstock, and fourth official Kim Cotton, while the sanctions were imposed by David Boon of the Emirates ICC Elite Panel of Match Referees.\nEngland, already out of contention for next year's final, secured an 8-wicket victory in Christchurch. They are currently in the sixth spot with 10 wins, nine losses and a draw in 20 Tests, translating to a PCT of 42.50.\nHowever, the sanctions dealt a significant blow to New Zealand's chances. The inaugural WTC champions dropped from the joint fourth spot to fifth in the standings.\nFollowing the penalty, New Zealand's points percentage stands at 47.92 per cent. Even if they win their remaining two Tests against England, their best possible finish is a points percentage of 55.36 per cent. Their fate in reaching the WTC final will depend on the outcomes of other matches. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241204034917.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 1:09:04 pm",
    "courtesy": "ANI News",
    "datePublished": "WED, DEC 04, 2024 |UPDATED 11:19 IST",
    "dateModified": "WED, DEC 04, 2024 |UPDATED 11:19 IST"
  },
  {
    "title": "'Good on you ICC!': Ben Stokes lashes out after England, New Zealand have WTC points docked",
    "link": "https://worldsnews24.vercel.app/sports/good-on-you-icc-ben-stokes-lashes-out-after-england-new-zealand-have-wtc-points-docked",
    "siteurl": "https://worldsnews24.vercel.app/sports/good-on-you-icc-ben-stokes-lashes-out-after-england-new-zealand-have-wtc-points-docked",
    "description": "'Good on you ICC!': Ben Stokes lashes out after England, New Zealand have WTC points docked",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115959320/115959320.jpg",
    "description1": "England captain Ben Stokes expressed his bewilderment regarding over-rate penalties following their victory against New Zealand. He reacted on social media with three shrugging emojis and the comment: \"Good on you ICC.\"Both New Zealand and England lost three World Test Championship (WTC) points due to slow over-rates in the first Test at Hagley Oval. All players were also fined 15% of their match fees.Stokes further commented on Instagram: \"Finished the game with 10 hours of play still left.\" 115959300England have now incurred a total of 22 WTC points deductions in the 2023-25 cycle for slow over-rates. This includes 19 points lost during the 2023 Ashes series.Stokes previously expressed his views about the WTC, calling it \"utterly confusing\". He admitted to not prioritising the competition.England currently sit sixth in the ongoing WTC cycle. They previously finished fourth in the first two editions. This eliminates their chance to compete in the final on home soil for the third consecutive time.New Zealand's penalty dropped them from f",
    "description2": "ourth to fifth in the WTC standings. This further hinders their prospects of reaching next year's final after losing the first Test.New Zealand's current WTC points percentage stands at 47.92%. Even with victories in the remaining two matches, they can only reach a maximum of 55.36%.Both teams were found to be three overs short of the required rate after time allowances. Each over short results in a one-point penalty.The charges were levelled by on-field umpires Ahsan Raza and Rod Tucker, third umpire Adrian Holdstock, and fourth official Kim Cotton. Both captains, Stokes and Tom Latham, accepted the charges. Match referee David Boon imposed the sanctions.India and South Africa currently hold the top two positions in the WTC table, followed by Australia and Sri Lanka. With 15 Tests remaining in the cycle, no team is guaranteed a spot in the top two.New Zealand's eight-wicket loss to England, attributed to poor fielding, significantly impacted their chances of a second WTC final appearance. This followed their 3-0 series victory in India.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115959320/115959320.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-04T10:40:00+05:30",
    "dateModified": "2024-12-04T10:40:00+05:30"
  },
  {
    "title": "Sunil Gavaskar vs Sachin Tendulkar vs Virat Kohli: And the verdict is...",
    "link": "https://worldsnews24.vercel.app/sports/sunil-gavaskar-vs-sachin-tendulkar-vs-virat-kohli-and-the-verdict-is",
    "siteurl": "https://worldsnews24.vercel.app/sports/sunil-gavaskar-vs-sachin-tendulkar-vs-virat-kohli-and-the-verdict-is",
    "description": "Sunil Gavaskar vs Sachin Tendulkar vs Virat Kohli: And the verdict is...",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115955365/115955365.jpg",
    "description1": "NEW DELHI: Comparing Sunil Gavaskar, Sachin Tendulkar, and Virat Kohli is like comparing legends from three distinct eras of cricket. Each has left an indelible mark on the game in their unique way. Sunil Gavaskar played at a time when the format of Test cricket was predominant and ODIs were limited. Gavaskar's mastery against fast bowling in an era without helmets, exceptional technique, and consistency is stuff of legends.Gavaskar was the first player to score 10,000 runs in Test cricket and he retired with 34 Test centuries to his name, a world record at that time. Gavaskar played a pivotal role in earning respect for Indian cricket in the 1970s and '80s and was the bedrock of India's batting during a time when pitches were bowler-friendly, and helmets were unheard of. His performances against the fearsome West Indies pace attack were iconic. https://www.youtube.com/watch?v=NpYwFih2sQ0Sachin Tendulkar excelled in both Tests and ODIs; saw the advent of T20 cricket. Tendulkar's versatility, adaptability, and unmatched ability to dominate bowlers across conditions and formats made him one of the greatest batsmen to play the game.Tendulkar retired with most runs in both Tests and ODIs and became the first cricketer to get to 100 international hundreds and was also a key player in India's 2011 World Cup victory.Tendulkar became the face of Indian cricket during the 1990s and early 2000s, inspiring an entire generation. He was revered for his consistency and longevity in a highly demanding cricketing landscape.Virat Kohli has excelled in all three formats: Tests, ODIs, and T20Is. Known as the chase master, Kohli's aggressive mindset, and ability to adapt to the modern demands of fitness and power cricket make him a modern-day great.With over 25",
    "description2": ",000 international runs across formats, most centuries in ODI chases, Kohli revitalized India's Test cricket ethos with aggressive leadership and redefined modern cricket standards with his fitness and intensity. Under Kohli's captaincy, India became a dominant Test side. His dominance in limited-overs formats, particularly in chasing, is unparalleled.And now a video is viral on which Gavaskar is asked during a talk show who was better Sachin Tendulkar, Virat Kohli or him (Gavaskar).Gavaskar replies after pausing for a moment, \"I think everybody was very good, but I think Gary Sobers was the best.\"With a puzzled look and a smile, the co-host who had asked the question says, \"Yeah I'm glad, but I didn't give him that as an option.\"Gavaskar adds, \"Yeah, I know that, that's where the dry comes in.\"Another co-host chips in light-heartedly, \"Don't get frustrated with the guest on Drip Tray. He gave you his answer and that's his answer.\"The first co-host adds, \"Well, I'm not coming to dinner now.\" And his reply even invokes a beaming smile from Gavaskar.&mdash; thefrontbar7 (@thefrontbar7) For the record, Sir Garfield Sobers is often regarded as the greatest all-rounder in cricket history, who transcended his era with his incredible versatility and match-winning ability. Sobers scored 26 Test centuries, including a then-world record unbeaten 365 against Pakistan in 1958, which remained unbeaten for 36 years.Sobers was the ultimate all-rounder, equally adept at winning matches with bat, ball, or in the field and in 1968, became the first cricketer to hit six sixes in an over in a first-class match, playing for Nottinghamshire.Sobers was one of the first truly global cricketing superstars, admired for his sportsmanship and grace on and off the field.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115955365/115955365.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-04T08:50:00+05:30",
    "dateModified": "2024-12-04T08:50:00+05:30"
  },
  {
    "title": "KL Rahul's cheeky reply to 'at what position will you bat in Adelaide Test'",
    "link": "https://worldsnews24.vercel.app/sports/kl-rahul-s-cheeky-reply-to-at-what-position-will-you-bat-in-adelaide-test",
    "siteurl": "https://worldsnews24.vercel.app/sports/kl-rahul-s-cheeky-reply-to-at-what-position-will-you-bat-in-adelaide-test",
    "description": "KL Rahul's cheeky reply to 'at what position will you bat in Adelaide Test'",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115959257/115959257.jpg",
    "description1": "KL Rahul rediscovered his lost form while opening batting in the absence of Rohit Sharma during the first Test against Australia in Perth; but with captain Rohit back from his paternity leave, the question on everybody's mind is whether Rahul will continue to open with Yashasvi Jaiswal or will Rohit return as an opener and Rahul pushed down to the middle order.At his press conference in Adelaide ahead of the pink-ball Test beginning December 6, Rahul was asked the same question, but the 32-year-old batter was well aware of the yorker coming his way and dug it out.ALSO WATCH 115931658\"I've been told but I've also been told to not share it today,\" Rahul said in his cheeky reply as the reporters burst into laughter. \"So you'll have to wait for day one or maybe when the captain comes here tomorrow (for the pre-match press conference).\"Rahul scored a patient 26 in the first innings of the Perth Test and followed it up with a solid 77 in a 201-run opening partnership with Jaiswal, who scored 161, in the second innings.Rohit, meanwhile, joined the team midway through the first Test and has since been practicing against the pink ball.&mdash; abcsport (@abcsport) During the day-night practice match against the Australian Prime Minister's XI in Canberra, the opening pair of Rahul and Jaiswal was not disturbed, and the duo produced another good opening stand of 75 runs.Rohit, who b",
    "description2": "atted at No. 4 in that game, scored just 3 runs, which extended his lean run after the skipper had made just 91 runs in the six innings of the three Tests against New Zealand at home just before the Border Gavaskar Trophy.Speaking about how he approached batting in the first Test, Rahul said he keeps it \"simple\" and gives the bowlers and the new ball \"respect\" at the start of the innings.\"I try to keep it really simple. The new ball does a lot. So you need to respect the first 20-25 overs and try to soak in the pressure, try and get used to the pace or whatever the wicket is doing...If you get through that period, then, like I said, batting seems pretty normal to wherever you are in the world. So it's about managing those first 20-25 overs,\" he said.  115931965Rahul's 103 runs in his two innings at Perth came off 250 balls, which reminded of the job Cheteshwar Pujara did during India's back-to-back Test triumphs in Australia on the last two tours.\"I've played in different conditions; and when you do well in different conditions -- pace-friendly conditions or away from home, you do get a little bit of confidence and you do understand how you need to do it, and you repeat those processes again and again.\"Those are the things, those are the key points that you need to really work on -- playing the ball late, leaving a lot of balls and waiting for the bowlers to come to you.\"",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115959257/115959257.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-04T10:34:00+05:30",
    "dateModified": "2024-12-04T10:34:00+05:30"
  },
  {
    "title": "I don't speak to MS Dhoni, says Harbhajan Singh",
    "link": "https://worldsnews24.vercel.app/sports/i-don-t-speak-to-ms-dhoni-says-harbhajan-singh",
    "siteurl": "https://worldsnews24.vercel.app/sports/i-don-t-speak-to-ms-dhoni-says-harbhajan-singh",
    "description": "I don't speak to MS Dhoni, says Harbhajan Singh",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115954932/115954932.jpg",
    "description1": "Harbhajan Singh played under MS Dhoni's captaincy, including during the T20 World Cup win in 2007, the ODI World Cup triumph in 2011 and for the Chennai Super Kings (CSK); but the former India off-spinner says he doesn't speak to Dhoni any longer.\"No, I don't speak to Dhoni,\" Harbhajan said talking to News18. \"I don't have anything against him. If he has something to say, he can tell me. But if he did, he would have told me by now.\"ALSO WATCH 115931658Harbhajan, a bowling great with 417 wickets in 103 Tests, didn't elaborate much on the reasons about his differences with Dhoni but added that his interaction with CSK's 'Thala' was limited to on-field talks only during his playing days in the Indian Premier League (IPL). \"When I was playing at CSK, that's when we spoke; but otherwise, we haven't spoken. It's been 10 years and m",
    "description2": "ore. I have no reason; perhaps he does. I don't know what the reasons are. When we were playing in the IPL at CSK, that's when we used to talk, and that too was restricted to the ground. After that, he did not come to my room, nor did I go to his,\" said Harbhajan, who also played 236 ODIs and 25 T20Is, taking 269 and 25 wickets respectively.The former off-spinner also indicated that Dhoni doesn't respond to his calls.\"I only ring up those who pick up my calls. I don't have the time otherwise,\" said 44-year-old Harbhajan, who does commentary stints now. \"I stay in touch with the ones I am friends with. A relationship is always about give and take. If I respect you, I hope you will respect me back. Or you respond to me. But if I call you once or twice but don't get a response, I will probably only meet you as much as I need to.\"",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115954932/115954932.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-04T08:35:00+05:30",
    "dateModified": "2024-12-04T08:35:00+05:30"
  },
  {
    "title": "Border-Gavaskar Trophy: Adelaide Oval pitch curator braces for rain-impacted start to second Test",
    "link": "https://worldsnews24.vercel.app/sports/border-gavaskar-trophy-adelaide-oval-pitch-curator-braces-for-rain-impacted-start-to-second-test",
    "siteurl": "https://worldsnews24.vercel.app/sports/border-gavaskar-trophy-adelaide-oval-pitch-curator-braces-for-rain-impacted-start-to-second-test",
    "description": "Border-Gavaskar Trophy: Adelaide Oval pitch curator braces for rain-impacted start to second Test",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115955295/115955295.jpg",
    "description1": "Adelaide Oval curator Damian Hough is anticipating rain and storms to disrupt the opening day of the second Test between Australia and India in the Border-Gavaskar Trophy.A full-house crowd of 53,500 is expected on Friday (December 6) despite the forecast of up to 7mm of rain. Australia will be aiming to bounce back from their heavy 295-run defeat in the first Test in Perth. 115931391The upcoming contest at the Adelaide Oval marks India's first pink-ball Test in Australia since their infamous collapse for 36 at the same venue in 2020.Hough, known for his work in balancing the Adelaide Oval pitch for both batters and bowlers, will be closely monitoring the weather radar.\"Friday looks like it could be thunderstorms,\" he said ahead of the second Test.\"I'm not sure exactly on the timing of those storms coming through, but we're expecting to pull covers on Friday.\"Hopefully it clears out on Saturday morning, then it should be good for the remainder of the Test.\" 115931658The pitch will have a 6mm grass covering, identical ",
    "description2": "to the recent Sheffield Shield match between South Australia and Western Australia.That Sheffield Shield game, also affected by the weather, resulted in a draw. However, the fast bowlers from both sides troubled the batsmen with the new ball.\"Shield games, whether it's a red ball or a pink one, we're trying to replicate the Shield and the Test preparation ... very similar preparations,\" Hough said.\"The Shield pitch showed if you didn't get a new ball under lights, and you had a couple of set batters in, you're able to see through some night-time cricket.\"Hough doesn't think the surface played a role in India's 36-run all out collapse four years ago when they had a 53-run first-innings lead, before losing by eight wickets on day three.\"On the morning of day three, no one would have expected that Test match to finish in three days,\" he said.\"That was just really good bowling from Australia ... I don't think the pitch played a part in that. \"Our job is to get that balance right and try to get a really good, even contest.\"",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115955295/115955295.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-04T08:46:00+05:30",
    "dateModified": "2024-12-04T08:46:00+05:30"
  },
  {
    "title": "Why the pink-ball Test in Adelaide can be a decisive game",
    "link": "https://worldsnews24.vercel.app/sports/why-the-pink-ball-test-in-adelaide-can-be-a-decisive-game",
    "siteurl": "https://worldsnews24.vercel.app/sports/why-the-pink-ball-test-in-adelaide-can-be-a-decisive-game",
    "description": "Why the pink-ball Test in Adelaide can be a decisive game",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115957725/115957725.jpg",
    "description1": "The pink-ball Test in Adelaide, despite its potential to be an outlier, offers both India and Australia a chance to throw defining punches at each otherIntrigue marrying spectacle. That's what you get when the Adelaide Oval hosts the Australian summer's customary cricketing fest. The Day Night Test match.Border-Gavaskar TrophyThe pink kookaburra and the way it behaves especially in the twilight zone, provides the intrigue and the picturesque setting of the venue and the orange skies threatening to kiss the green turf in the evening, offers the spectacle.It's called the People's Test in South Australia and bumper crowds are expected for what many are calling the biggest game in the World Test Champions' recent history, considering what transpired in Perth.When the calendar for the India series was 'curated', it was almost a given that Australia would arrive in the City of Churches from the west with a 1-0 lead.  https://www.youtube.com/watch?v=1HEyCAzcyuMAnd post their exertions of the pink-ball game in Adelaide, a fixture they have never lost in seven previous attempts, any other suggestion apart from a 2-0 lead would have prompted the question, \"Can I have a puff of what you're smoking?\"Why that barb?Because Australia are masters of the pink ball game. Of the 22 Tests that have been staged in its D/N avatar, Australia have featured in 12, all at home, and have lost only once to the West Indies at the Gabba.India, on the contrary, have played just four pink ball games, winning three (Kolkata, Ahmedabad and Bengaluru) and losing one.Yeah, THAT 36 one. Right here. Saturday, December 19, 2020.4,9,2,0,4,0,8,4,0,4,1.No, that isn't a cheat code. It was what every Indian batter contributed in the second innings as every false shot or mistake eerily produced a nick and every nick was pouched. And it happened in glorious batting conditions with the sun shining in all its glory.That's what the pink ball creates. It allows doubts and fears to nestle rent free in the minds and hearts of batters. Especially in the twilight zone. The ball behaves differently once the lights come on and the sun starts setting. W",
    "description2": "ith the tendency of the ball skidding on, thanks to the added lacquer, batters' footwork gets tested and any delay in reaction time often triggers his downfall.Australia have ruled in pink ball Tests because of their extraordinary cartel of pacers.https://www.youtube.com/watch?v=xR9AuAfHhrcAt Adelaide, where the pitch quickens up after Day One, thanks to the curators leaving an extra bit of grass to allow the lacquer on the ball to stay longer to aid its sighting, the pacers have had it good.A one hundred and seventy-three wickets taken by pace bowlers have come at a frugal 27.19. Correspondingly, spinners have taken 47 scalps at 39.72 with office Nathan Lyon, who had toiled as a groundsman at Adelaide, taking 28 of them.While India expertly negotiated the threat of slingy left-armer Mitchell Starc in Perth, with centurion Yashasvi Jaiswal even taunting him by saying, \"It's coming too slow\", they will know that the pink-ball Test in Adelaide is Starc's domain and poking the bear any further would be a misadventure.Mercurial and moody, Starc often has outhouse or penthouse figures. But his lengths in Adelaide generally are fuller and he has 39 wickets in seven Tests to show for his efforts. Those scalps have come at an obscene 16.64. A wicket for him happens every 35.5 balls here, 13 balls fewer than his career strike rate of 48.8.Apart from Starc's potency, what will also draw India's attention is the catching. On Day Two, in the 2020 Adelaide Test, a triple digit lead seemed a certainty, but routine drops from Bumrah, Mayank Agarwal and Prithvi Shaw, possibly the result of not sighting the ball properly, saw it reduced to 53 as the last three wickets added 80.Bumrah, a brutal self-appraiser, would also know that he and Umesh Yadav bowled a metre short in their first spells four years ago, allowing the openers a few sighters. Now, far more mature and scheming, expect him to course correct and also mentor his younger colleagues to target the stumps. That's where the wickets will come, especially against an Australian Top Four that seems chronically out-of-form and in awe of India's bowling talisman.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115957725/115957725.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-04T09:49:00+05:30",
    "dateModified": "2024-12-04T09:49:00+05:30"
  },
  {
    "title": "The nuances of Test cricket with the pink ball",
    "link": "https://worldsnews24.vercel.app/sports/the-nuances-of-test-cricket-with-the-pink-ball",
    "siteurl": "https://worldsnews24.vercel.app/sports/the-nuances-of-test-cricket-with-the-pink-ball",
    "description": "The nuances of Test cricket with the pink ball",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115958474/115958474.jpg",
    "description1": "The Day/Night Test may well be cricket's newest format, with the pink ball adding degrees of difficulty.The science behind the pink cricket ball is primarily focused on its enhanced visibility under floodlights. It is achieved through a bright pink colour and a special coating that allows it to keep its shine longer, making it easier for players to track during D/N Tests where the red ball would be difficult to see in conditions where the light gets poor.This extra shine also contributes to increased swing in the initial overs compared to a red ball.Border-Gavaskar TrophyIncreased swingDue to the extra shine from t",
    "description2": "he coating, the pink ball can swing more, especially in the early overs of a match. It shows 20% more seam movement in comparison with the red ball. https://www.youtube.com/watch?v=GxeRP6n8C-0Black stitchingUnlike the red ball with white seam, the pink ball has black seam to further improve visibility against the pink colour. 115958555Extra lacquerAn extra coat of lacquer is used on the pink ball. Lacquer is a synthetic substance that prompts the ball to move faster off the surface, giving a skidding effect. It also feels heavier on the bat. The colour is chosen to contrast against the field and lighting. 115958565",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115958474/115958474.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-04T10:16:00+05:30",
    "dateModified": "2024-12-04T10:16:00+05:30"
  },
  {
    "title": "Advantage India as Australia play a 'wrong card' ahead of Adelaide Test",
    "link": "https://worldsnews24.vercel.app/sports/advantage-india-as-australia-play-a-wrong-card-ahead-of-adelaide-test",
    "siteurl": "https://worldsnews24.vercel.app/sports/advantage-india-as-australia-play-a-wrong-card-ahead-of-adelaide-test",
    "description": "Advantage India as Australia play a 'wrong card' ahead of Adelaide Test",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115915495/115915495.jpg",
    "description1": "Australia suffered a huge blow when Josh Hazlewood was ruled out of the pink-ball Test against India in Adelaide, which put the focus on right-arm pacer Scott Boland to replace him for the second Test of the Border Gavaskar Trophy. But India got a good look at Boland with the pink ball in the warm-up fixture at Canberra, which many in Australia believe has put India at an advantage.Boland was named in the Australian Prime Minister's XI squad well before Hazlewood's side strain made him unavailable for the day-night Test in Adelaide. But cricket experts and the Aussie media believe that Cricket Australia could have withdrawn him and not let India warm-up against the 35-year-old seamer. https://www.youtube.com/live/OpZ5li1qO-g?si=OxnvMjNPAgxryrwNAustralian journalist Tom Morris questioned if the CA selectors have done the \"right thing\". Speaking on SEN radio, Morris said: \"Did the Australian selectors do the right thing playing Scott Boland against India? Would it have been better for him and Australia to go into this game with India not having seen h",
    "description2": "im with a pink ball?\"Boland has played 10 Tests in his career so far since his debut in the Boxing Day Test of the 2021 Ashes series. But he has been out of the side since the Leeds Test of the Ashes in July last year. https://www.youtube.com/watch?v=V4D4aa9co2s\"I probably expected to play at some stage last summer with seven Tests because of the New Zealand tour as well,\" Boland was quoted as saying by yahoo.com. \"Obviously with those guys (Hazlewood, Pat Cummins and Mitchell Starc) being so resilient, they don't miss too many and no one wants to give up their spot at any stage.\"They were so dominant last summer, they weren't bowling a heap of overs. We were able to win most of those games, so I probably thought maybe the opportunity had passed. I've worked really hard during the off-season to get my body in a spot where I'm confident that if I get another chance I'll be able to perform for Australia again.\"Cricket Australia has added fast bowlers Sean Abbott and Brendan Doggett in the squad, but Boland remains the front-runner to replace Hazlewood.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115915495/115915495.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-03T06:35:00+05:30",
    "dateModified": "2024-12-03T06:35:00+05:30"
  },
  {
    "title": "'They just kept ...': Josh Hazlewood on India's 36 all out in the last pink-ball Test in Australia",
    "link": "https://worldsnews24.vercel.app/sports/they-just-kept-josh-hazlewood-on-india-s-36-all-out-in-the-last-pink-ball-test-in-australia",
    "siteurl": "https://worldsnews24.vercel.app/sports/they-just-kept-josh-hazlewood-on-india-s-36-all-out-in-the-last-pink-ball-test-in-australia",
    "description": "'They just kept ...': Josh Hazlewood on India's 36 all out in the last pink-ball Test in Australia",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115933531/115933531.jpg",
    "description1": "Josh Hazlewood, the Australian fast bowler, significantly impacted India's batting performance during the day-night pink ball Test match in Adelaide. India was bowled out for a mere 36 runs in their second innings.No Indian batter managed to reach double figures. Despite holding a 53-run lead after the first innings, India couldn't capitalize, allowing Australia to chase down the target of 90 runs and secure victory in the first Test of the 2022 Border-Gavaskar Trophy.Hazlewood reflected on the match, describing the challenging conditions for bowlers in the second innings. He emphasized the difficulty of balancing attacking for wickets while preventing runs when the opposing team has a lead.&mdash; cricketcomau (@cricketcomau) “They were a couple of wickets down overnight, and I don’t think I bowled that night. Then we came back the next day—it’s the toughest time to bowl when you’re in the second innings, and they’ve got a lead, so you’re trying to attack and take wickets while not leaking runs. It’s a tough little period of bowling, so I guess things just fell into place that way.” Josh Hazlewood told circket.com.au.He attributed the success to hitting the right length consistently, resulting in a series of edges. He also acknowledged the early wickets taken by his teammates, which further pressured the Indian batsmen.115931965“I remember coming on as the first change. They just kept nicking everything; I didn’t really plan it. It was my first ball, and I was just trying to hit the length. We were off to a good start—they wer",
    "description2": "e 3 for 15—so I was trying to apply the pressure and keep it going, not trying to do anything fancy, just hitting the line and length. Luckily, I got the nick first up.”“Rahane was a pretty big wicket in that series, particularly in Australia. He’s a good player. It was the fifth ball of the first over, so I wasn’t trying to do anything special—just sticking to line and length. The pink ball was doing enough on its own. They were probably hesitant, being 4 for 20 at that stage.” he added.Hazlewood described Wriddhiman Saha's wicket as fortunate, caught at square leg off a flick. He recognized that Saha was likely playing cautiously given the precarious situation of the Indian innings.He then recalled his 200th Test wicket, that of Ravichandran Ashwin, caught behind off a faint edge.“It wasn’t a big nick (of R Ashwin), but there was definitely a noise, and the bat was there. That was my 200th wicket—a very fine nick. I guess I was on a hat-trick, so I probably celebrated that one a bit more.”Hazlewood emphasized the importance of dismissing the recognised batter when the tail is exposed. “It was the sort of situation where a batter was batting with the tail. At this stage, even though they had only scored 80-odd runs, if the recognised batter gets on a roll with the strike, the innings can drag out. So, it’s always good to get the established batter out and leave two tail-enders together.”Hazlewood concluded by expressing his satisfaction with the events in Adelaide, highlighting the positive memories he retained from the match.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115933531/115933531.jpg",
    "image1": "",
    "date": "3/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-03T16:01:00+05:30",
    "dateModified": "2024-12-03T16:01:00+05:30"
  },
  {
    "title": "2nd Test: Adelaide tickled pink by Team India's presence",
    "link": "https://worldsnews24.vercel.app/sports/2nd-test-adelaide-tickled-pink-by-team-india-s-presence",
    "siteurl": "https://worldsnews24.vercel.app/sports/2nd-test-adelaide-tickled-pink-by-team-india-s-presence",
    "description": "2nd Test: Adelaide tickled pink by Team India's presence",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115954125/115954125.jpg",
    "description1": "India's first training session under lights is an occasion to savour but important decisions await team ahead of crucial second TestADELAIDE: The delayed red-eye flight to Adelaide seemed in limbo on its Singapore tarmac. The snaking queues had long passed their state of agitation and quieted down to uneasy repose when the momentary sighting of Gautam Gambhir made heads turn.Border-Gavaskar TrophyIndia's coach was heading back to the scene of the action in Australia after a brief visit back home. Glances met, pleasantries exchanged and brief handshakes later, he retreated into his own world, down the vast corridors of one of the world's busiest airports, but not before sending everyone's cricketing pulse racing.A few hours later and into the next day, in another continent, Gambhir stood quietly, first in the background and then in the second pacers' nets, as India's batters hit the ground running ahead of the crucial second Test against Australia. https://www.youtube.com/watch?v=GxeRP6n8C-0Only, this wasn't an ordinary nets session. Heaving hordes tumbled in to catch a glimpse of their stars in action at a rare arm's length. Adelaide, the city of vibrant colours, seemed tickled pink by the presence of India's star cricketers.It was a goodwill gesture, an open nets session to stimulate interest, but the practice session turned into concert-level frenzy. Security had to be called in at times to clear restricted areas. A thousand selfies were clicked. Excited teenagers called up friends asking them to rush over. Beating drums rent the air, and, of course, Virat Kohli soaked in all the hero worship.\"Sab mazey le rahey hai (Everyone's having fun),\" Rishabh Pant told Rohit Sharma in the adjacent nets at one point after having a rather hard time coping with Jasprit Bumrah, Akash Deep, Mohammed Siraj and Harshit Rana breathing fire with the pink ball. Rohit himself warned Abhishek Nayar at one point to not talk tactics in such a public view after explaining some front-foot trigger movements to the assistant coach.Every block was cheered, every hit elicited a roar. Every victory for the bowler was celebrated. This was training as spectacle, nets as performance art. Such is the level of frenzy the Indian team arouses away from home that Australia's own open training session a couple of hours earlier seemed tepid in comparison, apart from minor ",
    "description2": "injury scares to their struggling star batters Steve Smith and Marnus Labuschagne. https://www.youtube.com/watch?v=5_s_BIWcH_YEven without all the attention and cheery chaos, this would have been an important session, the team's first with the pink ball in moist twilight conditions, that dreaded time when the lacquer-coated, fancy-coloured orb wobbles unpredictably to raise the fear of leaving batting collapses in its wake.In Adelaide, where Australia have never lost a pink-ball Test, the surface tends to add fuel to the pink fire. No wonder India's batters want more time out in the nets to size up the challenge. The first Test of the 2020-21 series saw them collapse to their lowest-ever Test score of 36 in the second innings, but it's unlikely that the sour taste lingers, especially since India came back to win that series. This time it's about consolidating the advantage after the remarkable comeback win in Perth.Questions still linger about the team's opening plans, and no doubt these will gain ground over the next few days. On Tuesday evening, Rohit Sharma and Rishabh Pant took first strike, even before the warm-ups. When nets resumed, though, Perth openers Yashasvi Jaiswal and KL Rahul began proceedings, and Rohit and Pant again batted in tandem. India's captain may not be averse to batting in the middle order for the first time since 2019, but time - and conditions - will tell.Also on Tuesday, Australia's wicketkeeper Alex Carey took great pains to point out why the pink ball is so tough to spot, saying, \"At times when the lights come on, it can be a little bit of a depth perception. You have to watch the ball as closely as possible, adapt as quickly as possible. At times from behind the stumps, it (the ball) can seem to have a bit of a (pink) glow... sort of a tail. They have a comet tail.\"Given the weird patterns of pink-ball Tests and the increasing uncertainty in players' minds, it may be fair to term it a format all on its own, another oddity in modern cricket's blend of styles. Here at the Adelaide Oval on Tuesday, though, the practicality of pink Tests didn't seem to matter. Nothing did. The only star trails were left by India's cricketers.Will the festive air last if the team doesn't do well starting Friday? Gambhir, standing quietly in the corner, seemingly unmoved by all the noise, may have been thinking the same thing.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115954125/115954125.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 1:09:04 pm",
    "courtesy": "Times of India",
    "datePublished": "2024-12-04T07:52:00+05:30",
    "dateModified": "2024-12-04T07:52:00+05:30"
  },
  {
    "title": "Benafsha, the Afghan cricket queen, who defeated the Taliban, by building her own life, taking the team along, talking a lot and listening to Farsi love ballads",
    "link": "https://worldsnews24.vercel.app/sports/benafsha-the-afghan-cricket-queen-who-defeated-the-taliban-by-building-her-own-life-taking-the-team-along-talking-a-lot-and-listening-to-farsi-love-ballads",
    "siteurl": "https://worldsnews24.vercel.app/sports/benafsha-the-afghan-cricket-queen-who-defeated-the-taliban-by-building-her-own-life-taking-the-team-along-talking-a-lot-and-listening-to-farsi-love-ballads",
    "description": "Benafsha's father was killed in mysterious circumstances in Kabul, but cricket kept her determined at 18 to escape Talib atrocities even as she insisted that she would seek refuge in Australia only if the rest of the cricket team and families were taken in too.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Benafsha-Hashimi-afghanistan.png",
    "description1": "Benafsha Hashimi is sitting on her father’s lap, stroking his beard, in Kabul, Afghanistan when an advisory message plays out on the television. “Don't come to Australia illegally on boats”, a note for the many immigrant residents risking, often losing, their lives to get across. Little Benafsha thinks Australia is just on the other side of the big river in Kabul. “I shall go there, pedar (Father, in Dari language) one day, I have to just cross the river”. The father tells her she has to learn swimming first. “Don’t worry, I can go in a boat!” The father laughs but assures her that she can go the proper way one day but she has to study hard and grow up. Nearly one-and-half decades later, in 2021, the 21 year old Hashimi has ended up in Canberra in Australia, escaping the clutches of Taliban, surviving the death of her father, an Afghan special forces soldier, in mysterious circumstances. But she also witnessed an aunt who bled to death, besides myriad shootings, before dragging her entire Afghan team of women along with her. All this when she was still a teenager, three years back. It’s a remarkable story of hope, will-power, selflessness, stubbornness, and a lot of cheekiness. We meet at an outdoorsy cafe the morning after India’s warm-up game against the Prime Minister’s XI. Almost immediately, she excuses herself and hops off to play with a dog that was barking rather loudly and she laughs, a lovely full-throated aural memory that will stick in the mind, when the dog’s owner says ‘he likes his own voice’. When she plonks back on her chair, she announces, “I have a cat, Lilly. I love lilies and my Lilly. We talk a lot.” It’s probably the rare imagery of the morning when she reflects her age; the rest of the time, as she narrates her life story, immense inspiring maturity floats in the air. It’s a story that’s difficult to decide where to start. At that moment, perhaps, when the Taliban had taken over the city, the 18-year old rushes to the bank to withdraw money for her family of 10 but instead hears the Taliban soldiers outside the bank, firing in the air. Or at the Checkpost at Pakistan border, when she is fleeing with the family in the middle of night 'sadly like a pack of thieves” and is stopped by the Talibs, who bark at her brother Hamid to tell “this girl to stop talking, who has given a girl rights to talk, just stand aside.” Or the moment when her phone starts to ring, with a popular Farsi love song triggering outrage in the Taliban soldiers, and her brother muttering, ‘we are all going to die’ even as he tried to stop the call. It was her friend, a cricketing team-mate wanting to know her whereabouts. It’s perhaps best to start with why that friend was reaching out. Not at that moment, but how Benafsha became the rallying group leader for the girls of her cricket team, and their families, to get to Australia in a move that’s bound to have positive repercussions for generations to come for those families. “No, no, it was a combined team effort, I couldn’t have done it without my friends,” she says but it’s clear that they couldn’t have even dared to dream this life without her. She was the resourceful one, tirelessly pursuing opportunities outside, sending emails to all parts of the cricketing world and beyond to see a possible light at the end of the Taliban tunnel. The first three emails were her passport to survival and better life but unbelievably she chose to ignore them. The US authorities offered her escape due to her father’s past with them, Canada threw her a lifeline and so did Dubai, but she is adamant that she wants her team with her. “My well-wishers who were trying to help me to escape all understandably called me an idiot. But I was stubborn. In weak moments when I would think perhaps I should take it, an inner voice would come loud and clear: ‘C’mon Benafsha, you are a team player. This is not what a good person does. You can’t abandon your friends and be selfish.” And so she even lies to her mother that she didn’t hear back from anyone. That they have to just wait and hope. It’s when Mel Jones, an Australian woman cricketer of stature hears her story, and offers help. The Australian authorities get into the picture soon and are shocked to hear that she wants the entire team and families to escape. “You know, right, we can’t do that. It’s not easy, how can we take so many people out. You and your family come first.” Benafasha Hashimi listens to no one but her inner voice. “Even today when I speak to youngsters I tell them, my life motto is, “Listen to all, but don’t follow anyone. Only follow your heart, courage will come automatically.” Around us, the dog is now barking at a distance as the owners have just left, the sun is shining brightly, and the cafe lady offers coffee; Benafsha doesn’t want any. “That dog is funny. I haven’t heard any other dog in this city bark as loudly as him. It’s not like Kabul, you know,” she says. Or India. But we plunge back to Kabul, before we can return to her escape, and to her father. “He treated me like a little princess. Usually Afghan men prefer sons; he was different, distributing laddoos to everyone in the neighbourhood when I was born, his fourth child. He would keep telling me that I am a special one and can do whatever I want, live my dream but only that I have to be educated and work hard.” Due to the nature of his work, he was often away. “And then one day, he came in a coffin. There he was laid out, outside our door and I was not even 10 then. I just sat there, staring at him. My younger sister kept repeating, “he is just sleeping, he will wake up.” It was their mother who took both aside to tell them that their father is no more and it’s okay to cry. “Don’t bottle it up, cry if you have to. This is what it is. We have to face reality.” The reality kept turning dark. “Some said he had a heart-attack, some said he was poisoned, we don’t know to this day.” Not long after that, more tragedy struck. Benafsha found herself pouring water on her aunt’s dea",
    "description2": "d body to cleanse. “Only women are allowed in our tradition. She was shot in the hip and head, blood on her body when she was brought home.” A childhood shot to pieces, pushing her to grow up rather too quickly but luckily one remnant would remain. “Cricket saved my life,” she says with a chirpiness, and adding solemnly, “Cricket is my life.” *** Her mother never liked her playing cricket. Especially in the streets with the boys, once she grew up a little. The coaches at the official academy didn’t take a liking to her because she was a “street cricketer” and not someone who grew up in the system. Her memories of playing in the streets still remain very special to her. “The empty oil tin cans were our stumps and I must say I terrorised the boys by hitting!” It was her eldest brother Hamid who kept fighting with their mother to allow her to play cricket and things turned a bit when she won a scholarship to a cricket talent programme. Things kept escalating positively and she was named alongside 25 girls, officially contracted by the Afghanistan Cricket board in 2021. The lights would go out soon, though. She remembers that day at the bank just days after the Taliban took over. “When I heard the shootings I froze in fear. I huddled behind other women, not knowing what would happen.” But it wasn’t the bullets that was her worst moment, but the vulgar gaze of a male Taliban soldier. “He gave me this look - a dirty look that I can’t describe but I knew what it was. He told the others to stop shooting and told me that the bank is shut today, but write your name now in this paper. And come to meet me tomorrow. I shall take you inside. I nodded and ran from there, shivering. That look is my worst memory from those days at Kabul. It made me doubly determined that I should leave Afghanistan. There was no option left.” But as we know even when the opportunities came, she didn’t take them as she wanted her team also to be safe. “I am the one doing all the paperwork, emailing, talking in my broken English; what would happen to them if I left?” And so she pressed the Australian authorities to somehow pull off the miracle for her. They buckled under her sweet emotional pressure, and promised her they would. That they will process the paperwork, get the required permission, but the evacuation can’t be en-masse. First her and her family. “I managed to get two more families along with me, of course,” she smiles. And it’s to that night in September 2021 she returns to. “Many in our group were happy, but me and my sister Safia, who is two years younger and also in our team, were sad. We love Afghanistan, we loved our days in Kabul. We didn’t want to leave …” There were numerous checkpoints, where they would all insist that they were off to a wedding. It was at one such post where her phone rang with Farsi love tune drifting in the air. “The talibs were so angry, screaming that it’s blasphemy and that we shall be whiplashed. Somehow we got through.” They were in Pakistan, first, for a week before they flew to Australia. They say it takes a village to rear a child, it takes people from different countries to flee that village in distress. Walwala and Toba in Afghanistan cricketing circuit, unnamed Australian authorities, Mel Jones, and Catherine Ordway, a lawyer, academic, and sports integrity expert who has been part of tribunals. Catherine, who had helped her through the process, was at hand to receive her in Australia, and very soon would be referred to as “mum” by Benafsha. “ I remember the moment when we emotionally bonded. They had taken us, not long after arrival in Canberra, to the river. It was a man-made waterbody and was black in colour. I have never seen black waters before and even as I was talking to her, I held her hand. My friends whispered to me not to do it, and so I asked her if she minded. She had this bright smile when she said no, and gave me this hug. I call her mum, these days.” She plays for two clubs in Australia, she also played for Sydney University team briefly, and travelled to Fiji to play cricket with the organisation ‘Cricket without Borders’. In January, she will represent Afghan Women XI that will play against Cricket without Borders at MCG in Melbourne. “We shall get there early January and there will be selection trials. I would absolutely love it if I were the captain!” Not everything is hunky dory. The past has a way to cling on, leaving its residues in the soul. Benafsha often wakes up screaming at nights, calling out for her mother. “I would have different nightmares that also include me being about to be killed.” Seeing the alarmed face, she explains in a gentle voice as if speaking to a kid. “Don’t worry, it’s normal. In the most depressive times when one is in a place of great trouble, as I was in Kabul, nothing spills out. Your determination, your need to be positive and look ahead gets you through. Often, when you reach a safe place, with the troubles seemingly behind you, it’s when the trauma hits.” She is taking counselling and is all set to pursue her sports management course, that has psychology in the syllabus, at the Canberra University from February next year. She then cues up an awww moment with her own mother, who had worried about her playing cricket, worried about her straying outside on the streets, worried about her studying in Kabul - again her brother had insisted she must as it was the father’s dream and she was the brightest kid in the family. “One day here, she said, “Benafsha, without you, none of this would have been possible. I dread to think what would have happened to us in Kabul.” There is this look on Benafsha’s face as she recalls that - not a face of pride, surprisingly, but of love. And as he gets up to leave, ignoring protests that she has not even eaten anything and whether she needs a lift, Benafsha, which means 'violet' and whose nickname is 'Choti Shaitaan (Little Devil), beams this bright smile and says, “Don’t worry Janaab, I know my way, this is my country now!”",
    "image": "https://images.indianexpress.com/2024/12/Benafsha-Hashimi-afghanistan.png",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T13:19:47+05:30",
    "dateModified": "2024-12-02T13:19:47+05:30"
  },
  {
    "title": "Pink ball practice game: Is Rohit Sharma batting at No 4 a hint of him batting down the order in Adelaide?",
    "link": "https://worldsnews24.vercel.app/sports/pink-ball-practice-game-is-rohit-sharma-batting-at-no-4-a-hint-of-him-batting-down-the-order-in-adelaide",
    "siteurl": "https://worldsnews24.vercel.app/sports/pink-ball-practice-game-is-rohit-sharma-batting-at-no-4-a-hint-of-him-batting-down-the-order-in-adelaide",
    "description": "IND vs AUS: Rohit Sharma's batting position has been a topic of debate ever since KL Rahul batted as well as he did in the first Test. Perhaps, it would have been different had Rohit been in a richer vein of form.",
    "thumbnail": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T183048.303.jpg",
    "description1": "Rohit Sharma didn’t open, choosing to bat at No.4 in the Prime Minister’s XI pink-ball game at Manuka Oval, triggering obvious thoughts about his batting position in the Adelaide Test. It does make sense after KL Rahul’s assured batting as an opener in both innings of the Perth Test, the way he mentored Yashasvi Jaiswal in the second dig there. It was Shubman Gill, who batted at three, reassuming his position that he has made his own, and made a neat fifty. It also allows Rohit, who has been a bit too impetuous in the recent Tests as an opener, to settle in a middle-order role. He lasted just 11 balls though against PM XI, chasing a ball well outside off from Charlie Anderson, and edging it to the slips. The crowd sensed that Virat Kohli was not at the ground - he had left by then—and a large section left the arena. Rishabh Pant, who kept for the first half of the PM XI’s batting innings before Sarfaraz Khan took over, too didn’t bat. Rohit’s batting position has been a topic of debate ever since Rahul batted as well as he did in the first Test. Perhaps, it would have been different had Rohit been in a richer vein of form. At his pomp as Test opener, he was the classic opener, not taking any risks, letting a ton of balls go through to the ‘keeper, taking his time to open up. But of late, he has been in a bit of a hurry, trying to stamp his authority rather quickly on the proceedings. The middle-order role allows him more breathing space, and less issues as he doesn’t have to face the moving pink ball. All else went pretty well for India. They won the toss and chose to bowl first to test their batting under lights. The pink ball did move around a bit, especially when new, in total contrast to the afternoon when it was pretty flat. The game itself was a bit of a friendly as India kept batting on even after they “won”, chasing down the 241-run target. Mid-afternoon rains had reduced the game from 50-overs to 46 and Sam Konstas-the 19-year old opener who has suddenly shot up in the national reckoning and was in the frame to be selected for the Perth Test-slammed an aggressive hundred. Yashasvi Jaiswal took it up to Jack Nisbet in Canberra but the fiery NSW quick wasn't backing down! 👀 #PMXIvIND pic.twitter.com/tX3O86wEv2 — cricket.com.au (@cricketcomau) December 1, 2024 Compact Rahul Rahul continued to showcase his compact technique. The best thing about it isn’t in the shots he played, but in dealing with the ball in the off-stump corridor. In the past, he has o",
    "description2": "ccasionally let his hands jar at the ball, dragging the bat away from the body. But in Perth, as also here, he just played the line. If the ball jagged away, it would sail past the edge without any danger. Even the forward stride that was so precise and effective at Perth was on view here. His form gives additional reason for Rohit to go down the order. Gill eased into his knock without much fuss. There were a couple of deliveries initially when he had a bit of a poke and a miss, and Rahul came across for a mid-pitch chat. The ball had straightened or just about shaped away on those occasions. There weren't many alarms for him afterwards, and pretty soon in his piece, he unfurled his short-arm jabbed cut - that stroke without much follow-through and a shot that was reared on cement tracks in childhood. It’s quite a visual treat, as he allows the ball to come through and sort of hammers the nail on its head with one swift fluid move. A half-century for Shubman Gill in his first innings of India's Australian tour #PMXIvIND pic.twitter.com/YCPGFMqvs8 — cricket.com.au (@cricketcomau) December 1, 2024 Jaiswal was squared-up a couple of times against the new ball cutting away from him. There were a couple more edged fours through slips as he tried to charge and heave once, and got a leading edge on the other when he tried to work the ball to the on side. But when he wanted to be compact and tight, he was. The only real sign of concern, if that word can be used, when he seemingly had a back spasm. He kept fiddling with his back and when it ailed him a tad bit more, he took treatment from the physio, as he lay on his stomach. But it must not have been something serious as he continued batting. Of all the Indian batsmen, he was the one who tried to be overtly aggressive, and eventually miscued a heave to cover. Nitish Reddy continued to be his impressively busy self. Just as he did to Nathan Lyon at Perth, he took the attack to the leg spinner Lloyd Pope. A charge down the track and a slog sweep had the crowd howling in delight but the shot of the game was his revere-swept boundary. It was some shot, to a full delivery outside off and Reddy just let his hands go through the shot in some style. India wrapped up the game, with most batsmen they wanted getting a hit, and the bowlers getting a bowl. Brief Scores: Prime Minister's XI 240 (Konstas 107, Jacobs 61, Rana 4-44) lost to India 257 for 5 (Gill 50, Jaiswal 45, Reddy 42, Washington 42*, Anderson 2-30) by five wickets.",
    "image": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T183048.303.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T18:38:28+05:30",
    "dateModified": "2024-12-01T18:38:28+05:30"
  },
  {
    "title": "India vs Japan U19 Asia Cup 2024, LIVE Cricket Score: Mohammad Amaan’s century help IND reach 339/6",
    "link": "https://worldsnews24.vercel.app/sports/india-vs-japan-u19-asia-cup-2024-live-cricket-score-mohammad-amaan-s-century-help-ind-reach-339-6",
    "siteurl": "https://worldsnews24.vercel.app/sports/india-vs-japan-u19-asia-cup-2024-live-cricket-score-mohammad-amaan-s-century-help-ind-reach-339-6",
    "description": "India vs Japan (IND-U19 vs JPN-U19) U19 Asia Cup 2024 Live Cricket Score Online Updates: India captain Mohammad Amaan slammed unbeaten 122 to help India post 339 for 6 vs Japan in Sharjah.",
    "thumbnail": "https://images.indianexpress.com/2024/12/India-vs-Japan-IND-U19-vs-JPN-U19-IND-U19-vs-JPN-U19-live-score-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-live-score-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-live-cricket-score-live-cricket.jpg",
    "description1": "India U19 vs Japan U19 (IND-U19 vs JPN-U19) U19 Asia Cup 2024 Live Cricket Score Updates: Riding on a calm and calculated hundred from captain Mohammad Amaan, India posted 339 for 6 in 50 overs in their second match of the ACC U-19 Asia Cup at the Sharjah Cricket Stadium on Monday. India had a rollicking start courtesy their openers Ayush Mhatre (54 off 29 balls) and Viabhav Suryavanshi (233 off 23 balls) as the duo forged together a 65-run stand for the first wicket. C Andre Siddarth (35) and KP Karthikeya (57) also played a crucial role. But the knock of the day was played by Amaan, who remained unbeaten on ",
    "description2": "122. For Japan, Hugo Kelly (2/42) and Kiefer Yamamoto-Lake (2/74) were the most successful bowler. Charles Hinze and Aarav Tiwari chipped in with a wicket apiece. Playing XIs India U-19 XI: Ayush Mhatre, Vaibhav Suryavanshi, Andre Siddarth, KP Karthikeya, Mohammad Amaan (C), Nikhil Kumar, Hardik Raj, Harvansh Singh (wk), Samarth Nagaraj, Yudhajit Guha, Chetan Sharma. Japan U-19 XI: Nihar Parmar, Aditya Phadke, Koji Hardgrave Abe, Kazuma Kato Stafford, Charlie Hinze, Hugo Kelly, Timothy Moore, Kiefer Yamamoto Lake, Daniel Panckhurst, Max Yonekawa Lynn, Aarav Tiwari. Follow India U-19 vs Japan U-19 updates below",
    "image": "https://images.indianexpress.com/2024/12/India-vs-Japan-IND-U19-vs-JPN-U19-IND-U19-vs-JPN-U19-live-score-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-live-score-IND-U19-vs-JPN-U19-U19-Asia-Cup-2024-live-cricket-score-live-cricket.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T09:22:39+05:30",
    "dateModified": "2024-12-02T09:22:39+05:30"
  },
  {
    "title": "How Arsenal have turned the previously-derided set-piece routine into a fine art and massive weapon",
    "link": "https://worldsnews24.vercel.app/sports/how-arsenal-have-turned-the-previously-derided-set-piece-routine-into-a-fine-art-and-massive-weapon",
    "siteurl": "https://worldsnews24.vercel.app/sports/how-arsenal-have-turned-the-previously-derided-set-piece-routine-into-a-fine-art-and-massive-weapon",
    "description": "Gabriel is at the forefront of Gunners' prowess at corners and free-kicks, masterminded by specialist coach Nicolas Jover.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Arsneal-football.jpg",
    "description1": "Two events foreshadow an Arsenal corner kick. The moment the referee decrees one, Gabriel, the strapping centre-back, ambles to the vicinity of the far post. On the touchline, manager Mikel Arteta, perennially on an emotional edge, slouches onto his seat in the dug-out; set-piece coach Nicolas Jover, with a twinkle in his eyes, veers onto the touchline. Two events often follow an Arsenal corner kick too. The soaring giant of a man, Gabriel leaping above his markers, sliding and stretching his neck as though it were made of rubber and heading the ball into the net. Jover would leap and swipe the air. Since the start of last season, Arsenal have converted more set-pieces than any other club (25 excluding penalties) in the Premier League. Gabriel, unsurprisingly, has netted more goals than any other centre-back since his arrival in the 2021-22 season (15, the next best Virgil van Dijk has scored nine times). It’s so frequent that their supporters buzz as though they have earned a penalty. The action — from the time the ball goes out and the corner is swung — barely takes half a minute. In this time, the players move to their designated positions, which vary from match to match. But the most common pattern features one of Arsenal’s players rubbing shoulders with the goalkeeper inside the six-yard box, giving a false impression that he is the intended target. He is rather the decoy, his only intention being to distract the goalkeeper, manufacturing space for the intended target (often Gabriel, but not always him, as it could become too predictable). Gabriel lurks on the edge of the six-yard box, on the left. Three of them usually hover behind him, inside the 18-yard box. They are the dummy runners, trying to clear out the far post area. When the ball swings in, they often move towards the ball, dragging markers to the near post. One or two might linger just outside the box and the rest stand behind them, to thwart any counter-attack. So far, it’s straightforward. The deliveries, Bukayo Saka from the right and Declan Rice from the left, are largely in-swingers fired either on the goalkeeper or to the back post. Some bend late into the goal; some don’t. It's then the intricate patterns set in a fury of limbs moving this way or that. The runners from deep in the box charge in, the shield dishevels the goalkeeper or the nearest defender (sometimes controversially, and a reason perhaps the more stringent referees of Champions League award a foul against them). Gabriel’s opening goal against West Ham United this week",
    "description2": "end was a classic instance, when Jurren Timber bumped into the back of Lucas Paquetá at the front post, denying him the space to jump and clear the ball. It swirled into the path of Gabriel, who hit the target. West Ham players rebelled for a lost cause. As have several other teams the last two seasons. Ben White tried to undo the gloves of Tottenham goalkeeper Guglielmo Vicario before one of the corner-kick goals. Keeping opponents guessing Whereas Gabriel’s movements have been similar - a shimmy to the right (when delivered from the right), an explosive leap as he scuds the ball goalward - the rest of their movements are unpredictable. Sometimes, they drift into the box like a swarm of bees. Sometimes, they scatter like a regiment after a drill. It’s synchronised chaos, so second-guessing their patterns becomes difficult. These are movements chiselled to perfection on the training ground under Jover’s watch. The coach, who joined Arteta from Manchester City after he thought he was not getting enough time to work on set-pieces with the champions, more reliant on open play than set-pieces for goals, polished their set-pieces with intense, opponent-specific drills. The onus is on specific runs to sharpen their movements. Players are given just two seconds to run into a specific point to receive the ball, with Jover insisting on repeating and re-repeating the action until it becomes second nature. The season before Jover took over, Arsenal had scored just six goals from set-pieces in the entire season. Arteta can’t stop praising him. “Him and the rest of the staff have injected the belief into the players that there are many ways to win football matches. This is a really powerful one and he has given us a lot,” he once said. Jover is not the pioneer in set-piece coaching, but its most efficient exponent. The 43-year-old Frenchman has never played competitive football, but after completing his sports degree in Canada, joined the French club Montpellier as video analyst, before camping with the Croatian national team as match analyst. It was at Brentford in 2016 that he assumed the role of free-kick specialist. This was around the time teams were starting to focus more on set-pieces than ever before rather than decrying its lack of aesthetics, even though 28 percent of all goals every season arrive in this fashion. Earlier, it was seen as the refuge of teams in the relegation zone (as Brentford was when Jover joined the Bees). But no team has mastered the set-piece art like Arsenal. At the heart of it is Jover.",
    "image": "https://images.indianexpress.com/2024/12/Arsneal-football.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T08:50:08+05:30",
    "dateModified": "2024-12-02T08:50:08+05:30"
  },
  {
    "title": "How Bharat Arun helped Mohammed Siraj turn his form around by making him bowl yorkers",
    "link": "https://worldsnews24.vercel.app/sports/how-bharat-arun-helped-mohammed-siraj-turn-his-form-around-by-making-him-bowl-yorkers",
    "siteurl": "https://worldsnews24.vercel.app/sports/how-bharat-arun-helped-mohammed-siraj-turn-his-form-around-by-making-him-bowl-yorkers",
    "description": "IND vs AUS: It was Arun’s advice that would give Mohammed Siraj the confidence to forget about wickets and enjoy the process. Arun recalls the conversation at the end of the home Test series against New Zealand.",
    "thumbnail": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T195124.492.jpg",
    "description1": "The former bowling coach of India Bharat Arun was startled to hear Mohammad Siraj’s voice in a phone call. “He sounded a touch sad, down, then,” Arun tells this newspaper on a day where Siraj thanked Arun for a turnaround in his fortunes in Australia. At the end of the game against Prime Ministers XI at Canberra, Siraj talked about how he has “rediscovered the joy of bowling,” and how in the recent past he was “trying too hard to get wickets” and when it didn't come, it led to a vicious loop. Everyone mattered, he said, told him to not to over-stress about wickets and just bowl. Be it Jasprit Bumrah, who told him “don’t worry about wickets, it will come in due time. If it doesn’t, come to me.” Or Morne Morkel, the current bowling coach, who told him, “You are a warrior, don’t worry, just bowl,” Siraj recalled at the end of the PM XI game. But it was Arun’s advice that would give him the confidence to forget about wickets and enjoy the process. Arun recalls the conversation at the end of the home Test series against New Zealand. Siraj had been dropped from the second Test against New Zealand. “He told me that the ball was sliding towards leg, he wasn’t getting the swing and the seam position didn’t feel as ideal as before,” Arun shares. “I had been watching him and had noticed a few changes and asked him what he had been trying. In his pursuit of wickets, he had felt that he had to increase his pace, try to get more swing/movement and was putting more effort at release.” But all that had messed up with his original method. “The main problem as I saw it was his wrist wasn’t behind the ball, his most crucial weapon. In his effort to increase the pace, all these mistakes were creeping up. Perhaps he felt a bit rushed at the crease. What happens then is your body can also slide/tilt a bit more, especially if you are an open-chested bowler like him. That meant his radar was now going down,” he explains. “Without the wrist at the right place, the seam position too was getting affected. And instead of getting more movement that he wanted, the bowling was getting affected,” he adds. SIUUU-RAJ Arrives! 🫡#MohammedSiraj kicks off India’s wicket-taking spree, luring Renshaw into a well-set trap in the #PinkBallTest! 🤩 Rain has stopped play in the #AUSvINDonStar Warm-up match! Stay tuned to Star Sports for further updates! #ToughestRivalry pic.twitter.com/DZZTr53WGf — Star Sports (@StarSportsIndia) December 1, 2024 Simple plan Bharat, wh",
    "description2": "o has mentored Siraj through his first-class years, knows what will work for him. “It’s no use saying get the wrist behind the ball; when you are edgy and worried, all that doesn’t make sense. I know Siraj, he works best when you give him a simple bowling plan, a drill, say.” So, Arun told him in a subsequent conversation to aim at one stump, and keep bowling. “That’s the off stump, so to speak, and if he wants he can bring the ball from just outside or straight. Setting a simple target like that forces accuracy,” he details. “I then told him to bowl a lot of yorkers at that one stump. Now, this is not to improve his yorkers but to get the wrist in the right position behind the ball. You can’t bowl yorkers, good ones that is, without the wrist in the right position. If it’s tilted or out of shape, then the ball won’t go where you want it to go.” In the subsequent conversations, Arun says it was a happier Siraj who called him to say that the yorker plan had worked. “When the wrist is behind, the pace also increases automatically. The accuracy is a lot better, and you can actually then bowl what you want to bowl: be it the one that cuts back in or straightens,” he says. “I talked to Bharat Arun sir. He said this is what is happening with me. He had known me for a long time,” Siraj would say at the end of the PM XI. “ I have been bowling very well for the last six-seven months but I wasn’t getting wickets. As a human being, you start wondering why you’re not getting wickets. So just trying a little too hard to get the wickets led me to miss my lines and lengths a little. So I sat at home and thought about why this is happening to me.” That’s when the thought hit him that he should call his old coach Arun. The proof that the plan worked out would come in Perth, Arun knew. So he watched the game intently. “That Smith wicket in the second innings was the ideal Siraj for me. How much did it move? Not much. It’s not what he was trying to do when he was down and in poor form; he had wanted lots of movement etc. That’s not him, as in that’s not his bowling style,” he says. Subsequently, his shoulder didn’t fall away prior to release. “That helps the ball in straightening and when it did, Smith edged it. For Siraj, the main thing is the wrist behind the ball. That’s the sign; for him if that happens, it means other things are in place: he is not falling away, he is not pushing the ball down, and he is hitting the right lengths,” he says.",
    "image": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T195124.492.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T19:55:34+05:30",
    "dateModified": "2024-12-01T19:55:34+05:30"
  },
  {
    "title": "World Chess Championship: How Gukesh courageously spurned chance to draw despite being in worse position vs Ding Liren",
    "link": "https://worldsnews24.vercel.app/sports/world-chess-championship-how-gukesh-courageously-spurned-chance-to-draw-despite-being-in-worse-position-vs-ding-liren",
    "siteurl": "https://worldsnews24.vercel.app/sports/world-chess-championship-how-gukesh-courageously-spurned-chance-to-draw-despite-being-in-worse-position-vs-ding-liren",
    "description": "World Chess Championship: The two combatants, Ding Liren and Gukesh, are tied at three points apiece going into second rest day of the showdown.\n\n",
    "thumbnail": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T193005.896.jpg",
    "description1": "For about 25 minutes in Game 6 on Sunday – which eventually resulted in a draw after 46 moves - Ding Liren spent his time on the board with feet dipped in the warm pool of false hope. The two queens had spent the last few moves waltzing in the middle of the board, their gaze locked at each other. Ding’s queen shuffled backwards and forwards on d5 and d6 squares, batting its eyelashes at its counterpart. D Gukesh’s queen seemed to be following its lead, moving between e7 and g5 squares. Then, when one more step on the g5 square would have solemnised a draw by threefold repetition - which would have seen both players head into the second rest day of the 2024 World Chess Championship at three points each – the Indian’s queen opted to swipe left. Instead of heading to the e7 square, Gukesh’s queen went to h4, rejecting the advances of Ding’s queen. The 18-year-old from Chennai had chosen to spurn his world champion opponent’s very evident draw offer. Gukesh was in no mood to down weapons this early. Not right before a rest day, at least. So instead of playing 26…Qe7 for the third time, he instead played 26…Qh4. Call it the heady optimism of youth, or just the opportunistic psychological prodding of a player who knows what his opponent wants, and is ready to suffer himself for as long as possible just so that the other player is denied what he craves. Ding threw a few accusatory looks at his opponent at this stage, as if the Indian teen had been leading him on. “I thought I might be slightly worse. I wasn’t sure if I was. With the files open in front of his king, I thought I had counterplay. I saw no reason to go for the repetition. Not like I was playing for the win or anything, but I just wanted to play a few more moves and see what happened,” Gukesh said nonchalantly at the post-game press conference. So when had Gukesh decided that he would not play for the draw? Was it the second time he repeated the moves? Or was it just before it was time to move the queen for the third time? READ MORE: At World Chess Championship, Ding not chilling. or having ice cream “When I moved it the second time, I had decided that I would not go for the draw,” he said. Gukesh was asked if this was a psychological ploy to get under Ding’s skin, to gauge the world champion’s intentions and then send a message that he was feeling up for a fight. “I just like playing chess, yeah?” smiled Gukesh. “It was more the position than a psychological thing. And I didn’t see too much danger fo",
    "description2": "r me.” INTERACTIVE: Game 6 between Gukesh and Ding Liren You can check out the move by move action from Game 6 between Gukesh and Ding Liren and also play along in the interactive below. Scroll down to read our updates in real time from Game 6. Contrasting approaches While Gukesh was living life on the edge, his mentor Viswanathan Anand was speaking in the FIDE commentary booth about how the 14-game World Chess Championship has played out thus far. “We’re seeing contrasting approaches. Ding is very solid with white. It's not like his ideas are lacking venom. But he’s not taking a lot of risks yet. Gukesh is pushing a bit more. But every once in a while, he stumbles. Yesterday, thanks to a miracle, he got away. Gukesh is putting more pressure, but needs to be more exact,\" Anand said about Saturday’s Game 5. Just as Anand had indicated, Ding was playing risk-free chess in Game 6. Gukesh was taking a devil-may-care approach that possibly would have made his backroom team squirm. After all, it’s the world chess championship. If you’re in a position to take a draw, while you’re in a worse position, you take a draw. But Gukesh was clearly not in the mood for that sort of logic. “Even in an inferior endgame, Gukesh is trying instead of opting for a draw… But he wins the respect of a lot of fans! ” tweeted chess legend Susan Polgar, who later added: “I would be super nervous playing black here. Not easy at all!” The game did end in a draw. The queens were traded by the 35th move, something Ding had been attempting to do as early as the 13th move, trying to throw his destroyer-in-chief on squares where both queens could be exchanged. But Gukesh resisted, before finally giving in. READ MORE: In contrast to inscrutable Gukesh, Ding Liren allows the world to see how he feels Just like in previous games, Ding had come out swinging on Sunday with his opening preparation. He blitzed his first 20 moves, spending barely seven minutes on them. In contrast, his teenage challenger was pushed into long phases of thought after the world champion employed the London System. Gukesh used up almost 53 minutes on his first 20 moves. At one point, Gukesh was trailing by as much as 45 minutes on the clock but managed to navigate himself out of trouble. But eventually, not just out-maneuvering himself out of trouble, he was also actively courting it in some phases. The result means that both players head into the second rest day of the world chess championship even on three points each.",
    "image": "https://images.indianexpress.com/2024/12/New-Project-2024-12-01T193005.896.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 12:10:36 pm",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T19:35:54+05:30",
    "dateModified": "2024-12-01T19:35:54+05:30"
  },
  {
    "title": "SA20's next decade: Predictions from Graeme Smith, Dinesh Karthik, Mark Boucher",
    "link": "https://worldsnews24.vercel.app/sports/sa20-s-next-decade-predictions-from-graeme-smith-dinesh-karthik-mark-boucher",
    "siteurl": "https://worldsnews24.vercel.app/sports/sa20-s-next-decade-predictions-from-graeme-smith-dinesh-karthik-mark-boucher",
    "description": "SA20's next decade: Predictions from Graeme Smith, Dinesh Karthik, Mark Boucher",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202083428.jpg",
    "description1": "\n\n\nJohannesburg [South Africa], December 2 (ANI): As the SA20 league continues to grow, prominent cricket figures Graeme Smith, Dinesh Karthik, and Mark Boucher share their perspectives on where they see the league in the next decade. Their insights highlight the potential and ambition driving the tournament forward.\nGraeme Smith, the League Commissioner of SA20, reflects on the league's future with cautious optimism at SA20 India Day.\n\n\"I think 10 years is always tough to predict. But I think if we can follow at a level the same curve as IPL, that would be amazing,\" he said, as quoted by a release from SA20.\nSmith emphasized the importance of captivating fans in a competitive entertainment landscape.\n\"There's a lot of options for fans in today's world. We want to make sure that in our window that people are excited and tune in every year to see what SA20 is doing like they do with IPL, Premier League, football and others. We want to be one of the most established leagues and biggest outside India,\" he noted at SA20 India Day.\n\n\nIndian cricketer Dinesh Karthik envisions greater involvement from Indian players in the SA20 league over the next decade. He acknowledges the current BCCI policy but expresses hope for future participation. He is also the India Ambassador of SA20.\n\"In 10 years down the line, I can say that o",
    "description2": "bviously there is a policy in BCCI and everyone is adhering to that policy. But I hope I'm the first number to come out and play this league because I can definitely share my experience post the league how it was on a personal front,\" Karthik stated, as quoted by a release from SA20.\nHe highlighted the league's potential to enhance players' skills and financial stability.\n\"At the end of the day, all active players are looking for two things. A) How do I get better as a player? B) Financially, how is it viable? And on both fronts, I can confidently say that this segment is at a place which is definitely helping every player who is part of it,\" he said at SA20 India Day.\nMark Boucher, who is also the ambassador of SA20 league, also sees a bright future for the tournament. He draws parallels with the IPL's successful model, suggesting that SA20 could expand in a similar manner.\n\"I think to answer that as well, the template there and what the IPL has done. And you've got IPL owners involved in SA20 as well. So 10 years down the line, who used to say that there won't be another 4 or 5 teams? The template is there and it has certainly worked. So as long as SA20 carry on the same template, following the IPL, with the IPL owners, who's to know, I think it's going to be very successful,\" Boucher said, as quoted by SA20. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202083428.jpg",
    "image1": "",
    "date": "Invalid Date",
    "time": "Updated 12:10:36 pm",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:16 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:16 IST"
  }
]