{
  "videos": [
    {
      "title": "Breaking News: India vs Australia, LIVE Updates",
      "source": "ev_hZ4wKVx0",
      "description": "IND vs AUS Test: India vs Australia 1st Test live | Live Score & Commentary",
      "thumbnail": "https://img.youtube.com/vi/ev_hZ4wKVx0/0.jpg",
      "date": "2024-11-20",
      "time": "10:30 AM",
      "courtesy": "CNN"
    },
    {
      "title": "Breaking News: India vs Australia, LIVE Updates",
      "source": "mODtrH5kOyE",
      "description": "India vs Australia, LIVE Updates, 1st test Day 1: KL Rahul’s Controversial Dismissal Puts India On Back Foot Ahead Of Lunch",
      "description1": "India enters this highly anticipated clash still feeling the aftershocks of a 3-0 loss to New Zealand in a home Test series. But India will be looking forward to bounce back stronger and dominate the Aussies on their home ground. As the Border-Gavaskar Trophy commences, team India finds itself on uncertain grounds. The top-order batters are under intense pressure, as the Australian team is eager to enforce its dominance at home with the stakes for the series opener in Perth have never been higher. India enters this highly anticipated clash still feeling the aftershocks of a 3-0 loss to New Zealand in a home Test series. The pain is still felt, but the hostile Australian conditions will not allow time for complacency. This is an opportunity for India: bounce back, and the team would be shocked into submission by losses; otherwise, overwhelm is the only way out.",
      "description2": "The top order dilemma looms large for India. Rohit Sharma and Shubman Gill, both are unavailable for the Perth test, leaving India’s opening combination in disarray. For all this, it has forced the management to be in a frantic search for a solution, with KL Rahul almost certain to fill in the gaps. Fans and analysts alike have been left eagerly awaiting official confirmation as ambiguity looms over the situation. ",
      "thumbnail": "https://img.youtube.com/vi/ixcoyVxvJsI/0.jpg",
       "image": "https://news24online.com/wp-content/uploads/2024/11/India-vs-Australia-Live-Updates.jpg",
      "image1": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/indias-mohammed-shami-celebrates-the-wicket-of-australias-david-warner-during-the-icc-mens-cricke-300945154-16x9.jpg?VersionId=BrY0OMCxlMIdW46Kzev2v8Ynt_EkItTZ&size=690:388",
      "date": "2024-11-20",
      "time": "10:30 AM",
      "courtesy": "News 24"
    }
  ]
}