{
  "videos": [
    {
      "title": "'Now give Mo his dough' - Liverpool can't let Salah leave Anfield",
      "source": "KOgtICimh5E",
      "source1": "4-GfiBoHLkE",
      "description": "Liverpool’s fans are using Mohamed Salah’s trademark goal celebration to make public their demands that 'The Egyptian King' must not be allowed to leave Anfield.",
      "thumbnail": "https://img.youtube.com/vi/KOgtICimh5E/0.jpg",
      "description1": "'He Fires A Bow. Now Give Mo His Dough' reads the banner that is being brandished these days - and more could be on the way after the 32-year-old delivered another match-winning display in the 3-2 victory at Southampton. Liverpool, struggling against determined opponents and a horrendous south-coast storm, were struggling at 2-1 down until Salah struck twice to give them the victory that puts them eight points clear at the top of the Premier League. The first was classic Salah, his mere presence seemingly scrambling the mind of Southampton goalkeeper Alex McCarthy, whose injudicious dash from goal was enough for Liverpool’s marksman to swoop.",
      "description2": "Salah’s winner was a penalty. No firing a bow this time, instead showing remarkable courage to rip off his shirt in such atrocious weather. The contracts of Salah, Virgil van Dijk and Trent Alexander-Arnold have provided a permanent sub-plot to head coach Arne Slot’s first season, the forward adding his own intrigue with an unprompted announcement that it may be his last season at Liverpool following the win at Manchester United.After his latest exploits, there is now a simple question for Liverpool’s owners, the Fenway Sports Group. How can they possibly allow a situation where a world-class, game-changing, enduringly brilliant player can walk away for nothing at the of the season? Of course, the unknown – at least publicly – is what Salah will demand to stay, especially as he can command a huge signing on fee if he moved on a free transfer, and whether this all fits in with FSG’s much-touted 'Moneyball' strategy, which does not encourage long, expensive contracts for players in their 30s.",
      "image": "https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/fcf6/live/f1399c50-aa8d-11ef-9325-79c3284cf7e7.jpg.webp",
      "image1": "https://img.youtube.com/vi/4-GfiBoHLkE/maxresdefault.jpg",
      "date": "2024-11-24",
      "time": "16:30 PM",
      "courtesy": "BBC News"
    },  
    {
      "title": "Highlights: Australia v India 2024-25 | First Test | Day Three",
      "source": "4W9YskwfTXE",
      "description": "Highlights: Australia v India 2024-25 | First Test | Day One",
      "thumbnail": "https://img.youtube.com/vi/4W9YskwfTXE/0.jpg",
      "date": "2024-11-23",
      "time": "16:30 PM",
      "courtesy": "cricket.com.au"
    },
    {
      "title": "Highlights: Australia v India 2024-25 | First Test | Day Two",
      "source": "4W9YskwfTXE",
      "description": "Highlights: Australia v India 2024-25 | First Test | Day One",
      "thumbnail": "https://img.youtube.com/vi/4W9YskwfTXE/0.jpg",
      "date": "2024-11-23",
      "time": "16:30 PM",
      "courtesy": "cricket.com.au"
    },
    {
      "title": "Highlights: Australia v India 2024-25 | First Test | Day One",
      "source": "pmxfvy3SImg",
      "description": "Highlights: Australia v India 2024-25 | First Test | Day One",
      "thumbnail": "https://img.youtube.com/vi/pmxfvy3SImg/0.jpg",
      "date": "2024-11-22",
      "time": "16:30 PM",
      "courtesy": "cricket.com.au"
    },
    {
      "title": "Breaking News: India vs Australia, LIVE Updates",
      "source": "ev_hZ4wKVx0",
      "description": "IND vs AUS Test: India vs Australia 1st Test live | Live Score & Commentary",
      "thumbnail": "https://img.youtube.com/vi/ev_hZ4wKVx0/0.jpg",
      "date": "2024-11-20",
      "time": "10:30 AM",
      "courtesy": "CNN"
    },    
    {
      "title": "Breaking News: India vs Australia, LIVE Updates",
      "source": "mODtrH5kOyE",
      "description": "India vs Australia, LIVE Updates, 1st test Day 1: KL Rahul’s Controversial Dismissal Puts India On Back Foot Ahead Of Lunch",
      "description1": "India enters this highly anticipated clash still feeling the aftershocks of a 3-0 loss to New Zealand in a home Test series. But India will be looking forward to bounce back stronger and dominate the Aussies on their home ground. As the Border-Gavaskar Trophy commences, team India finds itself on uncertain grounds. The top-order batters are under intense pressure, as the Australian team is eager to enforce its dominance at home with the stakes for the series opener in Perth have never been higher. India enters this highly anticipated clash still feeling the aftershocks of a 3-0 loss to New Zealand in a home Test series. The pain is still felt, but the hostile Australian conditions will not allow time for complacency. This is an opportunity for India: bounce back, and the team would be shocked into submission by losses; otherwise, overwhelm is the only way out.",
      "description2": "The top order dilemma looms large for India. Rohit Sharma and Shubman Gill, both are unavailable for the Perth test, leaving India’s opening combination in disarray. For all this, it has forced the management to be in a frantic search for a solution, with KL Rahul almost certain to fill in the gaps. Fans and analysts alike have been left eagerly awaiting official confirmation as ambiguity looms over the situation. ",
      "thumbnail": "https://img.youtube.com/vi/ixcoyVxvJsI/0.jpg",
       "image": "https://news24online.com/wp-content/uploads/2024/11/India-vs-Australia-Live-Updates.jpg",
      "image1": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/indias-mohammed-shami-celebrates-the-wicket-of-australias-david-warner-during-the-icc-mens-cricke-300945154-16x9.jpg?VersionId=BrY0OMCxlMIdW46Kzev2v8Ynt_EkItTZ&size=690:388",
      "date": "2024-11-20",
      "time": "10:30 AM",
      "courtesy": "News 24"
    }
  ]
}