[
  {
    "title": "It’s Cyber Monday and here are top 5 tech deals worth exploring",
    "link": "https://worldsnews24.vercel.app/tech/it-s-cyber-monday-and-here-are-top-5-tech-deals-worth-exploring",
    "siteurl": "https://worldsnews24.vercel.app/tech/it-s-cyber-monday-and-here-are-top-5-tech-deals-worth-exploring",
    "description": "Did you miss the Black Friday sale? Cyber Monday is here for your rescue.",
    "thumbnail": "https://images.indianexpress.com/2024/12/cybermonday-deals.jpg",
    "description1": "Black Friday is one of the best times of the year to buy new gadgets and gizmos; however, a true tech fanatic usually waits until Cyber Monday, which will have more enticing deals and discounts on electronic gadgets such as smartphones, laptops, gaming consoles, and accessories. While Cyber Monday deals are hugely popular in Western countries, they have also become common in India over the last few years, with many major retailers and e-tailers participating. Do note that some of these deals are still listed under Black Friday sales, but they can be considered Cyber Monday deals. Here are five tech deals currently live on various e-commerce platforms in India that are worth considering this Cyber Monday: Samsung Galaxy S23 Ultra Deals on the Galaxy S23 Ultra get better with every passing month, and Samsung's previous flagship is currently selling at its all-time low price of Rs 72,999, making it an enticing deal for anyone looking for a high-end Android flagship smartphone with cutting-edge camera capabilities, Galaxy AI, and a phone with an integrated stylus. Despite being almost two years old, the Galaxy S23 Ultra (review) has aged like fine wine, and at its current price, there are few smartphones as versatile and reliable as the Samsung Galaxy S23 Ultra. Sony PS5 Slim Digital Edition This one is a repeater from our Black Friday deal picks. At its discounted price of Rs 37,490, it offers unbeatable gaming performance that's plenty powerful. With its slimmer and modular design that allows users to add a Blu-ray drive when needed, this is easily one of the best gaming consoles that officially sell in India. Besides being a gaming console, it can also double as a platform w",
    "description2": "here one can watch movies and TV shows on platforms like Netflix and Prime Video. MacBook Air M1 For anyone looking for a new laptop for around Rs 50,000 and inclined toward a Mac, the MacBook Air M1 is a fantastic deal. It combines the premium metal unibody build, reliability, and battery life, and despite being officially discontinued by Apple, it has everything one expects from a modern MacBook, including Apple Intelligence. At its current discounted price of Rs 56,990, no Windows laptop comes close to the MacBook Air in value, except for a few cases like gaming. HP Victus Gaming Laptop If you are looking for a gaming laptop and the MacBook isn't even on your radar, the HP Victus Gaming Laptop, priced at Rs 59,990, can be a great alternative to the MacBook Air, especially if you are a gamer. Powered by the AMD Ryzen 5 5600H CPU and NVIDIA RTX 3050 GPU with 4 GB of VRAM, it is clearly one of the most powerful laptops for gaming under Rs 60,000. Besides gaming, it will also be a great pick for anyone looking for a laptop for 3D rendering and video editing, and the RTX graphics can also easily run some of the small and medium-sized AI models locally. Amazon Echo Pop If you are yet to get an Alexa-powered smart speaker and don't want to spend a lot before exploring its services, the Echo Pop (review) is a great pick, especially at its discounted price of Rs 3,999. From its semi-sphere-like design to the ability to control smart devices and wireless music streaming support, it's easily one of the best entry-level smart speakers that money can buy. Available in multiple colour options like white, black, and green, one can pick a shade that matches the aesthetics of their home.",
    "image": "https://images.indianexpress.com/2024/12/cybermonday-deals.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T10:16:27+05:30",
    "dateModified": "2024-12-02T10:16:27+05:30"
  },
  {
    "title": "Can the Apple MacBook Pro get any better?",
    "link": "https://worldsnews24.vercel.app/tech/can-the-apple-macbook-pro-get-any-better",
    "siteurl": "https://worldsnews24.vercel.app/tech/can-the-apple-macbook-pro-get-any-better",
    "description": "With prices starting at Rs 1,69,900, the MacBook Pro M4 now stands tall as the most powerful laptop you can own. ",
    "thumbnail": "https://images.indianexpress.com/2024/12/Tech-feature-images52.jpg",
    "description1": "There was a time when work and personal time used to be very distinct silos for us. But then the Covid pandemic and the resultant lifestyle changes impacted all of us like never before. But when work beckons you wherever you are — be it on a Vande Bharat train dissecting the Indian peninsula or a cozy courtyard overlooking the Kochi backwaters — you have to be sure the devices you have are able to take on the task at hand. Work is no longer an endeavour confined to the office environment. The new 14-inch Apple MacBook Pro powered by the M4 chip is made just for those times when you have to quickly work on a video edit wherever your passions take you. On the design front, the Apple MacBook Pro M4 does not come with any changes; it has the same look and feel, keyboard layout, and weight as the previous generation. However, I found the Space Black very stylish and practical for Indian conditions. It will also set you apart in a cafe where everyone else has older Silver Macs. The Magic Keyboard is well laid out like always and offers good feedback while typing; the trackpad is responsive to even the slightest of touches when you are trying to flick away a screen. That screen The 14-inch Liquid Retina XDR display is exactly what you need if working under the bright Kerala sun and it offers the right colour reproduction for you to ensure your photos and videos have the right hues in the final edit. The videos I shot on the iPhone 15 Pro Max as well as the Fujifilm X-S20 shone up on this stunning screen, even though I was not working under the best conditions at the resort we had for a family get-together near the backwaters in Kochi. The extreme dynamic range seen in most of the iPhone photos with my fascination for clouds comes out perfectly on this screen. And when the clouds give way to unseasonal November rains, the six-speaker sound system with four force-cancelling woofers and two tweeters makes you feel like you are listening to the new Pushpa 2 song drop on a Bluetooth speaker from some specialist European brand. Even more power The M4 has pushed the efficiencies of the M series even further. It is hard to figure out how much faster the new processor has made the MacBook Pro, given that even the M3 was more powerful than what most workflows demanded. But if you are among those working on the most power-sapping tasks, you will find everything happening a tad faster than before. And for those who have just these grueling workflows every day, this will make a huge difference. I airdropped about 16 4K clips from the iPhone and tried to merge them into one long video file. And it took about 40 seconds for a 4-minute-20-second clip to be exported from this. Anything faster would, of course, be faster but won’t make much sense to most users. Remember, you can maybe do this on a MacBook Air too these days, but if you push on video editing you need the fans and cooling of the MacBook Pro. For those already working on AI models or 3D graphics, i",
    "description2": "t might still make sense to opt for the models with M4 Pro or Max. Once Apple Intelligence rolls out to all users we should be able to see the power of the M4 to help solve problems on the device. New software features With macOS Sequoia 15, I loved how you can mirror the iPhone onto the MacBook Pro and get to see notifications or apps directly on the large screen. Just to underline, I have done these with some Android phones almost a decade back. Apple could have done much more here, like letting you drag and drop photos from the iPhone to the MacBook. Now you can open the photos app and airdrop the iPhone photos. Also, the ability to get apps to go full-screen would be a great feature to have. One reason I have been using a MacBook Pro for the past few years is the ability to connect to a TV for meetings using the HDMI cable. This port stays with the new MacBook Pro along with the first Thunderbolt 5, offering transfer speeds of up to 120Gb This means you can connect to high-resolution displays easily. Plus, you have a card reader and three Thunderbolt (USB-C) ports. For those on video conferencing all the time, Centrestage comes to the MacBook Pro and does a great job of keeping you in the middle of the frame at all times. This is great for people like me who have trouble sitting straight during calls, especially when the meeting is wandering off from its agenda. However, I thought the 12MP could have done better in low light. Better power management, more power With all the improvements in processing power on the M4, the real achievement has been how the MacBook Pro manages over 24 hours on a full charge. Remember, this is with a better, brighter display. It is fascinating how even four generations since the M series launched the rest of the computing world is playing catchup on battery life. Should you buy it? Every year when a new MacBook comes out I get questions from regular users, much like me, asking if it is time for them to upgrade. My answers have started changing over the past couple of years. With the MacBook Pro powered by the new M4, I am not sure if this makes sense for the average user, especially now when MacBook Airs too are powered by M series chips. But if you do anything creative that needs a lot of processing like video editing, 3D modeling, or even top-end gaming, there is nothing better out there. And given how much stress you are planning to offload on the device, you have the option of choosing the chipset that can manage your workload. With prices starting at Rs 1,69,900, the MacBook Pro M4 now stands tall as the most powerful laptop you can own. If you are on a MacBook that is still running on Intel chips, it is a no-brainer to upgrade now, since the promise of AI is closer than ever before. Apple Macbook Pro M4 Pros Cons Superb processing power The camera is not great in low light 24-hour battery life Design is same as before Stunning display and audio Could have done more with iPhone mirroring Sleek design",
    "image": "https://images.indianexpress.com/2024/12/Tech-feature-images52.jpg",
    "image1": "https://images.indianexpress.com/2013/12/nandagopal-rajan.jpg",
    "date": "1/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T17:00:38+05:30",
    "dateModified": "2024-12-01T17:00:38+05:30"
  },
  {
    "title": "How India and other countries regulate children’s social media access",
    "link": "https://worldsnews24.vercel.app/tech/how-india-and-other-countries-regulate-children-s-social-media-access",
    "siteurl": "https://worldsnews24.vercel.app/tech/how-india-and-other-countries-regulate-children-s-social-media-access",
    "description": "Australia’s landmark social media ban on under-16 children could set a global precedent. ",
    "thumbnail": "https://images.indianexpress.com/2024/11/social-media.jpg",
    "description1": "In an ambitious attempt to rein in big tech companies, Australia recently passed a law that bans social media access for children below the age of 16. The law was passed by the Australian Senate on Friday, November 29, with a vote of 34-19 after the country’s House of Representatives approved the first-of-its-kind legislation by 102 votes to 13 a day prior. As per the legislation, social media companies are liable for fines up to 50 million Australian dollars (Rs 275 crore approx.) if they fail to prevent children under the age of 16 from holding accounts on their platforms. Messaging apps, online gaming services, and platforms that are primarily used for health and education purposes are to be exempted from the ban. However, the law does not make an exception for age-restricted users who have the consent of their parents or carers. Here’s a look at what other countries have been doing to regulate children’s access to social media. India: While there are no specific legal restrictions on protecting children from online harm, India’s Digital Personal Data Protection Act, 2023, has a higher level of requirement than age verification for processing children’s data online. It requires data fiduciaries to collect “verifiable parental consent” from parents of children under the age of 18. United States: The Children’s Online Privacy Protection Act (COPPA), enacted in 1998, requires parental consent for websites to collect personal information from children under 13. Many companies responded by blocking access for this age group, leading to widespread age fraud. The Children’s Internet Protection Act (CIPA) of 2000 restricted access to inappropriate content in schools and libraries, but critics argued it was a limited solution since children could still access all online content outside these settings, often blocking useful information. United Kingdom: The UK has no current plans for Australia-style restrictions. But digital minister Peter Kyle has said that everything is on the table when it comes to keeping people safe online and has launched a study to explore the impact of smartphone and social media use specifically on children. He said that regulator Ofcom must have regard to government priorities such as safety by design and transparency and accountability, as they enforce the Online Safety Act from next year. The act, which sets tougher standards for social media platforms such as Facebook, YouTube and TikTok - including on appropriate age restrictions - was passed in 2023 by the previous government. European Union (EU):",
    "description2": " In the European Union, parental consent is required for the processing of personal data for children under the age of 16, though the bloc's 27 member states can lower that limit to 13. Norway: The Norwegian government last month proposed raising the age at which children can consent to the terms required to use social media to 15 years from 13 years currently, although parents would still be permitted to sign off on their behalf if they are under the age limit. The centre-left government also said it had begun work on legislation to set an absolute legal minimum age limit for social media use, but it was not immediately clear when a law mandating this may reach parliament. Half of Norway's nine-year-olds use some form of social media, according to the government. France: In 2023, France passed a law requiring social platforms to obtain parental consent for minors under 15 to create accounts. However, local media say technical challenges mean it has not yet enforced. In April, a panel commissioned by President Emmanuel Macron recommended stricter rules, including banning cellphones for children under 11 and internet-enabled phones for those under 13. It is unclear when new legislation could be adopted and to what extent it would follow the experts' recommendations. Germany: Officially, minors between the ages of 13 and 16 are allowed to use social media in Germany only if their parents give consent. There are currently no plans to go further. However, child protection advocates say controls are insufficient and call for existing rules to be better implemented. Belgium: In 2018, Belgium enacted a law requiring children to be at least 13 years old to create a social media account without parental permission. Netherlands: While the Netherlands doesn't have any laws regarding a minimum age for social media use, the government did ban mobile devices in classrooms from January 2024 to reduce distractions. Exceptions apply for digital lessons, medical needs or disabilities. Italy: In Italy, children under the age of 14 need parental consent to sign up for social media accounts, while no consent is required from that age upwards. China: Last year, China's cyberspace regulator said children under the age of 18 should be limited to a maximum of two hours a day on their smartphones. The Cyberspace Administration of China (CAC) said it wanted providers of smart devices to introduce so-called minor mode programmes that would bar users under 18 from accessing the internet on mobile devices from 10 pm to 6 am. (With inputs from Reuters)",
    "image": "https://images.indianexpress.com/2024/11/social-media.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T16:40:23+05:30",
    "dateModified": "2024-12-01T16:40:23+05:30"
  },
  {
    "title": "5 AI gadgets you need to check out that aren’t smartphones or laptops",
    "link": "https://worldsnews24.vercel.app/tech/5-ai-gadgets-you-need-to-check-out-that-aren-t-smartphones-or-laptops",
    "siteurl": "https://worldsnews24.vercel.app/tech/5-ai-gadgets-you-need-to-check-out-that-aren-t-smartphones-or-laptops",
    "description": "Tech companies want to sell AI as a key selling point for many of the devices you may be considering.",
    "thumbnail": "https://images.indianexpress.com/2024/12/Tech-feature-images50.jpg",
    "description1": "If you look around the market, you’ll realise that all your essential devices—whether smartphones, laptops, or tablets—now feature generative artificial intelligence capabilities. In fact, the race to integrate Gen AI began with ChatGPT, which quickly evolved from a must-have app to influencing hardware design. While there has been significant optimism around AI, with billions invested in the technology, we have yet to see an explosion of devices designed from the ground up with generative AI at the same pace as the technology was initially marketed. Sure, the adoption of Gen AI isn’t widespread, and only a handful of people actively use AI on their devices. However, that hasn’t stopped companies like Meta and a few high-profile startups from heavily investing in new form factors designed with Gen AI in mind from day one. And the best part? You can actually buy these devices from the market. Here are five such cool AI gadgets that aren’t smartphones or laptops. Ray-Ban Meta glasses Meta’s Ray-Ban glasses showcase the potential use case of Gen AI in a familiar and easy-to-use form factor. They look like regular Ray-Bans, aren’t bulky, and the AI functionality works seamlessly. The best part about these glasses is that they aren’t trying to be a face-computer but rather a complementary device to your smartphone. In fact, these smart glasses have been outselling traditional Ray-Bans in some stores across Europe, the Middle East, and Africa, highlighting the growing consumer enthusiasm for such devices. Although they aren’t designed for augmented reality experiences, users can take photos, listen to music, and ask the Meta AI digital assistant for information about objects within their field of view. Perhaps the most impressive aspect of the Ray-Ban glasses, like smartphones, is that Meta continues to improve them through software updates. Earlier this year, Meta began rolling out Gen AI features for the device and later announced several new AI capabilities at its Connect event in September. It wouldn’t be wrong to say that Meta’s Ray-Ban glasses are a true AI success story. It is the execution that might have worked in favour of Meta. You can snag the Meta Ray-Ban glasses for as low as $239 during the Black Friday sale. Rabbit R1 When the Rabbit R1 was announced earlier this year at the CES tech show, the device seemingly came out of nowhere and captured the interest of both the tech community and the general public. The bright orange-coloured AI gadget, the R1, was positioned differently from smartphones, and based on early demos, its computer vision was praised, helping the device stand out in the market. The $200 R1 has a camera and dual mics, allowing it to record audio clips, set timers, or perform more advanced tasks like providing search results, making voice recordings, and streaming music. However, upon release, the devic",
    "description2": "e didn’t exactly have smooth sailing. It fails to outdo what a smartphone can already do. Since its release, the R1 has seen significant improvements, and the startup promises a much better experience with the AI gadget. Maybe the R1 isn’t perfect, but it does what AI can do on a device built specifically for artificial intelligence. Bee Bee is a new AI wristband on the market, but what makes it different from other smart wearables is that the device is built for generative artificial intelligence. The Bee may look like an ordinary connected smart band, but it functions via a connection to users' smartphones. It has dual mics that allow it to listen to and analyze people’s voice memos and conversations to provide summaries and to-do lists. The device understands 40 languages and can also be integrated with healthcare tools and people’s Google and Gmail accounts to help generate personalized summaries and action items. The wearable, which went on sale recently, costs $50, and those who want better memory or additional capabilities will have to pay a $15 subscription. Google Pixel Buds Pro 2 Google’s flagship Pixel Buds Pro 2 aren’t just designed for listening to music—they also feature AI throughout. This is likely why Google uses generative AI as a core feature and a selling point for the Pixel Buds Pro 2. While the previous generation of Pixel Buds featured Google Assistant and the “Hey Google!” functionality, the new iteration also comes with Gemini AI. This gives the Buds access to Google’s new Gemini Live AI feature by saying \"Let's talk\" after activating the assistant with the wake command. Although the feature can be inconsistent, it gives the Google Assistant experience a more conversational, interactive feel and allows you to receive advanced search results read back to you through the buds. Google seems to be going all-in with the AI-powered features of its new wireless earbuds. While the technology may not be perfect, it promises an expanded use case for AI in wireless earbuds—going beyond what AI can do on a smartphone. Kindle Scribe (2024) When the Scribe debuted last year, it was Amazon's first e-reader with pen support. It’s a terrific e-ink tablet, though priced on the higher side. With the new generation of Scribe just hitting the market, Amazon is adding improved features that elevate the handwriting experience with the help of AI. The first, called Refined Writing, analyses all of your handwritten notes and converts them into something more legible. The second feature, called Summarise, looks at all of your writing and distils it into a one-page summary of the key points. The $399 Scribe is a new type of device—part e-ink reader and part tablet. From what Amazon has showcased, Scribe's AI-powered features do feel like first-generation integration, but they’re not an afterthought; they’re core to the experience.",
    "image": "https://images.indianexpress.com/2024/12/Tech-feature-images50.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T12:02:14+05:30",
    "dateModified": "2024-12-01T12:02:14+05:30"
  },
  {
    "title": "Elon Musk seeks injunction against OpenAI and Microsoft alleging anti-competitive behaviour",
    "link": "https://worldsnews24.vercel.app/tech/elon-musk-seeks-injunction-against-openai-and-microsoft-alleging-anti-competitive-behaviour",
    "siteurl": "https://worldsnews24.vercel.app/tech/elon-musk-seeks-injunction-against-openai-and-microsoft-alleging-anti-competitive-behaviour",
    "description": "Musk’s lawyers alleged that OpenAI was depriving xAI of funding by demanding that investors don’t back its rivals. ",
    "thumbnail": "https://images.indianexpress.com/2024/12/Tech-feature-images49.jpg",
    "description1": "Tech billionaire Elon Musk’s lawyers have filed for a preliminary injunction against OpenAI and Microsoft in an attempt to stop them and other defendants named in the filing from engaging in alleged anti-competitive behaviour. Filed in the US District Court for the Northern District of California on Friday, November 29, the motion for an injunction seeks to halt alleged illicit activities by OpenAI CEO Sam Altman, president Greg Brockman, LinkedIn co-founder and former OpenAI board member Reid Hoffman, and former OpenAI board member and Microsoft VP Dee Templeton. In the motion for an injunction, Musk’s lawyers alleged that OpenAI discouraged investors from funding its rivals such as the Tesla CEO’s AI company called xAI. “Musk has verified that at least one major investor in OpenAI’s October funding round has subsequently declined to invest in xAI,” the document read. It also alleges that the sharing of proprietary information and resources between OpenAI and its biggest investor, Microsoft, is illegal and amounts to “self-dealing,” which is harming marketplace competition. Additionally, the motion accuses the defendants o",
    "description2": "f having OpenAI throw business to organisations in which they have “material financial interests\". It notes, for example, that OpenAI chose Stripe as its payment processor to benefit Altman who has stakes in the platform. OpenAI’s bid to transition to a for-profit company was also challenged by Musk’s lawyers in the motion for an injunction. “No objective observer can look at OpenAI today and say it bears any resemblance whatsoever to what it promised to be,” the filing read. “An injunction to preserve what is left of OpenAI’s nonprofit character, free from self-dealing, is the only appropriate remedy. If not, the OpenAI promised to Musk and the public will be long gone by the time the court reaches the merits,” it further stated. “Elon’s fourth attempt, which again recycles the same baseless complaints, continues to be utterly without merit,” an OpenAI spokesperson said in a statement to TechCrunch. In February, Musk sued OpenAI for allegedly abandoning its original nonprofit mission of making the benefits of its AI research available to everyone. The lawsuit was initially withdrawn in July only to be revived a month later.",
    "image": "https://images.indianexpress.com/2024/12/Tech-feature-images49.jpg",
    "image1": "",
    "date": "1/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-01T10:45:52+05:30",
    "dateModified": "2024-12-01T10:45:52+05:30"
  },
  {
    "title": "Google Pixel 9 Pro review : Hello, small phone",
    "link": "https://worldsnews24.vercel.app/tech/google-pixel-9-pro-review-hello-small-phone",
    "siteurl": "https://worldsnews24.vercel.app/tech/google-pixel-9-pro-review-hello-small-phone",
    "description": "With the Pixel 9 Pro, Google has created the almost perfect premium small phone to date.",
    "thumbnail": "https://images.indianexpress.com/2024/11/google-pixel-9-pro-review.jpg",
    "description1": "My fascination with small phones is well-documented, and nobody is a bigger fan of the iPhone 13 mini than I am. However, the device has started to age, and I feel it’s time to move on, which I did recently with the iPhone 16 Pro (I also use the Pixel 9 Pro Fold frequently—and gosh, it’s gorgeous). Yet, I still crave a small phone, and I don’t think Apple has plans to revive the iPhone Mini series—at least not anytime soon. For now, I have found a new companion in the Google Pixel 9 Pro (it successfully became my secondary device for a couple of days). A flagship-grade small phone was long overdue, and the Pixel 9 Pro, as a device, is both exciting and frustrating at times. I’ll get into where the Pixel 9 Pro excels and where it falls short in my review. Google Pixel 9 Pro price in India (as reviewed): Rs 1,09,999 Small is beautiful The moment I got the Pixel 9 Pro out of the box, I was surprised by its size. The Pixel 9 Pro XL (which I recently reviewed, and you can check out the review here) was huge in comparison. The Pixel 9 Pro is compact and fits perfectly into any pocket—literally any pocket—and the good thing is that the screen doesn’t feel small at all. I wouldn’t call it a tiny phone like the iPhone 13 Mini, which featured a 5.4-inch screen with tiny bezels and a reduced notch. The Pixel 9 Pro, on the other hand, has a 6.3-inch, 120 Hz, LTPO OLED display with up to 3,000 nits of brightness. The display is super bright and fast, with only small bezels and a single camera cut-out. After two weeks of using the phone, the screen feels normal. Honestly, while using the iPhone 13 Mini, it was always imprinted in my mind that it was a small phone and thus came with its shortcomings. That isn’t the case with the Pixel 9 Pro. As I mentioned, the 6.3-inch display is respectable in size—not as small as the 5.4-inch screen on the iPhone 13 Mini but still relatively compact. This is particularly small compared to today’s average smartphones, where a 6.8-inch display has become the standard. What impressed me about the Pixel 9 Pro, as with the iPhone 13 Mini, is how comfortable it is for one-handed use. I can easily take the phone out of my pocket and operate it with one hand. I know the struggle of holding a big phone while trying to shoot a video or take a photograph. I can also type a message with one hand while standing in a crowded place. The advantages of a small phone are there, and you need to embrace the size. The Pixel 9 Pro was made with the intention of being a premium flagship smartphone, and it shows in its design. I think it’s one of the best-looking high-end smartphones on the market and possibly the best small phone out there. Period. My review unit came in a lighter shade of pink (called Rose Quartz, by the way), and it’s pleasing to the eye, though I would have loved to see Google experiment with bold and fun colours similar to what Apple did with the new iMac. The screen is flat, while the body of the Pixel 9 Pro is square-ish with rounded corners, reminiscent of recent iPhones. The camera array on the back now features a raised oval island. It’s a controversial design—some might like it, while others may hate it. It protrudes quite far from the back of the phone, making a case necessary to protect the device. Additionally, I must note that it’s a very slippery phone due to the choice of materials and finish. That being said, the device feels expensive in the hand and has a Pixel-esque aesthetic, which matters a lot when Google is charging a premium for a phone like this. The camera triumphs The Pixel’s camera holds its ground to this day, even when smartphone cameras, in general, are fairly good across all models—no matter which device you pick up at any price point—and computational photography has become an integral part of modern phone camera design. However, I still feel that Google has an edge, and its Pixel phones still produce my favourite photographs. The Pixel 9 Pro has a triple-camera setup: a 50MP 1 sensor with an f aperture, a 48MP 1 sensor with a slightly improved f aperture (up from f on the Pixel 8 Pro), and a 12mm equivalent focal length. The telephoto camera also features a 48MP 1 sensor with an f aperture and a 5x optical zoom, with an equivalent focal length of 110mm. Many people don’t even know the camera specs, and it’s fair not to place too much emphasis on camera hardware. However, you need the best possible combination of camera hardware and software to achieve photographs that are less dramatic, true to the subject and have the sharpness and clarity that make each photo stand out as if you were part of the scene. The more I tried the Pixel 9 Pro’s camera, the better I was able to distinguish where the Pixel camera excels and where its shortcomings lie when compar",
    "description2": "ed to the iPhone 16 Pro’s camera, which also has its share of highs and lows. Not many may admit it, but it's important to highlight this as a reviewer. The Pixel 9 Pro is better at highlighting shadows, and skin tones generally appear more colour-accurate than on the iPhone. However, there are times when the Pixel reduces warm tones in a picture, and the colour auto-corrects too much. On the iPhone 16 Pro, I found that Apple has improved the phone’s 5X telephoto lens, and images appear sharper in low light. The Pixel also excels in video quality (the Pixel 9 Pro now offers 8K video recording using the Video Boost feature) and is particularly good at taking panoramas. However, the iPhone remains superior in overall video performance. That being said, the Pixel 9 Pro’s camera system is excellent and second to none (for example, the night mode is very impressive, as is the portrait mode), but it has its own flair and quirks that you won’t find on any other smartphone. It’s good to see the new selfie camera on the Pixel 9 series, which offers slightly more detailed images. You can use the Portrait option to create a shallow depth-of-field effect, although this has resulted in less realistic edges in my testing. Likeable performance, but the Pixel 9 Pro’s battery life surprised me Like other devices in the Pixel 9 series, the Pixel 9 Pro (my unit came with 256GB of storage and 16GB of RAM) uses the latest in-house produced Google chip: the G4. I am not into benchmarking and have no interest in comparing raw specs; all I care about is how the device feels on a day-to-day basis. The G4 feels powerful in regular everyday tasks such as browsing, social media, taking photos, navigating, and accessing apps. I found the phone to be much more capable of gaming, which surprised me. I did not notice the phone getting warm, as was the case with previous generations of Pixel devices. This is surely an improvement, as is the battery life. I was expecting the Pixel 9 Pro’s 4,700mAh battery to last as long as the iPhone 13 Mini in battery life, and to my surprise, the phone was able to last throughout the day, especially on days when I was out and had heavy app usage. When I got back home on those days, I found my phone with at least 15 to 20 per cent battery life left. However, don’t expect the battery life to last for two full days of use and even compare the Pixel 9 Pro to the Pixel 9 Pro XL and iPhone 16 Pro Max in terms of battery life. Android 15 and Pixel AI: A mixed bag The Pixel 9 series recently received an update to Android 15, and honestly, the latest software update brought very few new features. It's neither exciting nor does it alter the interface, which I feel has already started to stagnate. However, if you ask me, only two new features in Android 15 stand out: a) Private Space, which allows users to create a password-protected area within the phone for any apps or documents they might want to keep hidden. However, it’s not as user-friendly as I’d hoped. You need to sign in separately and re-download any apps you've installed in the \"public\" part of your phone, and it's not always clear how to hide certain files. b) The new Theft Detection feature is cool; it recognizes if your phone is snatched from your hand and instantly locks your screen to stop the thief from accessing your personal information. AI is a big part of the Pixel 9 Pro, and I have written in the past about how generative artificial intelligence features are more of a novelty at the moment and not as truly useful as Google wants users to believe. However, there are a few Google AI features that I found genuinely useful, such as the live transcription feature, which I feel is better than Apple’s AI. I also like Pixel Studio for creating generative AI pictures, and I use it frequently. However, I don’t use Gemini Live much; instead, I simply search the web. Should you buy the Google Pixel 9 Pro? I think it all depends on whether you need a smartphone with a small form factor. The Pixel 9 Pro is as capable as the Pixel 9 Pro XL because the hardware is exactly the same, with the only differences being the smaller screen and battery on the Pixel 9 Pro. I’m genuinely happy to be using the Pixel 9 Pro; it feels like a true flagship smartphone that is designed for small phone lovers like myself, and that is also its main selling point—of course, the camera is excellent. For me, though, the Pixel 9 Pro remains a superb smartphone—one of the best compact smartphones you can buy today. Google Pixel 9 Pro  Pros  Cons  Compact, premium design Slow charging IP68 water and dust resistance Android 15 is meh Gorgeous display Google AI is a hit-and-miss Excellent cameras Improved fingerprint scanner Good dual stereo speakers Multiple years of Android updates",
    "image": "https://images.indianexpress.com/2024/11/google-pixel-9-pro-review.jpg",
    "image1": "",
    "date": "3/11/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-03T14:32:58+05:30",
    "dateModified": "2024-11-03T14:32:58+05:30"
  },
  {
    "title": "Apple iPad mini (2024) review: A journalist’s notebook",
    "link": "https://worldsnews24.vercel.app/tech/apple-ipad-mini-2024-review-a-journalist-s-notebook",
    "siteurl": "https://worldsnews24.vercel.app/tech/apple-ipad-mini-2024-review-a-journalist-s-notebook",
    "description": "The iPad mini's small size, the quality of the screen, and the ability to use the Apple Pencil Pro (the one I use for taking notes) transform the tablet into a writing and sketching device. ",
    "thumbnail": "https://images.indianexpress.com/2024/11/pad.jpg",
    "description1": "Every time I attend a press launch event, a product briefing, or an interview, I make sure to carry my Moleskine reporter's notebook. It’s an integral part of what I do, and I’m sure my fellow journalists can relate to this. I often joke that you’re not a journalist if you don’t carry a notepad with you. However, as a tech journalist writing about personal technology for a living, I also try to review new products and incorporate them into my daily routine to see how I can benefit from them. Recently, I had the opportunity to try out the new iPad mini, and honestly, what intrigued me more than the usual features associated with the iPad was the idea that I could replace my pen and notebook with it. As I began using the iPad mini almost daily, I started to appreciate the device more. Reporting isn’t just about observing; it’s also about understanding the world around you. Apple’s little tablet serves not only as a tool for taking notes but also as a dictaphone, an AI assistant, and a camera, all rolled into one. Perhaps an integral part of my job is to share what I observe, and the iPad mini represents a new form of a reporter’s notebook as it embodies the accountability that comes with being a journalist. Here’s my review of the iPad mini. Apple iPad mini price in India: Rs 49,900 onwards (excludes the cost of Apple Pencil Pro) How I use the iPad I have been using the iPad for over a decade now, and I’m happy to be called a seasoned iPad user. There was a time when I switched to the iPad completely, totally replacing my Mac, and that phase lasted for a few years—until the M1 Mac came out, at which point I went back to using the Mac. I wouldn’t say I have an on-and-off relationship with the iPad. I still use it a lot, but not necessarily as a Mac replacement, as much as Apple would like me to. Instead, I enjoy taking notes on the iPad with the Apple Pencil, recording voice notes during product briefings, attending video calls, listening to music on Apple Music, and sometimes playing games. Honestly, I neither recommend buying the iPad Pro for these activities, nor would I want to spend that much money just to stream a Netflix show on it. I’m not into coding or making music, so I don't see the need for the iPad Pro or a premium tablet. It took me a while to figure out which iPad works for me, and considering I already use a Mac for computing tasks and the iPhone for phone-related activities, the iPad mini stands out for the things I want to do on a tablet. My love for dedicated devices If you ever peek into my tote bag and wonder why I carry so many different devices: an iPhone, an iPad, an iPod, a Nintendo Switch, a MacBook, a Kindle 3rd generation and a Samsung Galaxy camera. This is who I am; I’m a bit weird—someone who still listens to music on an iPod and uses wired earbuds. I like dedicated devices for different purposes, and I don’t regret that choice. I don’t believe a single device can replace every other device on the market. Maybe that's why I chose the iPad mini over the other iPads. It feels different, excels in one or two areas, and looks like what a tablet should be. This is the only iPad in Apple’s product portfolio that stays true to the original iPad. Small and compact I’m glad that Apple didn’t market the iPad mini as a computer like it did with the iPad Air and iPad Pro. The essence of the iPad mini lies in its small, compact footprint and its simplicity as a tablet. I’m sure you get that feeling when you pick up the mini. The 8-inch screen makes it just the right size for me to hold while lying on my back in bed, though I would say it isn’t as light as a Kindle. In terms of size, the Mini has been wonderful. It’s small enough that I can tuck it into a tote bag when I take public transportation or Uber, and it slides into even a stuffed backpack. It’s extremely lightweight (even with a protective case), which makes it a dream to travel with. That’s what I love about the iPad mini: you know it’s a tablet, and the Mini’s design and form make that clear. If you need an iPad for reading eBooks or taking notes, the Mini is the perfect choice. I didn’t get the same feeling when I was using the new iPad Air (the one with the 12.9-inch display)—the bulkier external keyboard doesn’t really suit a device as small as this. However, with the iPad mini, the design is intentional: you know it doesn’t support a Magic Keyboard, so you already understand its best use case. In my case, I use the Mini as a notebook replacement and jot down notes with the Apple Pencil. I also carry the Mini during interviews, keeping it on the table to record live transcriptions with Voice Notes. My life is sorted. The Mini features the flat-sided design of the iPad Pro, which I really like. That flat side enables support for the USB-C Apple Pencil as well as the Apple Pencil Pro (more on that later), which attaches magnetically to the side of the iPad and charges inductively. However, there’s no support for Face ID, as biometric authentication occurs via Touch ID integrated into the wake/sleep button on the edge of the iPad. The iPad mini offers a slightly less capable USB-C port and lacks the Thunderbolt port found on the iPad Pro. But nothing detracts from how the Mini feels as a device, because its purpose is well defined—what a small tablet can possibly do. The right screen size The screen display was a big selling point for me when switching to the iPad mini. First, the 8.3-inch screen size is just right for me—somewhere between the iPhone 16 Pro’s 6.3 inches and the MacBook Air’s 13 inches. Second, the screen size allows me to read eBooks on the go, which I’m not as comfortable doing on the iPad Air’s 12.9-inch screen. Finally, the Mini’s size and screen are perfect for taking notes. However, the iPad mini lacks a ProMotion display or an OLED display. I do feel that Apple could have included a high-refresh-rate",
    "description2": " display on the Mini. That would have been great, especially since many people who pick up this device likely intend to use it as an eBook reader or for gaming. I paired a keyboard with the Mini Apple has gotten a lot right with the iPad mini, but there is a caveat I must admit, as a fan of compact devices. The more you use the Mini, the more you realise that the on-screen keyboard isn’t great. The small form factor limits its usability for writing beyond a certain point. The landscape keyboard is cramped, while the portrait keyboard feels too large. Overall, the on-screen keyboard doesn’t provide a satisfying experience. That's why I paired an external keyboard for typing, which has greatly elevated my writing experience. However, you’ll never be completely satisfied. I have been using a mechanical keyboard with the Mini, and so far, the experience has been great. But I wouldn’t want to completely switch from my Mac. That being said, it doesn’t stop the Mini from being a capable portable writing machine when paired with a great keyboard. I have figured out how to write more effectively on the iPad mini and how to do it. That’s a fun aspect of using the iPad mini, or any iPad in general. I can try new keyboards and accessories to find what works for me. The do-it-yourself (DIY) approach is fantastic because it gives you the freedom to explore new ways of using a device despite certain shortcomings. A powerful processor and support for Apple Intelligence But the Mini feels like a powerful device with plenty of capability for the tasks it is designed for. The new Mini has been upgraded to the A17 Pro chip (the same one found in the iPhone 15 Pro). Scrolling through LinkedIn, reading newspapers, and visiting websites all worked just fine. I have also used the Mini as an eBook reader by firing up the Kindle app, and the device felt great. I'm not someone who will use the Mini for extraordinary tasks because I have a Mac for that. I know what type of user I am and why I’m so inclined toward the iPad mini. This understanding helps me appreciate the Mini better and see what it can do for me. The Mini also supports the brand-new Apple Intelligence (I tested a beta version; the public rollout might take a little longer, likely in early 2025 for India) on top of iPadOS. I have been using Apple's AI system for months since it was announced back in June, and my take on Apple getting into generative artificial intelligence is something I have been saying for a long time: it's familiar and helpful, but not out of this world. There are some features that are generally useful, such as writing tools that make your emails sound more professional and AI-powered audio transcription in the Voice Memos and Notes apps. I am already using the AI audio transcriptions in Voice Memos, and I can't tell you how helpful they are. This feature was long overdue and aligns perfectly with the iPad mini more than with any other device. Recently, I interviewed a developer on a video call using the iPad mini, recorded the conversation on the device itself, and used the Voice Memos app’s built-in ability to transcribe the entire interview into text. I then pasted the text into Google Docs, writing a copy on the Mini using the external keyboard. That’s my unique use case for the iPad mini. The note-taking ability is a standout feature Perhaps the primary reason I was so enamoured with the iPad mini is its note-taking capability. In my case, the device that comes closest to replacing a Moleskine reporter's notebook is the iPad mini. Its small size, the quality of the screen, and the ability to use the Apple Pencil Pro (the one I use for taking notes) transform the Mini into a writing and sketching device. My handwriting is awful (and only I can understand it), but I never stopped writing on paper. Sure, I may not be an artist or the best person to review the new Apple Pencil Pro, but I appreciate what Apple has done with this advanced stylus. The pencil’s haptic feedback dramatically improves the double-tap gesture and enhances the new squeeze gesture that brings up a contextual menu. There’s so much to love about the Pencil Pro, but I must say that as I use it more to take notes, I’ve realised just how bad my handwriting is. The good thing is that I still haven’t stopped writing or jotting down notes, and the Pencil Pro is helping me improve my handwriting—just one step at a time. Mini vs. Pro I brought up this question for a reason, and the answer lies in a simple fact: the iPad mini is a tablet and thus can’t replace your Mac. The iPad Pro is absolutely a beast and can come close to replacing the Mac, but it all depends on what type of user you are. I never tried to do Mac tasks on the iPad mini because I know it can’t handle them. Instead, the iPad mini shines in the areas that truly define the iPad, complemented by its form factor, screen size, and support for the Apple Pencil. That being said, the iPad mini is not perfect, and there’s room for improvement. Perhaps there could be new creative ways to add accessories and enhance the experience without necessarily requiring beefed-up performance, as Apple has done this time. Unfortunately, Apple Intelligence isn’t really a solution to the iPadOS problems. The issues that users typically complain about regarding iPadOS and how devices like the iPad Pro have been held back don’t really apply to the iPad mini. That’s where I feel a distinction needs to be made, and the user interface needs to be reevaluated with the form factor in mind to make iPadOS feel much better and more fluid. Apple iPad mini (2024) Pros Cons Small and compact footprint 60Hz display Supports Apple Intelligence Front camera is awkwardly placed Compatible with Apple Pencil Pro Missing FaceID 5G compatibility Performance boost with A17 Pro Double the storage over predecessor Access to Center Stage for video calls &nbsp;",
    "image": "https://images.indianexpress.com/2024/11/pad.jpg",
    "image1": "",
    "date": "2/11/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-11-02T09:27:44+05:30",
    "dateModified": "2024-11-02T09:27:44+05:30"
  },
  {
    "title": "Samsung Galaxy Tab S10 Ultra 5G shows what can happen when the best stylus meets AI",
    "link": "https://worldsnews24.vercel.app/tech/samsung-galaxy-tab-s10-ultra-5g-shows-what-can-happen-when-the-best-stylus-meets-ai",
    "siteurl": "https://worldsnews24.vercel.app/tech/samsung-galaxy-tab-s10-ultra-5g-shows-what-can-happen-when-the-best-stylus-meets-ai",
    "description": "Samsung Galaxy Tab S10 Ultra 5G sets a new benchmark for Android tablets with its powerful S-Pen, large display, AI-driven features, and strong performance. But is it worth your time and investment? Let's find out.",
    "thumbnail": "https://images.indianexpress.com/2024/10/Samsung-Galaxy-Tab-S10-Ultra-5G-.jpg",
    "description1": "What is the best Android tablet one can buy? For years, this has had just one answer, a Samsung Galaxy Tab. The Korean tech giant hopes to underline this for another year with its new Samsung Galaxy Tab S10 Ultra 5G, the tablet equivalent of its smartphone flagship. But is the new Tab S10 Ultra really worth the legacy it carries with it? I used it for a few days, and here is what I thought. The Samsung Galaxy Tab S10 Ultra 5G is a sleek tablet despite its large 14.6-inch Dynamic AMOLED 2X display. The tablet has a size that other companies don’t offer and is clearly aimed at those who need the larger canvas to capitalise on the S-pen's ability to take your creativity to a whole new level. Buy this is a large tablet and you need to be mindful of that, especially the wide, or long, orientation of the device. Thankfully, this tablet is so thin and light that it compensates for its size. I am used to carrying my iPad on trips and even the Apple tablet gets a bit hard to manage from an Indigo seat. The Tab S10 Ultra is much bigger and will only struggle more. In contrast, this is a great device to have on your office table or while you are lounging on the sofa at home to scribble down your thoughts or just consume the latest Netflix show on the stunning Samsung screen. In fact, I was impressed by the audio and video playback capabilities of the device, making it perfect for binge-watching a new show or just flipping through The Indian Express morning edition PDF. And contrary to what I said about the size, I would still stash this into my carry-on bag to watch a movie on the next flight to Mumbai. The audio playback is as powerful as a small Bluetooth speaker and can fill the room on a quiet day. The anti-reflection screen makes this a device with which you can take your reading to an outside cafe or the balcony of your beach resort. As always, the best part of getting a Samsung tablet is the S-Pen. I have been saying that Samsung devices are an S-Pen length ahead of the competition. The same is the case with the Samsung Galaxy Tab S10 Ultra where I found the S-Pen to have improved on its pressure sensitivity with a softer tip. The tablet makes more sense with the S-Pen. Take the stylus off its magnetic perch on the back of the tablet and you have a perfect slate to write on, es",
    "description2": "pecially when holding the tablet in a vertical orientation. The S-Pen glides on the screen capturing your handwriting perfectly. Here I was annotating PDFs and making notes for new projects with the S-Pen menu helping me make the choice every time I took to the pen. Over the years, Samsung has perfected the use of a stylus on the tablet with both hardware and software. There is a new aspect that is mindblowing in many ways. The Sketch to Image feature converts any doodle you create into a respectable painting. I finally got to see what all the doodles I have been working on since childhood would really look like if I had some actual artistic skills. This is also a good way to give wings to your ideas and will really interest a lot of users. With the Samsung Ultra Book Cover (which costs extra) this slate is powerful in more ways than one to become your primary computing device, taking charge of all your creative duties. This is also the first Samsung flagship device powered by a MediaTek processor, the Dimensity 9300+, and it has a bumped-up performance. The processor ensures that the device stays cool whatever you do, be it streaming for hours or playing a new game. Plus, you now have actual AI features rolling out into the device, which means the on-device computing power has to be top-notch at all times. The camera too has AI features like in the new Samsung phones and you can use it to move around some subject in the frame or erase it completely. The one aspect that did not impress me was the camera performance in low light as the images turned out too noisy. The battery life is impressive, especially given the thin frame of the device, and can last two full days of moderate use, especially if you are not using the 5G at all times. At a starting price of Rs 108,999 for the Wi-Fi version, the Samsung Galaxy Tab S10 Ultra is undoubtedly the best Android tablet of 2024. Buy the pricier 5G version (starting at Rs 122,999) if you are always on the move. With the S-Pen and the new AI features, there is little the competition can do to come close to what this tablet offers. However, if you are already a Tab S9 user then wait for the upgrade as expected for the chip as this device is almost similar to yours. New users need to check out the size of this tablet before committing.",
    "image": "https://images.indianexpress.com/2024/10/Samsung-Galaxy-Tab-S10-Ultra-5G-.jpg",
    "image1": "",
    "date": "26/10/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-10-26T10:30:12+05:30",
    "dateModified": "2024-10-26T10:30:12+05:30"
  },
  {
    "title": "Apple Watch Series 10 review: Thinner but larger and getting better with time",
    "link": "https://worldsnews24.vercel.app/tech/apple-watch-series-10-review-thinner-but-larger-and-getting-better-with-time",
    "siteurl": "https://worldsnews24.vercel.app/tech/apple-watch-series-10-review-thinner-but-larger-and-getting-better-with-time",
    "description": "The Apple Watch Series 10 refines the winning formula with a larger display, thinner design, and faster charging. While not a radical overhaul, these improvements enhance the user experience, especially for those coming from older models.",
    "thumbnail": "https://images.indianexpress.com/2024/10/apple-watch-series-10-review.jpg",
    "description1": "The 10th edition of the Apple Watch, the world’s most popular timepiece, is now out. While Apple celebrated 10 years of the iPhone with the iPhone X series that ushered in a new design philosophy, there are no such big flourishes with the Apple Watch Series 10. Maybe it is not the right time, or perhaps the time is such that nothing new is waiting to be done. As a regular Apple Watch user, I was excited to a certain extent by the larger display on the thinner device and wanted to see if that would change my usage. Here is what I found. Compared to the Apple Watch Series 9 (review), you can see and feel the extra real estate. With some of the new watch faces like Flux, the screen is fully utilised. And with apps like the New York Times, the alerts are now more readable with the extra real estate. But I would have loved a few new apps that are making full use of these two extra millimetres and thinner bezels on your hand. Also, the Apple Watch is now a tad bit thinner than before. After wearing it for a day I realised that this might be the Apple Watch I can wear to bed without being irritated much — I am a light sleeper and keep blaming everything from an afternoon coffee to the type of bed linen for my lack of sleep. It also makes sense to wear the Apple Watch to sleep now as you have the new Vitals app, which uses overnight readings to give you insights into your health. So far it tells me everything is in range. The readings, however, start appearing only after you wear the watch to sleep for at least four-five days, one of the reasons this review took longer than anticipated. The polished titanium feel makes it stylish, especially with the blacks. You can use some of the ne",
    "description2": "w watch faces to make people notice your new investment. With WatchOS photos can be converted into watch faces via the phone too. I like this feature as you get the reassurance of family every once in a while during the day. However, I wonder if this taking the personal too public; but then we put family pics on the larger phone lock screen as well. Another aspect I found effective was the fast charging on the Apple Watch Series 10. My old charging dock by the bed has been giving me issues of late and I have come to realise that when I pick up the watch for use just before leaving for office, it is usually short of charge. Now, in the office, I put it on the Daily Objects Surge Max dock for a few minutes and get enough juice to last the rest of the day. This is a sea change from the time it took hours to charge the Apple Watch. For my regular use of the Apple Watch, to track my daily quota of 10000 steps, regular heart rate checks, and mapping with my insurance and health apps, the Series 10 does well. The new Vitals app is an added layer here and will keep tab even when I’m sleeping. For the past couple of weeks, I have been using the Series 10 for my daily usage, and I am more than happy with the performance and battery life, compared to the earlier Series 9. However, unless you are on versions before the Series 8, it will not make much sense to upgrade to this one as the changes will not be that discernible. For users of older Apple Watches, this is an upgrade at many levels from performance to screen size and battery life. At Rs 46,900, the best smartwatch has become better, though the upgrade this time makes more sense for those who have held on to the upgrade for longer.",
    "image": "https://images.indianexpress.com/2024/10/apple-watch-series-10-review.jpg",
    "image1": "https://images.indianexpress.com/2013/12/nandagopal-rajan.jpg",
    "date": "13/10/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-10-13T17:00:20+05:30",
    "dateModified": "2024-10-13T17:00:20+05:30"
  },
  {
    "title": "Is your Garmin watch glitching? You are not alone",
    "link": "https://worldsnews24.vercel.app/tech/is-your-garmin-watch-glitching-you-are-not-alone",
    "siteurl": "https://worldsnews24.vercel.app/tech/is-your-garmin-watch-glitching-you-are-not-alone",
    "description": "Garmin has acknowledged the issue in its smartwatches and is currently said to be investigating it.",
    "thumbnail": "https://images.indianexpress.com/2024/12/garmin.jpg",
    "description1": "Several users of Garmin smartwatches have said their devices are experiencing a fault which is causing them to crash. And in some cases, they have said the unknown bug is rendering the smartwatch unresponsive, where it simply displays \"IQ!\". This is why our watch faces keep crashing byu/exalted_muse_bush inGarmin  While the exact cause of the glitch is yet to be known, Garmin has acknowledged the issue and is currently said to be investigating and is likely to issue a software update to patch the bug. According to a post on the Garmin Forum, some users have witnessed as many as 400,000 crashes in one app since August, and it is currently affecting mode",
    "description2": "ls including Venu 3, FR965, and FR265. Initially, it was considered to have affected only limited users, however, it has turned out to be a widespread issue, affecting thousands of Garmin watch users across the world. Reports have said the latest software update is behind the glitch with a faulty line of code causing storage errors and system crashes. For now, users can restart their Garmin watch whenever it crashes. If you are a Garmin watch user, then it is best to wait for an update, which should patch the bug. If you are on a previous build, do not install the update, and also keep an eye on the changelog while installing the newest software build.",
    "image": "https://images.indianexpress.com/2024/12/garmin.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "The Indian Express",
    "datePublished": "2024-12-02T12:02:32+05:30",
    "dateModified": "2024-12-02T12:02:32+05:30"
  },
  {
    "title": "Google launches Gemini AI app for iOS",
    "link": "https://worldsnews24.vercel.app/tech/google-launches-gemini-ai-app-for-ios",
    "siteurl": "https://worldsnews24.vercel.app/tech/google-launches-gemini-ai-app-for-ios",
    "description": "Google launches Gemini AI app for iOS",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241115100054.jpg",
    "description1": "\n\n\nWashington [US], November 15 (ANI): Google's highly anticipated Gemini app has officially launched on iOS, bringing the tech giant's advanced AI assistant to iPhone users.\nThe app combines voice, text, and camera inputs for a highly versatile experience, according to GSM Arena.\n\nIn an exciting development for iOS users, Google has launched its Gemini app, a versatile AI assistant that expands the functionality of its existing Gemini platform.\nAvailable now on the Apple App Store, the app allows users to interact with Google's AI via voice, text, or even the iPhone's camera, providing a more engaging and dynamic way to access information and assistance.\nThe new Gemini app offers users the same core features found in the Gemini section of the Google app, including advanced AI-powered searches and conversational capabilities.\nHowever, one standout feature is the introduction of 'Gemini Live', a real-time voice chat experience with Google's AI assistant.\nThis feature aims to deliver an even more natural and fluid interaction with the assistant, elevating the user experience with live voice-based communication, as per GSM Arena.\nAdditionally, the app is designed to integrate seamlessly with Google's suite of services. While it doesn't have control over iPhone settings or third-party apps like Apple's own Siri or other competitors' AI systems, Gemini can access and interact with various Google apps such as Maps, Gmail, Drive, and YouTube.\nThis ensures that users can quickly retrieve information and perform tasks like checking emails, finding locations, or managing fil",
    "description2": "es directly through the AI assistant, as per GSM Arena.\n\n\nFor users of the latest iPhone models, including the iPhone 15 Pro and iPhone 16 series, the Gemini app comes with an additional convenience: direct integration with the iPhone's 'Action Button'.\nThis allows users to quickly activate the Gemini app for instant searches, conversations, or AI-driven tasks directly from the physical button, making it easier to access Google's AI when needed most.\nWhile the Gemini app is packed with impressive features, it does have some limitations.\nAs with other AI assistants on iOS, such as Siri or Amazon's Alexa, Google Gemini cannot control system settings or third-party apps installed on the iPhone.\nAs per GSM Arena, this restriction is due to Apple's privacy and security policies, which limit external apps from modifying system-wide settings.\nDespite this limitation, the Gemini app's ability to interact with Google's ecosystem of apps and services gives it a distinct advantage for users heavily invested in Google's suite of productivity tools.\nWith the launch of the Gemini app on iOS, Google is positioning itself as a strong contender in the AI assistant space for Apple users.\nThe app's ability to perform intelligent searches, facilitate live voice conversations, and seamlessly integrate with Google's services makes it a compelling tool for anyone looking to enhance their productivity or simply explore the possibilities of conversational AI.\nAs Google continues to refine its AI capabilities, iPhone users can expect even more sophisticated features in future updates. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241115100054.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:19 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:19 IST"
  },
  {
    "title": "Sonnalli Seygall shares heartwarming post revealing newborn daughter's name",
    "link": "https://worldsnews24.vercel.app/tech/sonnalli-seygall-shares-heartwarming-post-revealing-newborn-daughter-s-name",
    "siteurl": "https://worldsnews24.vercel.app/tech/sonnalli-seygall-shares-heartwarming-post-revealing-newborn-daughter-s-name",
    "description": "Sonnalli Seygall shares heartwarming post revealing newborn daughter's name",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202073758.jpg",
    "description1": "\n\n\nMumbai (Maharashtra) [India], December 2 (ANI): Bollywood actress Sonnalli Seygall and her husband, Ashesh L Sajnani, have announced the name of their newborn daughter, revealing her to the world as \"Shukar.\"\nThe couple, who tied the knot in 2023, welcomed their first child, a baby girl, on 27 November 2024, Wednesday, and have shared their joy and gratitude through heartfelt posts on social media.\n\nSonnalli, widely recognized for her role in the 2011 hit film 'Pyaar Ka Punchnama', took to Instagram to introduce her daughter.\nIn her post, she expressed her overwhelming emotions and described the name Shukar as a reflection of the gratitude they feel in their lives.\n\n \n \n \n \n \nView this post on Instagram\n \n \n \n \n \n \n \n \n \n \n \n\nA post shared by Sonnalli A Sajnani (@sonnalliseygall)\n\n\nShe wrote, \"Introducing our beautiful daughter, Shukar--a name that embodies the gratitude we've carried in our hearts throughout our lives. She is our little miracle, a living testament to the abundance of love, joy, and blessings that surround us. May she grow to always recognize the beauty in each moment and live a life filled with thankfulness, just as she has been a blessing beyond words to us. Welcome to the world, our Shukar-our miracle of abundance.\"\nEarlier, Ashesh also shared a memorable video on social media, showing him joyfully dancing in the delivery room after the arrival of",
    "description2": " their baby girl. The caption read, \"Our baby is here,\" further sharing their excitement with fans.\nIn August of this year, the couple announced their pregnancy through a series of playful and heartwarming photos.\nSonnalli shared pictures of herself showing off her baby bump, enjoying chips and chocolates, while Ashesh was seen holding a beer bottle in one hand and a baby milk sipper in the other.\nTheir pet dog also made a special appearance in the images. Sonnalli captioned the post, \"From beer bottles to baby bottles... Ashesh's life is about to change! As for me, some things stay the same. Was eating for 1... now eating for 2! Meanwhile, Shamsher is taking notes on how to be a good big brother. Overjoyed & Grateful. Keep us in your prayers. December 2024. Baby coming.\"\n\n \n \n \n \n \nView this post on Instagram\n \n \n \n \n \n \n \n \n \n \n \n\nA post shared by Sonnalli A Sajnani (@sonnalliseygall)\n\n\nThe couple, who celebrated their first wedding anniversary in July, have also shared their wedding moments.\nSonnalli posted pictures from their beautiful ceremony held in June 2023 at a Gurdwara in Santa Cruz, Mumbai.\nSonnalli's career began with 'Pyaar Ka Punchnama', where she rose to fame. She went on to appear in films such as 'High Jack', 'Ishq Da Rog', and 'Jai Mummy Di'. Before entering Bollywood, she was a ramp model and participated in the Miss India Worldwide competition. (ANI)",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202073758.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:19 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:19 IST"
  },
  {
    "title": "A Giant Leap for Pet Care in Jaipur- DCC Animal Hospital Launches Advanced Facility in the Pink City",
    "link": "https://worldsnews24.vercel.app/tech/a-giant-leap-for-pet-care-in-jaipur-dcc-animal-hospital-launches-advanced-facility-in-the-pink-city",
    "siteurl": "https://worldsnews24.vercel.app/tech/a-giant-leap-for-pet-care-in-jaipur-dcc-animal-hospital-launches-advanced-facility-in-the-pink-city",
    "description": "A Giant Leap for Pet Care in Jaipur- DCC Animal Hospital Launches Advanced Facility in the Pink City",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202070627.jpg",
    "description1": "\n\n\nPNN\nJaipur (Rajasthan) [India], December 2: DCC Animal Hospital, a globally renowned chain of veterinary facilities, has launched its first cutting-edge veterinary hospital in Jaipur on December 1. Adhering to global Japanese standards, this state-of-the-art facility marks a transformative step in pet care for the Pink City. Strategically located in the basement of the IDB Building, FS-6, Gayatri Nagar, Maharani Farm, Durgapura, the hospital is equipped with the latest advancements in pet healthcare technology. Through this launch, DCC is ushering Jaipur into a new era of premium and advanced veterinary services.\n\nDCC Animal Hospital is a leading global veterinary chain dedicated to enhancing pet healthcare through preventative care, advanced surgical services, and knowledge-driven pet parenting. Committed to making good health accessible to all animals, DCC Animal Hospital goes beyond traditional veterinary care, embracing wellness and lifestyle solutions for a better future.\nChampioning a shift from a problem-solving mindset, DCC Animal Hospital focuses on in-depth diagnosis and professional medical care for pets, mirroring the quality of care humans receive. More than just a pet-friendly chain, DCC Animal Hospital provides a holistic ecosystem for pets, empowering pet parents with education and resources to prioritize knowledge over fear.\nGuided by its transformative vision of \"pet to partner,\" DCC Animal Hospital strives to redefine pet care, raising awareness and fostering compassion for animal well-being in India and beyond.\n\n\nDr. Vinod Sharma, Head Veterinarian, DCC Animal Hospital & Director, highlighted the strategic decision to expand into Jaipur, noting tha",
    "description2": "t while the city has a growing population of pet owners, there is a significant lack of high-quality facilities and educational resources. \"Jaipur has a massive untapped potential, where pet owners are eager for more options but are limited by the quality of services,\" he said. \"We've researched deeply into the market, and what we found was a need for better preventive care, hygiene, and knowledge on pet healthcare. DCC Animal Hospital is here to bridge that gap.\"\nThe DCC Animal Hospital aims to create a compassionate, pet-friendly ecosystem by offering services that include preventive care, vaccination education, surgical awareness, and high hygiene standards. Additionally, it will focus on educating pet owners about essential services and spreading awareness of pet healthcare and their requirements.\nDCC Animal Hospital brings world-class veterinary services to Jaipur and strives to connect with the community by way of workshops, awareness drives, and partnerships with local pet welfare organizations. DCC Animal Hospital hopes to create a more significant bond between pets, their owners, and veterinary experts.\nFor more information, kindly visit the website https://dccpets.in/\nAbout DCC Animal Hospital:\nDCC Animal Hospital, A'alda Group is a Japan-based, leading global veterinary chain of hospitals dedicated to providing high-quality and compassionate medical care to pets. With a team of experienced professionals and a commitment to excellence, the hospital strives to ensure the health and well-being of every animal in its care.\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by PNN. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202070627.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:19 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:19 IST"
  },
  {
    "title": "Galgotias University hosts landmark Supercharge '24, Powered by Apple",
    "link": "https://worldsnews24.vercel.app/tech/galgotias-university-hosts-landmark-supercharge-24-powered-by-apple",
    "siteurl": "https://worldsnews24.vercel.app/tech/galgotias-university-hosts-landmark-supercharge-24-powered-by-apple",
    "description": "Galgotias University hosts landmark Supercharge '24, Powered by Apple",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202062854.jpg",
    "description1": "\n\n\nVMPL\nNew Delhi [India], December 2: Galgotias University, reaffirming its commitment to fostering a student-centric learning environment, recently hosted a two-day event Supercharge' 24 powered by Apple. The event aimed to inspire and empower the next generation of innovators by providing students with unparalleled exposure to global app development trends, insights, and success stories. The event featured prominent app developers who shared their journey, passion for app development, and the transformative role technology played in bringing their ideas to life. Through engaging sessions, workshops, and interactive Q&A discussions, students had the unique opportunity to learn firsthand about the challenges and triumphs of these innovators.\n\nA harmonious blend of creativity and technology drives truly inspiring innovation.The theme found resonance all through the multitude of sessions at the event. Sandeep Ranade, Founder of Apple Design Award winning app NaadSadhana, while sharing his experience attributed the passion behind the creation of the app to his personal need to beat the time crunch from a busy IT career and practicing Hindustani classical music, gaining easier access to an orchestra with a mobile app with intelligent jugalbandis created dynamically in real time.\nIndie developer, Mustafa Yusuf - founder of productivity apps such as Tasks and Karo, emphasised that small problems can provide unconventional channels to manifest one's knowledge and skills to big ideas and bigger solutions. He believes that today's students are rightly positioned to leverage the opportunities that have been made available through program such as iOS Student Developer Program powered by Apple and Infosys at the Galogotias University and events like Supercharge' 24 to find their passion and translate them to successful apps that empower users. His app Karo received an honourable mention as the top featured app on the App Store, inspiring students to find their own such gateways to success.\n\n\nSpotlighting best practices of combining design and technology to create apps that touch people's emotions and bring focus on how the interfaces makes users feel and operate the app, conversations with innovators revolved around th",
    "description2": "emes that can help apps achieve higher levels of usability and translate them to great apps. A key theme that resonated with all students was on inclusivity allowing the apps to be accessed beyond the barriers of language, disabilities, locations, culture etc. The wide array of Apple products that enable users to unlock their potential and translate ideas to reality were highlighted throughout the two day workshop.\nFor students at Galgotias University, the experience was nothing short of transformative with many feeling motivated and equipped with fresh perspectives on leveraging technology to address real-world challenges. The event not only deepened their understanding of the app development process but also highlighted the importance of creativity, resilience, and adaptability in a rapidly evolving landscape. Reflecting on the event, one student shared, \"hearing the stories of these developers was incredibly inspiring. It gives me the confidence to pursue my own ideas and a deeper understanding of how technology can create meaningful impact. This event has truly changed the way I view my future in app development.\nThe impact of this event is profound and it aligns with Galgotias University's mission to nurture future-ready graduates by bridging the gap between academia and industry. By bringing global expertise directly to its students, the university is setting a benchmark for innovative, experiential learning. Dr. Dhruv Galgotia, CEO of the Galgotias University, says \"the University is extremely delighted at receiving the invaluable support from Apple in the establishment of the iOS Development Center. The center provides the students with a unique advantage to develop technical and problem solving skills that will serve them well in their careers. This event reflects Galgotias University's continued commitment to offering world-class educational experiences.\"\nSince its founding in 2011, Galgotias University has been at the forefront of providing quality education and global exposure, preparing students for careers in a rapidly changing technological landscape.\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by VMPL. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202062854.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:19 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:19 IST"
  },
  {
    "title": "UrbanBed Unveils the Smartest Way to Upgrade Sleep Experiences",
    "link": "https://worldsnews24.vercel.app/tech/urbanbed-unveils-the-smartest-way-to-upgrade-sleep-experiences",
    "siteurl": "https://worldsnews24.vercel.app/tech/urbanbed-unveils-the-smartest-way-to-upgrade-sleep-experiences",
    "description": "UrbanBed Unveils the Smartest Way to Upgrade Sleep Experiences",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202060731.jpg",
    "description1": "\n\n\nSMPL\nNew Delhi [India], December 2: Sinking into a comfy mattress after a long, tiring day at work is a feeling of pure bliss. A truly comfortable bed isn't just about sleep - it's about that moment when tension dissolves and every muscle sighs in relief. However, this blissfulness tends to fade over time as mattresses grow weary. What happens when that perfect moment becomes increasingly elusive, and your mattress no longer cradles you to sleep but rather fights against you?\n\nThe tossing and turning. The constant readjusting. The morning aches that make one wonder if they slept at all. A bed that was once a sanctuary of comfort now feels more like a nightly compromise. For many, the solution seems to be tossing out the old mattress and investing in an expensive new one. However, there is a smarter way to reclaim that feeling of blissful comfort.\nWhat if it were possible to transform an existing mattress into the sleep sanctuary it once was, without the hefty price tag or logistical headaches? Modern sleep technology isn't about replacing the bed - it's about elevating it. More often than not, sleep discomfort can be solved without replacing an entire mattress.\nInvesting in a high-quality mattress topper not only alleviates pain and discomfort but also extends the lifespan of an existing mattress by an average of 3-5 years, at a fraction of the cost of a new mattress. Unlike replacing an entire mattress, adding a topper is a remarkably straightforward process. There's no complicated delivery or disposal to manage. Today's toppers are easily secure to the existing mattress with elastic straps, and their washable covers make maintenance effortless.\nThe evolution of sleep technology has led to remarkable innovations in mattress toppers. Memory foam that adapts to the body's unique contours, cooling gel that regulates temperature throughout the night, and specialized materials that provide targeted support - these advances have transformed simple comfort layers into sleep-enhancing solutions.\nUrbanBed's Cool Gel Memory Foam Mattress Topper combines the best of these innovations. At its core is a specialized memory foam infused",
    "description2": " with cooling gel technology, designed to provide the perfect balance of support and temperature regulation. The foam responds intelligently to the body's pressure points, while the cooling gel maintains an optimal sleeping temperature throughout the night.\n\n\nThe topper's design prioritizes more than just comfort. Its Antibacterial UltraFresh treated cover ensures a hygienic sleep environment, night after night. The anti-skid base, combined with adjustable elastic straps, keeps the topper securely in place, eliminating the frustration of shifting or bunching that often occurs with other alternatives.\nWhat truly sets this topper apart is its adaptability to different sleeping styles. Whether one sleeps on their back, side, or tends to shift positions throughout the night, the memory foam's responsive nature ensures consistent support. The German-engineered three-zone technology provides targeted firmness for different parts of the body, supporting the shoulders differently from the lower back and the hips differently from the legs.\nUrbanBed's mattress topper also comes with a 30-night trial period and a 5-year warranty, offering ample time to experience its benefits while ensuring long-term investment in better sleep. As sleep comfort priorities evolve, shifting towards wellness and mindful spending, a mattress topper is not just an addition to the bed - it is a practical choice delivering premium comfort without the hefty price tag.\nUrbanBed's innovative approach to sleep technology demonstrates how far the industry has come, from simple comfort layers to sophisticated sleep solutions that can truly transform one's nights. In a world where quality sleep is becoming increasingly precious, it's reassuring to know that better rest doesn't always require a complete overhaul - sometimes, it's about making smarter, more informed choices.\nFor more information please visit : https://urbanbed.in/products/memory-foam-mattress-topper\n[This article was written with inputs from Tejaswini Mittal ]\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by SMPL. ANI will not be responsible in any way for the content of the same)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241202060731.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:19 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:19 IST"
  },
  {
    "title": "YouTube tests AI-powered music remixes",
    "link": "https://worldsnews24.vercel.app/tech/youtube-tests-ai-powered-music-remixes",
    "siteurl": "https://worldsnews24.vercel.app/tech/youtube-tests-ai-powered-music-remixes",
    "description": "YouTube tests AI-powered music remixes",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241113103020.jpg",
    "description1": "\n\n\nWashington [US], November 13 (ANI): YouTube is exploring the future of music remixing with a new AI-driven feature, allowing creators to \"restyle\" licensed songs for their Shorts.\nThe company has launched a limited trial of this feature, named 'Dream Track', which enables creators to use artificial intelligence to customize various elements of a song, including its mood, genre, and tempo, as per The Verge.\n\nOnce the user enters a prompt to guide the restyling, the AI generates a unique 30-second remix that can be used in YouTube Shorts.\nThe feature is currently being tested by a small group of creators, with access granted to those invited to participate in the experiment.\nTo use 'Dream Track', creators can select an eligible song, describe how they want to transform it, and then let the AI produce the reworked track.\nThe remixed soundtracks will be labelled with clear attribution to the original song and will also include a note that the track was altered using AI.\nYouTube has emphasized that the 'Dream Track' experiment will only feature music from artists who have consented to have their voices used by the AI.\n\n\nSome of the participating artists include Charlie Puth, Charli XCX, Demi Lovato, and J",
    "description2": "ohn Legend.\nHowever, at this stage, it remains unclear which specific songs are available to remix and which music labels YouTube is working with to facilitate the project.\nThe new feature is part of YouTube's broader effort to bring more creative tools to its platform, especially for creators who make Shorts--a format that has seen tremendous growth in recent years, as per The Verge.\nBy leveraging AI, YouTube aims to offer users a greater degree of flexibility in how they engage with music, enabling them to generate personalized soundtracks that align with their creative visions.\nReports from June, obtained by The Verge, also suggested that YouTube had been in talks with major music labels to obtain permission to use their songs for AI training purposes.\nThis move could potentially pave the way for a larger-scale rollout of AI-powered music customization tools, which would further revolutionize how users interact with music on the platform.\nWhile still in the experimental phase, 'Dream Track' offers a glimpse into the future of AI-assisted music creation, where creators can seamlessly blend original works with innovative new twists, giving rise to an entirely new genre of user-generated content. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241113103020.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:19 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:19 IST"
  },
  {
    "title": "Google Photos launches new \"updates\" page to track activity in shared albums",
    "link": "https://worldsnews24.vercel.app/tech/google-photos-launches-new-updates-page-to-track-activity-in-shared-albums",
    "siteurl": "https://worldsnews24.vercel.app/tech/google-photos-launches-new-updates-page-to-track-activity-in-shared-albums",
    "description": "Google Photos launches new \"updates\" page to track activity in shared albums",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241108102411.jpg",
    "description1": "\n\n\nWashington [US], November 8 (ANI): photos\">Google Photos is rolling out a new feature aimed at enhancing how users track and engage with changes in their shared albums.\nThe new 'Updates' section, which is currently being introduced on both Android and iOS, will allow users to easily stay on top of activity in shared albums and conversations, ensuring a more organised and seamless experience, according to The Verge.\n\nThe 'Updates' section replaces the old sharing button, which previously allowed users to share albums with others.\nNow, according to The Verge, users will see a bell icon that directs them to a feed of recent notifications.\nAccording to Google, this feature is designed to help users better follow updates to shared albums, comments, and group conversations within the photos\">Google Photos app.\nThe 'Updates' page organises activity chronologically, allowing users to filter events by time periods such as \"today,\" \"yesterday,\" \"this week,\" \"this month,\" or \"last month.\"\nThis timeline will provide clear, easy-to-read notifications about any new changes or actions taken within shared albums and conversations, as per The Verge.\n\n\nA Google support post mentions, \"We want to ",
    "description2": "streamline how you can view recent activity with an interface that makes albums, groups, and conversations more accessible.\"\nThis addition is designed to offer greater transparency and control, especially when dealing with multiple people collaborating on albums or group chats within photos\">Google Photos.\nIn addition to the 'Updates' section, users will now be able to access their shared albums directly from the newly launched 'Collections' section.\nThis provides a central location for managing all albums, both personal and shared, making it easier to navigate through photos and collaborations with friends, family, or colleagues.\nWhile the feature is rolling out now, availability might vary by region and device.\nIf you don't see the 'Updates' section yet, the Photos team advises users to check back \"over the coming weeks\" as the feature continues to expand.\n|According to The Verge, the 'Updates' section is currently available on both the Android and iOS photos\">Google Photos apps, but some users may not have it just yet.\nAs is typical with phased rollouts, not all users will receive the feature immediately, though it should become more widely accessible in the coming weeks. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241108102411.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "Google Maps to introduce lane guidance for improved navigation",
    "link": "https://worldsnews24.vercel.app/tech/google-maps-to-introduce-lane-guidance-for-improved-navigation",
    "siteurl": "https://worldsnews24.vercel.app/tech/google-maps-to-introduce-lane-guidance-for-improved-navigation",
    "description": "Google Maps to introduce lane guidance for improved navigation",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241104103458.jpg",
    "description1": "\n\n\nWashington [US], November 4 (ANI): In a significant update aimed at improving urban driving experiences, Google Maps is set to introduce enhanced navigation features starting next month.\nThis upgrade will visually indicate the correct lane for upcoming turns, alongside displaying essential elements such as crosswalks, traffic signs, and lane restrictions, according to The Verge.\n\nBeginning in November, users in 30 metropolitan areas across the United States will benefit from this innovative feature on both Android and iOS platforms.\nThe enhanced navigation is designed to ease the stress of driving in unfamiliar settings, adding to existing tools like lane guidance and 3D route visualization.\nIn conjunction with these updates, Google Maps is also enhancing its \"destination guidance\" functionality.\nThis week, users will see improvements that highlight their destination, identify building entrances, and provide information about nearby parking lots.\n\n\nAdditionally, the app will now include reminders for parking locations and offer walking ",
    "description2": "directions to the entrances of buildings, according to The Verge.\nTo further support drivers, Google Maps is expanding its reporting capabilities to include adverse weather conditions.\nThis new feature will alert users to potential hazards such as low visibility, fog, snow, unplowed roads, and flooding, ensuring safer travel during inclement weather.\nBeyond these navigation enhancements, Google is integrating more artificial intelligence features into the app to assist users in discovering new places.\nMeanwhile, Waze, a Google-owned navigation service, is experimenting with voice-activated incident reporting to improve real-time updates for drivers, according to The Verge.\nRecent months have seen a wave of significant changes to Google Maps, including the use of AI to summarize reviews for electric vehicle chargers and to provide tailored recommendations for dining and attractions.\nAs Google continues to refine and expand its mapping services, users can expect a more intuitive and informative navigation experience in the near future. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241104103458.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "Google expands split-screen Gemini functionality to more devices",
    "link": "https://worldsnews24.vercel.app/tech/google-expands-split-screen-gemini-functionality-to-more-devices",
    "siteurl": "https://worldsnews24.vercel.app/tech/google-expands-split-screen-gemini-functionality-to-more-devices",
    "description": "Google expands split-screen Gemini functionality to more devices",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241031143001.jpg",
    "description1": "\n\n\nWashington [US], October 31 (ANI): Google has announced the expansion of its Gemini AI assistant, enabling split-screen functionality on a wider range of devices, including various Samsung Galaxy and Google Pixel tablets and foldable phones.\nInitially introduced with the Galaxy Z Fold6 and its One UI 6.1.1, this feature allowed Gemini to operate in a split-screen mode exclusively on that device, according to GSM Arena.\n\nHowever, Google has now broadened access to this innovative capability across multiple large-screen Android devices.\n\n\nReports obtained by GSM Arena indicate that the Gemini AI can now be utilized in a floating window on older ",
    "description2": "Galaxy Z Fold models, as well as on Galaxy Tab tablets and Google Pixel Tablets.\nThis feature enhances multitasking by allowing users to interact with the AI while simultaneously viewing content on the main screen.\nThe split-screen option provides users with a handlebar to reposition the Gemini window anywhere on the screen.\nThis flexible design enables users to ask Gemini questions related to the content displayed in the background.\nOne of the standout functions of this AI assistant is its ability to research topics presented in videos or text located in another part of the screen, significantly improving user productivity and engagement. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241031143001.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "Apple Intelligence features set for EU launch: Timeline and key details",
    "link": "https://worldsnews24.vercel.app/tech/apple-intelligence-features-set-for-eu-launch-timeline-and-key-details",
    "siteurl": "https://worldsnews24.vercel.app/tech/apple-intelligence-features-set-for-eu-launch-timeline-and-key-details",
    "description": "Apple Intelligence features set for EU launch: Timeline and key details",
    "thumbnail": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241029094635.jpg",
    "description1": "\n\n\nWashington [US], October 29 (ANI): Apple has officially rolled out iOS 18.1, iPadOS 18.1, and macOS Sequoia 15.1, marking the debut of its much-anticipated Apple Intelligence features. However, while users in various regions can access these enhancements, EU consumers will have to wait a little longer!\nCurrently, Apple indicates that the new features are available \"in most regions around the world,\" provided that the device settings are configured for US English, according to GSM Arena.\n\nNotably, users in the European Union are excluded from accessing Apple Intelligence on iOS and iPadOS devices for the time being.\nHowever, Mac users in the EU can enjoy these functionalities with macOS Sequoia 15.1, also set to US English.",
    "description2": "\n\n\nAccording to Apple, iPhone and iPad users in the EU can expect to gain access to Apple Intelligence by April 2024.\nThe rollout will encompass many core functions, including innovative Writing Tools, Genmoji, a redesigned Siri with enhanced language understanding, and integration with ChatGPT, among other features.\nWhile the exact details of the functionalities remain under wraps, the anticipated launch marks a significant step for Apple in the European market.\nThe company is exercising caution in this rollout, especially considering strict regulations like the Digital Markets Act (DMA), as per GSM Arena.\nApple aims to comply with these regulations while navigating criticism from EU officials regarding its practices. (ANI)\n",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20241029094635.jpg",
    "image1": "",
    "date": "4/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "ANI News",
    "datePublished": "MON, DEC 02, 2024 |UPDATED 14:20 IST",
    "dateModified": "MON, DEC 02, 2024 |UPDATED 14:20 IST"
  },
  {
    "title": "WhatsApp will stop working on these older iPhone models",
    "link": "https://worldsnews24.vercel.app/tech/whatsapp-will-stop-working-on-these-older-iphone-models",
    "siteurl": "https://worldsnews24.vercel.app/tech/whatsapp-will-stop-working-on-these-older-iphone-models",
    "description": "WhatsApp will stop working on these older iPhone models",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115893521/115893521.jpg",
    "description1": "WhatsApp will soon end support for older iPhone models, a report has said. Starting May 5, 2025, the messaging app will require iOS 15.1 or later to function which means users of older iPhones, which cannot update beyond iOS 12.5.7, will need to upgrade their devices or switch to a newer model to continue using WhatsApp.Which iPhones will be affectedAccording to a report by WAbetainfo, this change will only affect users with iPhones that are unable to update to the required iOS version. Those using newer iPhones or those who have already updated to iOS 15.1 or later will not be affected.“Currently, WhatsApp supports iOS 12 and later, but with a future update, the app will require iOS 15.1 or newer to work properly. To help affected users adapt to this change, WhatsApp is providing a five-month notice period, giving them ample time to update their devices if possible or consider alternatives if their hardware does not support newer iOS versions,” the report said.Which iPhones are affected The report says that a bunch of iPhones, specifically the iPhone 5s, iPhone 6, and iPhone 6 Plus, will be affected by the change. &mdash; WABetaInfo (@WABetaInfo) These iPhones were launched over 10 ye",
    "description2": "ars ago, so the number of users still running WhatsApp on these models is expected to be minimal. For users with newer iPhone models, those running an iOS version below 15.1 can update to the latest iOS release by opening iPhone Settings &gt; General &gt; Software Update. Why WhatsApp is bringing this changeWABetainfo says that WhatsApp's decision to end support for older iPhones is driven by the need to leverage the latest advancements in iOS. Newer iOS versions offer updated APIs and enhanced technologies that are essential for WhatsApp to develop and implement new features. By discontinuing support for older versions, WhatsApp can optimise its app and introduce innovative functionalities that would be incompatible with outdated operating systems.“Additionally, it's easy to assume that WhatsApp has closely monitored the number of users still running older versions of iOS. Data may indicate that a significantly smaller portion of users relies on these outdated systems. WhatsApp can ensure that it provides a better overall experience to the majority of its users by focusing on newer iOS versions, while minimizing the impact on those who continue to use older devices,” the report added.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115893521/115893521.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "TOI Tech Desk",
    "datePublished": "2024-12-02T13:48:00+05:30",
    "dateModified": "2024-12-02T13:48:00+05:30"
  },
  {
    "title": "Tomarket secret daily combo for December 1: How to unlock combo and more",
    "link": "https://worldsnews24.vercel.app/tech/tomarket-secret-daily-combo-for-december-1-how-to-unlock-combo-and-more",
    "siteurl": "https://worldsnews24.vercel.app/tech/tomarket-secret-daily-combo-for-december-1-how-to-unlock-combo-and-more",
    "description": "Tomarket secret daily combo for December 1: How to unlock combo and more",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892798/115892798.jpg",
    "description1": "Tomarket’s Secret Daily Combo: Solve Puzzles, Earn Big Rewards! Dive into the excitement with Tomarket’s Secret Daily Combo! This daily feature challenges you with fresh puzzles, offering exclusive rewards to enrich your gaming experience. Solve these engaging puzzles to earn tokens, rare items, and unique perks, all delivered straight to your Tomarket wallet. Participation is simple—just follow the bot’s prompts, arrange items in the correct sequence, and claim your prizes. Powered by the TON blockchain and available via Telegram, Tomarket blends gaming, earning, and trading for a fun and dynamic adventure.What is Tomarket's Secret Daily Combo Feature?The Secret Daily Combo is a one-of-a-kind daily puzzle that tests your problem-solving skills while rewarding you with exciting prizes. Successfully completing the puzzle lets you earn tokens, rare collectibles, and special platform benefits. Getting started is easy—just follow the bot’s instructions and solve the puzzle. It’s a delightful way to elevate your Tomarket journey!",
    "description2": "Tomarket Daily Combo for December 1Tomarket secret daily combo for today (December 1) is:115892840How to Unlock the Tomarket Daily ComboTo unlock the Tomarket daily combo, follow these steps:Open the Telegram app and navigate to the \"Tasks\" menu at the bottom of your screen.From the daily tasks section, select a combo card marked with a question mark.Arrange the three tomato heads in the correct sequence to solve the puzzle and unlock your rewards!Pro Tip: Before solving the combo, visit the Limited Tasks tab and watch the Tomarket YouTube video. Once done, claim your bonus reward, then head back to take on the daily combo for extra perks!How to Play TomarketLink Your Wallet: Connect your TON wallet to easily manage funds and unlock full access to platform features.Explore the Game World: Immerse yourself in Tomarket’s exciting games and start earning tokens.Trade Tokens Seamlessly: Effortlessly buy, sell, or trade tokens with other users.Claim Your Rewards: Collect tokens and enjoy exclusive perks to elevate your experience!",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892798/115892798.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "TOI Tech Desk",
    "datePublished": "2024-12-02T13:22:00+05:30",
    "dateModified": "2024-12-02T13:22:00+05:30"
  },
  {
    "title": "Coin Master free spins and coins for December 1, 2024: Earn millions of coins using today’s link",
    "link": "https://worldsnews24.vercel.app/tech/coin-master-free-spins-and-coins-for-december-1-2024-earn-millions-of-coins-using-today-s-link",
    "siteurl": "https://worldsnews24.vercel.app/tech/coin-master-free-spins-and-coins-for-december-1-2024-earn-millions-of-coins-using-today-s-link",
    "description": "Coin Master free spins and coins for December 1, 2024: Earn millions of coins using today’s link",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892462/115892462.jpg",
    "description1": "Are you an avid Coin Master player eager to collect free spins and coins? You’re in the right place! We’ve compiled the latest links to help you boost your coin stash and enhance your village-building journey. Don’t miss this opportunity to climb the leaderboard and become the ultimate Coin Master champion. Check back daily for updated links and enjoy the excitement of free spins! Developed by Moon Active, Coin Master combines slot-machine gameplay with strategic village-building and competitive player raids, making it a favorite among Android and iOS users worldwide.Key features of the gameSpin the Slots: Try your luck on the slot machine to earn coins, the essential currency in Coin Master.Build Your Village: Invest your coins to upgrade and expand your village with improved structures, vibrant decorations, and stronger defenses.Raids and Defense: Raid other players’ villages to collect coins and resources, while fortifying your own to safeguard against attacks.Special Events and Challenges: Join thrilling events like card collections and bonus spin challenges to earn exclusive rewards and perks.Social Features: Connect with friends, participate in leagues, and compete in tournaments for a dynamic and competitive gameplay experience.How to get free spins in Coin MasterThere are several ways to get free s",
    "description2": "pins in Coin Master:Daily Login: Log in daily to collect free spins, with bigger rewards for streaks of consistent activity.Spin Events: Participate in special events to earn bonus spins by completing tasks or hitting milestones.Village Upgrades: Level up your village to unlock additional spins and accelerate your progress.Connect with Friends: Link your Facebook account to exchange spins and gifts with friends.Watch Videos: Earn extra spins effortlessly by watching in-game ads.Complete Achievements: Unlock bonus spins and rewards by reaching in-game milestones.Spin Links: Stay updated on Coin Master’s social media pages and email notifications for free spin links.Coin Master spins for December 1, 2024https://coin-master.co/FvDkGQ - 50 spinshttps://coin-master.co/FPLYyV - 25 spinsCoin-Master.co/WYePf… - 25 spinsHow to use free spins in Coin MasterLaunch the Game: Open the Coin Master app on your device to get started.Start Spinning: Press the \"Spin\" button, and your spins will automatically be utilized.Enable Auto Spin: If you have multiple spins, activate \"Auto Spin\" to keep the slot machine spinning until all spins are exhausted.Remember: Free spins are a valuable resource in Coin Master. For the best results, consider saving them for special events or when you need an extra boost to upgrade your village.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115892462/115892462.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "TOI Tech Desk",
    "datePublished": "2024-12-02T13:12:00+05:30",
    "dateModified": "2024-12-02T13:12:00+05:30"
  },
  {
    "title": "Apple iPhone 17 Pro: Expected design, features and other details",
    "link": "https://worldsnews24.vercel.app/tech/apple-iphone-17-pro-expected-design-features-and-other-details",
    "siteurl": "https://worldsnews24.vercel.app/tech/apple-iphone-17-pro-expected-design-features-and-other-details",
    "description": "Apple iPhone 17 Pro: Expected design, features and other details",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115891919/115891919.jpg",
    "description1": "Apple iPhone 17 series launch is months away, yet the rumour mill has been buzzing with leaks around it. The series may comprise of iPhone 17 Pro which was recently tipped to offer a redesigned rear panel. The smartphone is tipped to come with an upgraded performance with a new chip and enhanced memory. Here’s a roundup of iPhone 17 Pro rumours Apple iPhone 17 Pro design (expected)According to a report by The Information, the iPhone 17 Pro may feature a redesigned rear panel composed of both aluminum and glass. The top half of the rear panel will be crafted from aluminum that will house the camera system. The camera bump is expected to be larger than the one found on the iPhone 16 Pro models.The report further added that the iPhone 17 Pro may come with an aluminium frame, replacing the titanium frame like their predecessors. A",
    "description2": "pple uses Aluminum frames in its more affordable iPhone models. If true, it will mean that all four models expected to arrive next year may be equipped with aluminium edges. Notably, the Pro models have been equipped with a frame made from stainless steel.Apple iPhone 17 Pro launch date and price (expected)The phone is likely to launch in September next year. It is expected to come with a similar price tag as the predecessor – iPhone 16 Pro.Apple iPhone 17 Pro features (expected)On the specifications part, the phone may come powered by Apple’s A19 Pro chip, manufactured using TSMC’s 3nm process. iPhone 17 Pro is said to offer 12GB of RAM, up from the iPhone 16 Pro’s 8GB. For camera duties, it may have a 48MP telephoto lens, replacing the 12MP sensor found in the iPhone 16 Pro. On the front, it is rumoured to have a 24MP sensor.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115891919/115891919.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "TOI Tech Desk",
    "datePublished": "2024-12-02T12:54:00+05:30",
    "dateModified": "2024-12-02T12:54:00+05:30"
  },
  {
    "title": "Fake websites and more: How man lost Rs 7 lakh to work from home scam",
    "link": "https://worldsnews24.vercel.app/tech/fake-websites-and-more-how-man-lost-rs-7-lakh-to-work-from-home-scam",
    "siteurl": "https://worldsnews24.vercel.app/tech/fake-websites-and-more-how-man-lost-rs-7-lakh-to-work-from-home-scam",
    "description": "Fake websites and more: How man lost Rs 7 lakh to work from home scam",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115891519/115891519.jpg",
    "description1": "A resident of Chennai has become the latest victim of a work-from-home scam, losing a significant sum of Rs 7 lakh. This incident highlights the increasing prevalence of online scams targeting individuals seeking employment opportunities.Here’s what happenedAs reported by The Hindu, the victim stumbled upon a website advertising online jobs offering high returns for writing fake positive reviews for hotels. Enticed by the prospect of easy money, he contacted the website and followed their instructions.The website then directed the victim to complete a series of tasks, which often involved transferring small amounts of money supposedly for \"registration fees\" or \"software upgrades.\" Over time, these seemingly small transactions escalated, resulting in a total loss of Rs 7 ",
    "description2": "lakh.Realising he had been duped, the victim approached the authorities and lodged a complaint. Investigations are ongoing to identify and apprehend the perpetrators behind the fraudulent website.This incident serves as a stark reminder for those seeking work online to exercise caution. Here are some red flags to watch out for:Unrealistic offers: Jobs promising high returns with minimal effort are likely scams.Upfront fees: Legitimate employers don't typically charge for applications or training.Fake websites: Always verify the legitimacy of a company before applying for a job.Safety tips for job seekersResearch companies thoroughly.Beware of unsolicited job offers.Never share personal or financial information readily.If something seems too good to be true, it probably is.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115891519/115891519.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "TOI Tech Desk",
    "datePublished": "2024-12-02T12:44:00+05:30",
    "dateModified": "2024-12-02T12:44:00+05:30"
  },
  {
    "title": "Cyber Monday Sale in India: Amazon, Vijay Sales, Ajio, Tata Cliq and other websites giving discounts",
    "link": "https://worldsnews24.vercel.app/tech/cyber-monday-sale-in-india-amazon-vijay-sales-ajio-tata-cliq-and-other-websites-giving-discounts",
    "siteurl": "https://worldsnews24.vercel.app/tech/cyber-monday-sale-in-india-amazon-vijay-sales-ajio-tata-cliq-and-other-websites-giving-discounts",
    "description": "Cyber Monday Sale in India: Amazon, Vijay Sales, Ajio, Tata Cliq and other websites giving discounts",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115889122/115889122.jpg",
    "description1": "Cyber Monday is a major online shopping event celebrated the Monday after Thanksgiving in the United States. It was created by retailers in 2005 as a way to encourage people to shop online, following the popularity of Black Friday sales. The day has grown in significance over the years, offering deep discounts across a wide range of products, from electronics to fashion, often rivaling the in-store deals of Black Friday. This year, Cyber Monday falls on December 2, 2024, providing consumers with another opportunity to grab deals before the holiday season peaks. The event has become a global phenomenon, with retailers around the world offering enticing promotions, making it one of the busiest online shopping days of the year. In India, many retailers have announced Cyber Monday sales or have extended their Black Friday offering. Here are some websites that offer Cyber Monday offers in IndiaCyber Monday offers on AmazonAmazon has not announced a separate Cyber Monday sale in India. However, its Black Friday offering will continue till today. Amazon India has announced a 10% instant discount with HDFC, IndusInd, BOB Card and HSBC bank Debit and Credit Cards and Credit EMI. Amazon Prime members will get unlimited 5% cashback on all purchases using Amazon co-branded credit cards, while non-Prime members can get 3% cashback. Cyber Monday offers on Vijay SalesAs part of its Cyber Monday offers, Vijay Sales is giving up to 70% off on electronics. For example, Sony Play Station 5 Slim is up for grabs at a discounted price of Rs 47,490. CMF Phone 1 can be purchased at a starting price of Rs 15,999. MacBook Air M1 and Asus TUF F17 on the other hand are available at Rs 70,990 and Rs 49,990, respectively. Buyers can get up to 35% off on gaming laptops. Cyber Monday offers on AjioOnline commerce platform Ajio has announced Cyber Monday sale. It is giving up",
    "description2": " to 90% off on purchases made during the sale. There is a 10% instant discount for ICICI Bank and DBS card holders. Cyber Monday offers on Reliance DigitalReliance Digital has announced up to Rs 10,000 discount for customers of ICICI Bank, IDFC Bank and One card. OLED Smart TVs are available with up to Rs 26,000 instant discount. Apple iPhone 16 is up for grabs at Rs 70,900, while iPads can be purchased at starting price of Rs 1,371 per month. Side-by-side refrigerators are selling with up to Rs 25,000 instant discount and gaming laptops can be purchased starting from Rs 46,990.Cyber Monday offers on Tata CliqTata Cliq customers can get instant discounts of 10% and 15% with ICICI Bank and RBL Bank, respectively. American Express cardholders can enjoy 10X rewards on their transactions. HDFC Bank offers up to 5% NeuCoins on every order, with each NeuCoin valued at Rs 1. Paytm users can avail themselves of cashback up to Rs 200 as well as a 10% instant discount.Cyber Monday offers on Tata NeuTata Neu’s Black Friday sale ends today. It is giving offers on smart TV 4K Ultra HD that are available at a starting price of Rs 18,990 (includes bank offers). In the smartphone category, Vivo Y28e Smartphone is selling at Rs 9,999, inclusive of all offers. Similarly, Croma Portable Bluetooth Speaker (5W) can be purchased at Rs 549, including all discounts. While Bluetooth Calling Smartwatches are available at a starting price of Rs 899.  Cyber Monday offers on CromaThe Black Friday sale on Croma is expiring soon. The retailer is giving up to 10% off with HDFC Bank and Tata Neu card. In the sale, Sony PS 5 Slim is up for grabs at Rs 33,741 (after discount), while Vivo V40 5G series phones can be purchased at Rs 31,999 onwards. Windows laptops are available from Rs 22,941 onwards. Smart TVs with 43-inch and above screens can be purchased at Rs 18,990 onwards.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115889122/115889122.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "TOI Tech Desk",
    "datePublished": "2024-12-02T11:59:00+05:30",
    "dateModified": "2024-12-02T11:59:00+05:30"
  },
  {
    "title": "Over 149,000 tech workers lost job in 2024: Intel, Tesla, Cisco, Microsoft and other biggest tech layoffs this year",
    "link": "https://worldsnews24.vercel.app/tech/over-149-000-tech-workers-lost-job-in-2024-intel-tesla-cisco-microsoft-and-other-biggest-tech-layoffs-this-year",
    "siteurl": "https://worldsnews24.vercel.app/tech/over-149-000-tech-workers-lost-job-in-2024-intel-tesla-cisco-microsoft-and-other-biggest-tech-layoffs-this-year",
    "description": "Over 149,000 tech workers lost job in 2024: Intel, Tesla, Cisco, Microsoft and other biggest tech layoffs this year",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115886453/115886453.jpg",
    "description1": "In 2024, the tech world is experiencing a massive job shakeup, with nearly 150,000 workers getting laid off across big-name companies. From Tesla to Intel, and Cisco to Microsoft, tech firms are cutting jobs at a shocking rate. These companies are slashing their workforces to save money, restructure their businesses, and adapt to changing market conditions. Intel cuts 15,000 jobs as in the toughest year in its historyIntel, facing significant losses in 2024, announced to cut $10 billion in costs by 2025, including laying off 15,000 employees, representing more than 15% of its current workforce of over 125,000.The company will reduce R&D and marketing spending by billions annually through 2026, cut capital expenditures by over 20% this year, and restructure to eliminate non-essential work. Additionally, it will review active projects and equipment to optimize spending.Tesla laid off over 20,000 employees across teamsTesla made two rounds of job cuts this year, first reportedly laying off at least 14,000 employees, then again laying off hundreds more, including senior executives and most of its Supercharging team.An email from CEO Elon Musk to executives last night stated that Tesla should be “absolutely hard core” about the cuts. Staffers working under executives who don’t pass the “excellent, necessary, and trustworthy test” will also be laid off.Bloomberg reported that Tesla’s total headcount reduction could reach 20 percent, or over 20,000 employees.Cisco cuts around around 10,000 jobs in two layoff rounds this yearCisco Systems, the networking giant, cut jobs in two rounds this year. First, the company laid off about 5% of its global workforce, around 4,000 employees in February, and then again announced a 7% reduction, cutting around 6,000 more employees. Cisco CEO Chuck Robbins said that, \"we're now returning to a more normalized demand environment,\" as the company shifted its focus towards high-growth areas like AI and cybersecurity this year.SAP announced restructuring, 8,000 employees were affectedSAP plans job changes or buyouts for 8,000 employees in a restructuring plan, over 7% of its 108,000 full-time employees. The company stated that its headcount will remain the same by year-end.Uber cuts over 6,5000 jobsUber laid off a total of 6,700 employees this year, according to layoffs.fyi. The company also closed offices, winded down labs, and was re-evaluating self-driving units due to the decline in ridesharing business during the pandemic.Dell laid off 6,000 employees and continued job cuts later in the year as wellDell did its second significant workforce reduction in two years, cutting around 6,000 em",
    "description2": "ployees amid challenging market conditions. The technology giant's personal computer division has struggled with sluggish demand, experiencing an 11% revenue decline last year. While the numbers aren’t clear, Dell said that it continue to reduce its workforce in 2024 due to cost concerns and a slow rebound in PC demand.Bell cut around 5,000 Jobs on 10-minute video calls Bell, a Canadian telecommunications company, eliminated approximately 4,800 positions—about 9% of its workforce—through 10-minute virtual video call terminations. Bell defends the massive restructuring as a necessary strategic move to simplify its organizational structure and transform its business model, despite the significant human impact of these job cuts.Xerox laid off over 3,000 employees amid restructuring Xerox announced plans to cut 15% of its workforce to implement a new organizational structure and operating model. The company had about 20,500 employees as of December 31, 2022, meaning the layoffs likely affected over 3,000 employees.Xerox’s restructuring plan simplifies its core print business, boosts efficiency in global business services, and focuses on IT and digital services. The company also redesigned its executive team to support the new model.CEO Steven Bandrowczak stated that the shift to a business unit operating model accelerates product and service delivery across all geographies.Microsoft slashes over 2,500 jobs in Gaming division restructuringMicrosoft cut 1,900 jobs across Activision Blizzard, Xbox, and ZeniMax, representing about 8% of its Gaming division. The layoffs, aimed at establishing a more sustainable cost structure, come with notable leadership changes, including the departure of Blizzard president Mike Ybarra and chief design officer Allen Adham. In September, the company cut again 650 staff, primarily from corporate and support roles to align its post-acquisition team structurePaypal cut its workforce by 9%, laying off 2,500 employeesPayPal reduced its workforce by about 9% due to rising competition, profit pressures, and analyst downgrades. CEO Alex Chriss, aim is to “right-size” the company through direct cuts and eliminating open roles throughout the year.PayPal, with around 29,900 workers in 2022, announced job cuts last January, affecting about 2,500 workers this time.Eliminating jobs will help the firm deliver for customers and grow profitably, Chriss said in a letter. However, the company will continue investing in growth areas.Byju’s cut 2,500 jobs this yearByju’s eliminated 5% of its workforce this year, about 2500 employee, in addition to a few more hundred roles, as it struggles with clearing debts.",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115886453/115886453.jpg",
    "image1": "",
    "date": "2/12/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "TOI Tech Desk",
    "datePublished": "2024-12-02T10:44:00+05:30",
    "dateModified": "2024-12-02T10:44:00+05:30"
  },
  {
    "title": "How to apply for PAN 2.0 online and and receive new PAN card on your email ID",
    "link": "https://worldsnews24.vercel.app/tech/how-to-apply-for-pan-2-0-online-and-and-receive-new-pan-card-on-your-email-id",
    "siteurl": "https://worldsnews24.vercel.app/tech/how-to-apply-for-pan-2-0-online-and-and-receive-new-pan-card-on-your-email-id",
    "description": "How to apply for PAN 2.0 online and and receive new PAN card on your email ID",
    "thumbnail": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115808793/115808793.jpg",
    "description1": "The Income Tax Department has introduced PAN 2.0 to streamline the process of allotting and updating Permanent Account Numbers (PAN). Aimed at enhancing convenience and security, this initiative ensures that e-PAN cards, featuring a QR code, are sent to the registered email IDs of applicants free of cost. However, taxpayers must pay a nominal fee for a physical PAN card. Existing PAN cards remain valid even without the QR code. This article provides a detailed overview of PAN 2.0 and a step-by-step guide to applying for and receiving your PAN card digitally.How to apply for PAN 2.0 online and get it on your email IDBefore proceeding, determine whether your PAN was issued by NSDL or UTI Infrastructure Technology and Services Ltd. (UTIITSL). This information is located on the back of your PAN card.Steps to apply for e-PAN via NSDLVisit the NSDL e-PAN Portal - https://www.onlineservices.nsdl.com/paam/requestAndDownloadEPAN.htmlProvide your PAN, Aadhaar (for individuals), and date of birth.115816600Check your details and choose the method for receiving a one-time password (OTP). Enter the OTP within 10 minutes to proceed.115816663115816684Free for up to three requests within 30 days of PAN issuance. Subsequent requests cost Rs 8.26, including GST.115816721115816748After successful payment, the e-PAN will be emailed to your registered ID within 30 minutes.115816787If you face issues, email tininfo@proteantech.in or call 020-27218080 for assistance.Steps to apply for e-PAN via UTIITSLVisit the UTIITSL e-PAN Portal - https://www.pan.utiitsl.com/PAN_ONLINE/ePANCardProvide your PAN, date of birth, and captcha code.If no email is registered, you will need to update it under PAN 2.0 once the project officially launches.F",
    "description2": "ree for e-PANs issued within the last 30 days. Requests after this period cost Rs. 8.26.Your e-PAN will be sent to the registered email ID in PDF format.PAN 2.0 key featuresValidity of Existing PAN CardsExisting PAN cards without QR codes remain valid, ensuring continuity for taxpayers.Digital and Physical PAN Optionse-PAN: Delivered free of cost to the registered email ID for up to three requests. Additional requests incur a minimal charge of Rs. 8.26.Physical PAN Card: Available upon request with a fee of Rs. 50 for domestic delivery. International delivery incurs Rs. 15 plus applicable postal charges.Free UpdatesTaxpayers can update or correct PAN details, including email addresses, for free under PAN 2.0.Importance of QR codes in PAN cardsThe inclusion of QR codes on PAN cards enhances security by providing a quick and reliable way to verify their authenticity. The encrypted data stored in the QR code allows authorities, banks, and other institutions to easily access and confirm the cardholder's details, ensuring protection against counterfeit or fraudulent PAN cards.Benefits of PAN 2.0Enhanced security: QR codes make PAN cards more secure and fraud-resistant.Convenience: Digital delivery eliminates postal delays.Affordability: Minimal charges for additional requests and physical copies.Free updates: Users can update details, including email addresses, at no cost.Important points to rememberAlways check the validity of your email ID in the income tax database before applying.e-PAN requests are processed quickly, often within 30 minutes of payment.For physical PAN cards, ensure that your delivery address is accurate to avoid delays.Also read | Airtel recharge plans | Jio recharge plans | BSNL recharge plans",
    "image": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-115808793/115808793.jpg",
    "image1": "",
    "date": "29/11/2024",
    "time": "Updated 10:00:53 am",
    "courtesy": "TOI Tech Desk",
    "datePublished": "2024-11-29T17:35:00+05:30",
    "dateModified": "2024-11-29T17:35:00+05:30"
  }
]