{
  "videos": [
    {
      "title": "Breaking News: Trump pick Matt Gaetz withdraws from consideration to be US attorney general.",
      "source": "nWAMr3uqqVo",
      "description": "Matt Gaetz had faced significant scrutiny over a previous federal investigation into sex trafficking allegations involving a 17-year-old girl that cast doubt over his ability to be confirmed as the country's top legal official.",
      "thumbnail": "https://e3.365dm.com/24/11/1600x900/skynews-matt-gaetz-usa_6748037.jpg?20241114105218",
      "date": "2024-11-22",
      "time": "10:30 AM",
      "courtesy": "Sky News"
    },
    {
      "title": "Breaking News: Terror Attack In Pakistan",
      "source": "OEJOy_at1F8",
      "description": "Terror Attack In Pakistan, 50 Killed As Gunmen Open Fire In North-West Province Of KPK",
      "description1": "At least 50 killed and 20 injured as gunmen opened fire at passenger vehicles in Khyber Pakhtunkhwa province of Pakistan on Thursday.At least 50 killed and 20 injured as gunmen opened fire at passenger vehicles in Khyber Pakhtunkhwa province of Pakistan on Thursday. However, quoting Ahmady Shama Station House Officer Kaleem Shah, Dawn.com reported that 38 people were killed, including three women, and 11 were injured. Talking to the media outside the Islamabad High Court, Interior Minister Mohsin Naqvi confirmed the attack and the death toll. He said, “This past week has been difficult and upsetting, now 38 people have been martyred in Kurram. We see a new incident every day now and are in constant contact with the KP authorities, KP inspector general of police and the chief minister. They need help.”",
      "description2": "KP government spokesperson Barrister Dr Saif informed the media that personnel were attacked first, and then the passenger convoy was targeted from both sides. He said, “Around 200 vehicles were in the convoy.” Deputy Commissioner of Kurram, Javedullah Mehsud told media that, the two separate convoys of shia community members got targeted by the terrorists in the Kurram district. Both of them contained 40 vehicles under police escort. President Asif Ali Zardari condemned the incident that happened. PPP’s media cell posted on their X handle, saying, “Attacking innocent passengers is a cowardly and inhumane act.” KP CM Ali Amin Gandapur condemned the attack and issued strict notice to the incident. As per media reports, CM called the jirga of that area to be reactivated for improving the situation in Kurram.",
      "thumbnail": "https://news24online.com/wp-content/uploads/2024/11/Untitled-design-2-3.jpg",
      "image": "https://i.ytimg.com/vi/IO6DQMyiK5A/maxresdefault.jpg",
      "image1": "https://images.indianexpress.com/2024/11/Untitled-design-3-2.png",
      "date": "2024-11-21",
      "time": "21:03 PM",
      "courtesy": "ANI"
    },
    {
      "title": "Breaking News: Pakistan Ex-PM Imran Khan Granted Bail ",
      "source": "#",
      "description": "Pakistan Ex-PM Imran Khan Granted Bail In State Gifts Case",
      "description1": "A court in Pakistan has granted bail to former Prime Minister Imran Khan in the state gifts case, according to a report. The Islamabad High Court (IHC) on Wednesday granted bail to former Prime Minister Imran Khan in a recent Toshakhana case. Justice Miangul Hassan Aurangzeb presided over the hearing and approved bail, contingent on the submission of two surety bonds worth Rs. 1 million each. The court directed Khan to cooperate fully with the trial court, warning that his bail could be revoked for non-compliance. The case involves allegations by the Federal Investigation Agency (FIA) that Imran Khan and his wife, Bushra Bibi, illegally retained a luxurious Bulgari jewellery set, including a necklace, earrings, bracelets, and rings—received as a gift from a Saudi royal during their May 2021 visit to the kingdom. The FIA claims that the couple paid a significantly reduced price for the set, causing financial losses to the national exchequer.The IHC granted Imran Khan bail with a condition to appear before the trial court. Failure to comply or cooperate with the trial could lead to the revocation of bail. His wife, Bushra Bibi, had already secured bail in the same case last month.",
      "description2": "A court in Pakistan has granted bail to former Prime Minister Imran Khan in the state gifts case, according to a report. The Islamabad High Court (IHC) on Wednesday granted bail to former Prime Minister Imran Khan in a recent Toshakhana case. Justice Miangul Hassan Aurangzeb presided over the hearing and approved bail, contingent on the submission of two surety bonds worth Rs. 1 million each. The court directed Khan to cooperate fully with the trial court, warning that his bail could be revoked for non-compliance. The case involves allegations by the Federal Investigation Agency (FIA) that Imran Khan and his wife, Bushra Bibi, illegally retained a luxurious Bulgari jewellery set, including a necklace, earrings, bracelets, and rings—received as a gift from a Saudi royal during their May 2021 visit to the kingdom. The FIA claims that the couple paid a significantly reduced price for the set, causing financial losses to the national exchequer.The IHC granted Imran Khan bail with a condition to appear before the trial court. Failure to comply or cooperate with the trial could lead to the revocation of bail. His wife, Bushra Bibi, had already secured bail in the same case last month.",
      "thumbnail": "https://news24online.com/wp-content/uploads/2024/11/Imran-Khan-2.jpg",
      "image": "https://www.reuters.com/resizer/v2/JPBE76POS5IMNBYS2BDMWQNTK4.jpg?auth=fad084773e9852e00dccb559b4f9feda1fc09a189e687ec7f363e5cead0dcac1&width=5500&quality=80",
      "image1": "https://live-production.wcms.abc-cdn.net.au/5a0b2249c6021b5bbed0e3131ca323cf?impolicy=wcms_crop_resize&cropH=2235&cropW=3973&xPos=0&yPos=379&width=862&height=485",
      "date": "2024-11-20",
      "time": "10:30 AM",
      "courtesy": "CNN"
    }
  ]
}