{
  "videos": [
    {
      "title": "What does Trump’s win mean for Ukraine? | Ukraine War.",
      "source": "O-xicOsR4Ro",
      "description": "In his victory speech, president-elect Donald Trump said he was the man who “will stop wars” and make the world a 'safer place' ",
      "thumbnail": "https://i.ytimg.com/vi/O-xicOsR4Ro/maxresdefault.jpg",
       "date": "2024-11-23",
      "time": "21:14 PM",
      "mp3": "https://www.youtube.com/watch?v=i3oX-NPaZ2c&list=PLG8IrydigQffW6a9KQhdtl8C1DwiUD6cb",
      "courtesy": "Sky News"
    },
    {
      "title": "Breaking News: Israeli PM Benjamin Netanyahu Be Arrested For War Crimes?",
      "source": "WBgEf_71vK4",
      "description": "Will Israeli PM Benjamin Netanyahu Be Arrested For War Crimes? ICC Issues Warrant, Details Here",
      "thumbnail": "https://news24online.com/wp-content/uploads/2024/11/Untitled-design-3-1.jpg",
     "description1": "As per media reports Israel has denied any war crimes in Gaza. It claimed to have killed Mohammed Deif in the airstrike.International Criminal Court had issued a warrant against Israeli PM Benjamin Netanyahu, Israel’s former Defence Minister Yoav Gallant and the Chief of Hamas military, Mohammed Deif for alleged war crimes and crime against humanity.Warrant got issued in their name accusing them for war crimes. As per media reports, the statement stated that the pre-trial chamber has rejected Israel’s challenges to International Criminal Court’s jurisdiction. Then issued the warrant against all three-Israeli PM Benjamin Netanyahu, Israel’s former defence minister Yoav Gallant and the chief of Hamas military, Mohammed Deif.This step came after the prosecutor of ICC, Karim Khan who announced on May 20 that he is seeking arrest warrant for the alleged crimes connected with attack on Israel and and Israel’s response in Gaza.According to media reports, the warrant issued for Mohammed Deif have charges related to killing masses during the attack on Israel. Which ignited the Gaza conflict. According to media reports, the panel of three judges wrote that, “The Chamber issued warrants of arrest for two individuals, Mr. Benjamin Netanyahu and Mr. Yoav Gallant, for crimes against humanity and war crimes committed from at least 8 October 2023 until at least 20 May 2024, the day the Prosecution filed the applications for warrants of arrest.” The judges on panel wrote that, ““The chamber considered that there are reasonable grounds to believe that both individuals intentionally and knowingly deprived the civilian population in Gaza of objects indispensable to their survival, including food, water, and medicine and medical supplies, as well as fuel and electricity.”",
      "description2": "As per media reports Israel has denied any war crimes in Gaza. It claimed to have killed Mohammed Deif in the airstrike. Officials from Israel slammed the decision and calls it ‘anti-semitic’.Israeli PM Netanyahu has criticized the ICC after warrant issued by them on his name, calling the decision as ‘absurd and false actions.’ Netanyahu defended action of Israeli’s military in Gaza, in a statement released by his office. TForeign Minister of Israel Gideon Saar, posted on his X handle ,saying, ICC has lost all the legitimacy and mentioned this moment as “a dark moment”.",
      "image": "https://cloudfront-us-east-1.images.arcpublishing.com/opb/FVVMKUQWBNE73H4WNGCQTH3GRE.jpg",
      "image1": "https://ichef.bbci.co.uk/ace/ws/640/cpsprodpb/0290/live/18b27cd0-a808-11ef-b21e-5359bd56d02f.jpg.webp",
      "date": "2024-11-21",
      "time": "21:14 PM",
      "courtesy": "News24"
    },
    {
      "title": "Breaking News: Global Event",
      "source": "#",
      "description": "Pakistan Ex-PM Imran Khan Granted Bail In State Gifts Case",
      "description1": "A court in Pakistan has granted bail to former Prime Minister Imran Khan in the state gifts case, according to a report. The Islamabad High Court (IHC) on Wednesday granted bail to former Prime Minister Imran Khan in a recent Toshakhana case. Justice Miangul Hassan Aurangzeb presided over the hearing and approved bail, contingent on the submission of two surety bonds worth Rs. 1 million each. The court directed Khan to cooperate fully with the trial court, warning that his bail could be revoked for non-compliance. The case involves allegations by the Federal Investigation Agency (FIA) that Imran Khan and his wife, Bushra Bibi, illegally retained a luxurious Bulgari jewellery set, including a necklace, earrings, bracelets, and rings—received as a gift from a Saudi royal during their May 2021 visit to the kingdom. The FIA claims that the couple paid a significantly reduced price for the set, causing financial losses to the national exchequer.The IHC granted Imran Khan bail with a condition to appear before the trial court. Failure to comply or cooperate with the trial could lead to the revocation of bail. His wife, Bushra Bibi, had already secured bail in the same case last month.",
      "description2": "A court in Pakistan has granted bail to former Prime Minister Imran Khan in the state gifts case, according to a report. The Islamabad High Court (IHC) on Wednesday granted bail to former Prime Minister Imran Khan in a recent Toshakhana case. Justice Miangul Hassan Aurangzeb presided over the hearing and approved bail, contingent on the submission of two surety bonds worth Rs. 1 million each. The court directed Khan to cooperate fully with the trial court, warning that his bail could be revoked for non-compliance. The case involves allegations by the Federal Investigation Agency (FIA) that Imran Khan and his wife, Bushra Bibi, illegally retained a luxurious Bulgari jewellery set, including a necklace, earrings, bracelets, and rings—received as a gift from a Saudi royal during their May 2021 visit to the kingdom. The FIA claims that the couple paid a significantly reduced price for the set, causing financial losses to the national exchequer.The IHC granted Imran Khan bail with a condition to appear before the trial court. Failure to comply or cooperate with the trial could lead to the revocation of bail. His wife, Bushra Bibi, had already secured bail in the same case last month.",
      "thumbnail": "https://news24online.com/wp-content/uploads/2024/11/Imran-Khan-2.jpg",
      "image": "https://www.reuters.com/resizer/v2/JPBE76POS5IMNBYS2BDMWQNTK4.jpg?auth=fad084773e9852e00dccb559b4f9feda1fc09a189e687ec7f363e5cead0dcac1&width=5500&quality=80",
      "image1": "https://live-production.wcms.abc-cdn.net.au/5a0b2249c6021b5bbed0e3131ca323cf?impolicy=wcms_crop_resize&cropH=2235&cropW=3973&xPos=0&yPos=379&width=862&height=485",
      "date": "2024-11-20",
      "time": "10:30 AM",
      "courtesy": "CNN"
    }
  ]
}